import Morpho from "../morpho.mjs";

class AraMorpho extends Morpho {
  //These static members must be overriden in extended classes;
  //otherwise, the class won't function properly
  //Contains stemmers
  static stemmers = {};
  //Contains PoS conversions
  static converters = {};
  static cstemmer = "";//current stemmer
  static cconverter = "";//current converter
  static langCode = "ara";
  static ssplitter = /([.؟!])(?:\s+|$)/;

  //==========================================
  // STEMMING FUNCTIONS
  //==========================================


  //==========================================
  // CONJUGATION PROTECTED FUNCTIONS
  //==========================================
  static _conj(verb, _opts){
    return __conj(verb, _opts);
  }

  //==========================================
  // CONJUGATION OPTIONS PUBLIC FUNCTIONS
  //==========================================

  static getTenseName(tense) {
    switch (tense) {
      case Morpho.Tense.Pa:
        return "الماضي";
      case Morpho.Tense.Pr:
        return "المضارع";
      case Morpho.Tense.Fu:
        return "المستقبل";
    }

    return "";
  }

  static lform() {
    //super doesn't work here
    let superFrm = Morpho.lform();
    const araForms =  {
      "imp": {
        desc: "Imperative",
        mood: Morpho.Mood.Imp
      }
    };

    return Object.assign({}, superFrm, araForms);
  }

  //==========================================
  // CONJUGATION OPTIONS PROTECTED FUNCTIONS
  //==========================================

  static _gPpOpts() {
    return [
        {person:Morpho.Person.F, number: Morpho.GNumber.S},
        {person:Morpho.Person.F, number: Morpho.GNumber.P},

        {person:Morpho.Person.S, number: Morpho.GNumber.S, gender: Morpho.Gender.M},
        {person:Morpho.Person.S, number: Morpho.GNumber.S, gender: Morpho.Gender.F},
        {person:Morpho.Person.S, number: Morpho.GNumber.D, gender: Morpho.Gender.M},
        {person:Morpho.Person.S, number: Morpho.GNumber.D, gender: Morpho.Gender.F},
        {person:Morpho.Person.S, number: Morpho.GNumber.P, gender: Morpho.Gender.M},
        {person:Morpho.Person.S, number: Morpho.GNumber.P, gender: Morpho.Gender.F},

        {person:Morpho.Person.T, number: Morpho.GNumber.S, gender: Morpho.Gender.M},
        {person:Morpho.Person.T, number: Morpho.GNumber.S, gender: Morpho.Gender.F},
        {person:Morpho.Person.T, number: Morpho.GNumber.D, gender: Morpho.Gender.M},
        {person:Morpho.Person.T, number: Morpho.GNumber.D, gender: Morpho.Gender.F},
        {person:Morpho.Person.T, number: Morpho.GNumber.P, gender: Morpho.Gender.M},
        {person:Morpho.Person.T, number: Morpho.GNumber.P, gender: Morpho.Gender.F}
    ];
  }

  static _gPpName(opts) {
    return pronouns[__getPronounIndex(opts)];
  }

  //==========================================
  // NORMALIZATION FUNCTIONS
  //==========================================

  /**
   * Normalization method for Arabic: it helps delete vocalization
   * <ul>
   * <li> voc: delete vocalization </li>
   * <li> alef: Replace all alef variants with the simple alef </li>
   * <li> ihamza: Replace all beginning hamza variants with the simple alef </li>
   * <li> yeh: Relace the alif maqsorah with yeh </li>
   * <li> teh: Replace teh marbuta with heh </li>
   * <li> _: Delete tatweel </li>
   * </ul>
   * @method norm
   * @override
   * @memberof AraMorpho
   * @param  {String} word the word to be normalized
   * @param  {String} opts some options (optional) where each language defines its own
   * normalization options
   * @return {String}      normalized word
   **/
  static norm(word, opts) {
    let norm = word.trim();

    //If no options are afforded, do all
    if (! opts || opts.length < 1) {
      opts = "voc,alef,yeh,teh,_";
    }

    //Delete vocals: fathah, kasrah, etc.
    if (opts.includes("voc")) {
      norm = norm.replace(/[َ ً ُ ٍ ْ ِ ٌ]/g, "");
    }

    //Replace all alef variants with the simple alef
    if (opts.includes("alef")) {
      norm = norm.replace(/[أإآ]/g, "ا");
    }

    //Replace initial hamza with alef
    if (opts.includes("ihamza")) {
      norm = norm.replace(/^[أإآ]/g, "ا");
    }

    //Relace the alif maqsorah with yeh
    if (opts.includes("yeh")) {
      norm = norm.replace(/[ى]/g, "ي");
    }

    //Replace teh marbuta with heh
    if (opts.includes("teh")) {
      norm = norm.replace(/[ة]/g, "ه");
    }

    //Delete tatweel
    if (opts.includes("_")) {
      norm = norm.replace(/[ـ]+/g, "");
    }

    return norm;

  }

  //==========================================
  // SEGMENTATION FUNCTIONS
  //==========================================

  /*
   * Segment a given text
   */

  /*
   * Tokenization is the same as morpho
   */



} //End of class


//==========================================
// CONSTANTS
//==========================================

/**
 * List of Arabic personal pronouns
 * @private
 * @static
 * @type {Array}
 */
const pronouns = [
  "أَنَا", "نَحْنُ",
  "أَنْتَ", "أَنْتِ", "أَنْتُمَا", "أَنْتُمَا", "أَنْتُمْ", "أَنْتُنَّ",
  "هُوَ", "هِيَ", "هُمَا", "هُمَا", "هُمْ", "هُنَّ"
];

const conjAffix = {
  [Morpho.Tense.Pr]: {
    prefix: ["أَ", "نَ", "تَ", "تَ", "تَ", "تَ", "تَ", "تَ", "يَ", "تَ", "يَ", "تَ", "يَ", "يَ"],
    suffix: ["ُ", "ُ", "ُ", "ِينَ", "َانِ", "َانِ", "ُونَ", "ْنَ", "ُ", "ُ", "َانِ", "َانِ", "ُونَ", "ْنَ"]
  },
  [Morpho.Tense.Pa]: {
    prefix: [],
    suffix: ["ْتُ", "ْنَا", "ْتَ", "ْتِ", "ْتُمَا", "ْتُمَا", "ْتُمْ", "ْتُنَّ", "َ", "َتْ", "َا", "َتَا", "ُوا", "ْنَ"]
  }
};

//verbs taken from Shereen Khoja stemmer
//http://zeus.cs.pacificu.edu/shereen/research.htm
const midWaw = {
  "أب": 1, "أج": 1, "أد": 1, "أر": 1, "أز": 1, "أش": 1, "أض": 1, "أف": 1, "أق": 1, "أل": 1, "أن": 1, "أه": 1, "أي": 1,

  "بب": 1, "بح": 1, "بخ": 1, "بر": 1, "بز": 1, "بس": 1, "بش": 1, "بص": 1, "بغ": 1, "بق": 1, "بل": 1,

  "تب": 1, "تج": 1, "تق": 1,

  "ثب": 1, "ثر": 1, "ثل": 1, "ثي": 1,

  "جب": 1, "جح": 1, "جد": 1, "جر": 1, "جز": 1, "جس": 1, "جط": 1, "جع": 1, "جف": 1, "جق": 1, "جل": 1, "جن": 1, "جو": 1, "جي": 1,

  "حب": 1, "حت": 1, "حث": 1, "حج": 1, "حذ": 1, "حز": 1, "حس": 1, "حش": 1, "حص": 1, "حط": 1, "حف": 1, "حق": 1, "حك": 1, "حل": 1, "حم": 1, "حي": 1,

  "خج": 1, "خخ": 1, "خذ": 1, "خر": 1, "خص": 1, "خض": 1, "خل": 1, "خن": 1, "خو": 1, "خي": 1,

  "دء": 1, "دب": 1, "دح": 1, "دخ": 1, "دد": 1, "در": 1, "دس": 1, "دش": 1, "دط": 1, "دغ": 1, "دف": 1, "دق": 1, "دك": 1, "دل": 1, "دم": 1, "دن": 1, "دي": 1,

  "ذب": 1, "ذد": 1, "ذق": 1, "ذي": 1,

  "رب": 1, "رث": 1, "رج": 1, "رح": 1, "رد": 1, "رز": 1, "رس": 1, "رض": 1, "رع": 1, "رغ": 1, "رق": 1, "رل": 1, "رم": 1, "ري": 1,

  "زج": 1, "زح": 1, "زر": 1, "زغ": 1, "زق": 1, "زل": 1, "زم": 1, "زن": 1, "زي": 1,

  "سء": 1, "سج": 1,  "سخ": 1, "سد": 1,  "سط": 1, "سع": 1, "سغ": 1, "سف": 1, "سق": 1, "سك": 1, "سم": 1, "سي": 1,

  "شب": 1, "شر": 1, "شش": 1, "شط": 1, "شظ": 1, "شف": 1, "شق": 1, "شك": 1, "شل": 1, "شم": 1, "شه": 1, "شي": 1,

  "صب": 1, "صت": 1, "صج": 1, "صح": 1, "صص": 1, "صع": 1, "صغ": 1, "صف": 1, "صل": 1, "صم": 1, "صن": 1,

  "ضء": 1, "ضج": 1, "ضر": 1, "ضي": 1,

  "طح": 1, "طد": 1, "طس": 1, "طع": 1, "طف": 1, "طق": 1, "طل": 1, "طي": 1,

  "عج": 1, "عد": 1, "عذ": 1, "عر": 1, "عز": 1, "عص": 1, "عض": 1, "عق": 1, "عل": 1, "عم": 1, "عن": 1, "عه": 1, "عي": 1,

  "غء": 1, "غر": 1, "غز": 1, "غش": 1, "غص": 1, "غط": 1, "غغ": 1, "غل": 1, "غي": 1,

  "فت": 1, "فج": 1, "فح": 1, "فد": 1, "فر": 1, "فز": 1, "فط": 1, "فع": 1, "فف": 1, "فق": 1, "فل": 1, "فه": 1,

  "قب": 1, "قت": 1, "قد": 1, "قر": 1, "قش": 1, "قص": 1, "قض": 1, "قط": 1, "قع": 1, "قق": 1, "قل": 1, "قم": 1, "قن": 1, "قه": 1, "قي": 1,

  "كب": 1, "كخ": 1, "كر": 1, "كز": 1, "كس": 1, "كش": 1, "كع": 1, "كف": 1, "كك": 1, "كم": 1, "كن": 1, "كي": 1,

  "لب": 1, "لث": 1, "لج": 1, "لح": 1, "لذ": 1, "لز": 1, "لس": 1, "لص": 1, "لط": 1, "لع": 1, "لف": 1, "لك": 1, "لم": 1, "لي": 1,

  "مء": 1, "مت": 1, "مج": 1, "مر": 1, "من": 1, "مه": 1,

  "نء": 1, "نب": 1, "نت": 1, "نح": 1, "نخ": 1, "ند": 1, "نر": 1, "نس": 1, "نش": 1, "نص": 1, "نط": 1, "نع": 1, "نف": 1, "نق": 1,  "نن": 1, "نه": 1, "نو": 1, "ني": 1,

  "هت": 1, "هد": 1, "هر": 1, "هس": 1, "هش": 1, "هع": 1, "هل": 1, "هن": 1, "هو": 1, "هي": 1,

  "يد": 1, "يم": 1
},
midYaa = {
  "أب": 1, "أد": 1, "أر": 1, "أس": 1, "أض": 1, "أك": 1, "أل": 1, "أم": 1, "أن": 1,

  "بت": 1, "بد": 1, "بض": 1, "بع": 1, "بن": 1,

  "تح": 1, "تر": 1, "تس": 1, "تل": 1, "تم": 1, "ته": 1,

  "جء": 1, "جش": 1, "جف": 1,

  "حث": 1, "حد": 1, "حر": 1, "حض": 1, "حف": 1, "حق": 1, "حك": 1, "حن": 1, "حو": 1, "حي": 1,

  "خب": 1, "خس": 1, "خش": 1, "خط": 1, "خل": 1, "خم": 1,

  "دث": 1, "دك": 1, "دن": 1,

  "ذع": 1, "ذل": 1,

  "رب": 1, "رس": 1, "رش": 1, "رع": 1, "رف": 1, "رل": 1, "رن": 1, "ري": 1,

  "زت": 1, "زح": 1, "زد": 1, "زز": 1, "زغ": 1, "زف": 1, "زق": 1, "زن": 1, "زي": 1,

  "سب": 1, "سح": 1, "سخ": 1, "سر": 1, "سف": 1, "سل": 1,

  "شب": 1, "شت": 1, "شح": 1, "شخ": 1, "شد": 1, "شط": 1, "شع": 1, "شف": 1, "شق": 1, "شل": 1, "شم": 1, "شن": 1,

  "صب": 1, "صح": 1, "صد": 1, "صر": 1, "صص": 1, "صع": 1, "صف": 1,

  "ضر": 1, "ضع": 1, "ضف": 1, "ضق": 1, "ضم": 1,

  "طب": 1, "طح": 1, "طر": 1, "طش": 1, "طع": 1, "طن": 1,

  "عب": 1, "عث": 1, "عر": 1, "عس": 1, "عش": 1, "عط": 1, "عف": 1, "عن": 1, "عه": 1, "عي": 1,

  "غب": 1, "غث": 1, "غد": 1, "غر": 1, "غض": 1, "غط": 1, "غظ": 1, "غل": 1, "غم": 1, "غن": 1, "غي": 1,

  "فء": 1, "فد": 1, "فش": 1, "فض": 1, "فظ": 1, "فف": 1, "فل": 1, "فن": 1,

  "قء": 1, "قح": 1, "قر": 1, "قس": 1, "قش": 1, "قض": 1, "قظ": 1, "قف": 1, "قن": 1, "قي": 1,

  "كد": 1, "كر": 1, "كس": 1, "كف": 1, "كل": 1, "كي": 1,

  "لث": 1, "لس": 1, "لق": 1, "لل": 1, "لن": 1, "لي": 1,

  "مح": 1, "مد": 1, "مر": 1, "مز": 1, "مس": 1, "مط": 1, "مع": 1, "مل": 1, "من": 1,

  "نق": 1, "نك": 1, "ني": 1,

  "هء": 1, "هب": 1, "هت": 1, "هج": 1, "هر": 1, "هش": 1, "هض": 1, "هط": 1, "هف": 1, "هل": 1, "هم": 1,

  "وب": 1, "ول": 1
};

//length one prefixes
const isriP1 = ["ل", "ب", "ف", "س", "و", "ي", "ت", "ن", "ا"],
//length two prefixes
isriP2 = ["ال", "لل"],
//length three prefixes
isriP3 = ["كال", "بال", "ولل", "وال"],
//length one suffixes
isriS1 = ["ة", "ه", "ي", "ك", "ت", "ا", "ن"],
//length two suffixes
isriS2 = ["ون", "ات", "ان", "ين", "تن", "كم", "هن", "نا", "يا", "ها", "تم",
"كن", "ني", "وا", "ما", "هم"],
//length three suffixes
isriS3 = ["تمل", "همل", "تان", "تين", "كمل"];


const STOP_WORDS = {

  "وعداهم": 1, "وكإياكن": 1, "وكإياكم": 1, "فباللتين": 1, "وبماذا": 1,
 "وكبعضكما": 1, "وعدانا": 1, "أفكعيننا": 1, "بغير": 1, "فإنهن": 1,
 "ولنا": 1, "أفبنفس": 1, "فبتلكم": 1, "أفبكلهما": 1, "وكبعضنا": 1,
 "وبحسبكما": 1, "عليهما": 1, "بكلتا": 1, "أفبهنالك": 1, "لفونا": 1,
 "لحسبي": 1, "أإلينا": 1, "لحسبه": 1, "لحسبك": 1, "فبأخي": 1,
 "فبأخه": 1, "ولست": 1, "فبأخك": 1, "فلإليه": 1, "فإنهم": 1,
 "فباللتيا": 1, "ولكلكما": 1, "بأقلنا": 1, "فإنها": 1, "ألعن": 1,
 "ألعل": 1, "أفكبعضكما": 1, "فكأقل": 1, "فلنفسهن": 1, "أوعينكن": 1,
 "أفلشبهها": 1, "ولعنهن": 1, "ولعلينا": 1, "ولعنهم": 1, "أفلغيرهم": 1,
 "أفلغيرهن": 1, "ألإنها": 1, "ولأقلك": 1, "وسويهن": 1, "أفلكأنها": 1,
 "وسويهم": 1, "بإياهما": 1, "إلى": 1, "فلتلقاءها": 1, "وكغيره": 1,
 "وكغيرك": 1, "وليتكن": 1, "وليتكم": 1, "وكغيري": 1, "وعندكم": 1,
 "فلتلقاءهم": 1, "ومعاذهما": 1, "فلتلقاءهن": 1, "أوكعينكما": 1, "سبحانكما": 1,
 "وكحمه": 1, "فبجميعك": 1, "وكحمك": 1, "فبجميعه": 1, "فلكنكما": 1,
 "فبجميعي": 1, "لكنما": 1, "وكحمي": 1, "فلدنه": 1, "فكهناك": 1,
 "ألأجمعهن": 1, "أكأجمعي": 1, "فكهاتين": 1, "فبنفسكما": 1, "بشبه": 1,
 "حواليكن": 1, "بتلقاءنا": 1, "أكأجمعه": 1, "فذانك": 1, "أفلغيرها": 1,
 "ألإنهن": 1, "ألإنهم": 1, "أفلكأنهم": 1, "وسويها": 1, "أفكلتا": 1,
 "فكإنها": 1, "أولنحوكما": 1, "وأجمعكم": 1, "وأجمعكن": 1, "أوبإني": 1,
 "بذينك": 1, "أوكلما": 1, "أوبإنك": 1, "أوبإنه": 1, "أتلك": 1,
 "وكشبهكما": 1, "أونحونا": 1, "شمالكن": 1, "فلقلما": 1, "حولهم": 1,
 "فمعنا": 1, "فلكلهم": 1, "أفلستم": 1, "فلإنه": 1, "أذين": 1,
 "فبهذين": 1, "أبعضها": 1, "ولسن": 1, "أمنكن": 1, "فلإني": 1,
 "أمنكم": 1, "فلأجمعي": 1, "ككلتا": 1, "حولها": 1, "فلأجمعك": 1,
 "بعدنا": 1, "أفكحسب": 1, "فلأجمعه": 1, "متى": 1, "فعندكم": 1,
 "وظل": 1, "فكعينكما": 1, "فعندكن": 1, "أفلعلى": 1, "أفهكذا": 1,
 "فكبعضهما": 1, "فلفوقكم": 1, "فلفوقكن": 1, "ضمني": 1, "وضمنكن": 1,
 "لعمرها": 1, "فاللتيا": 1, "فبأننا": 1, "فجميعهما": 1, "أفي": 1,
 "ولحسبكن": 1, "ولحسبكم": 1, "أفككلهما": 1, "أوكجميعنا": 1, "للتيا": 1,
 "ولفوقنا": 1, "ولجميعنا": 1, "وشرع": 1, "م": 1, "لتحتكما": 1,
 "وبأقلنا": 1, "أخلفكما": 1, "فقلما": 1, "للتين": 1, "أفإليه": 1,
 "أفإليك": 1, "لتلك": 1, "ألكليكما": 1, "فمما": 1, "فبأخهما": 1,
 "ولستما": 1, "لعمرهم": 1, "لعمرهن": 1, "ولغيركن": 1, "ولغيركم": 1,
 "أفليست": 1, "وآناء": 1, "أفليسا": 1, "أونفس": 1, "أولذاك": 1,
 "أفتحتها": 1, "أونفسهن": 1, "أونفسهم": 1, "أوذواتا": 1, "فيمينهم": 1,
 "فخلفكن": 1, "فخلفكم": 1, "لعينكما": 1, "أفإنهن": 1, "وكحسبكن": 1,
 "وكحسبكم": 1, "أفإنهم": 1, "أوسويهم": 1, "أوسويهن": 1, "لنحوه": 1,
 "لأيهن": 1, "لأيهم": 1, "لنحوي": 1, "أفطالما": 1, "أوسويها": 1,
 "أفلعين": 1, "أغيرهما": 1, "بنحو": 1, "وتلقاءنا": 1, "بتجاهكما": 1,
 "لأيها": 1, "تين": 1, "أبعض": 1, "أفتحتهم": 1, "ألمثلهما": 1,
 "أفتحتهن": 1, "أونفسها": 1, "أإليهما": 1, "فلإليك": 1, "تجاهنا": 1,
 "ولتجاهكما": 1, "وكأنكما": 1, "أفلإليهما": 1, "أفإنها": 1, "فلجميع": 1,
 "فلعامتكم": 1, "أكذا": 1, "كإنكن": 1, "أوعامتنا": 1, "معنا": 1,
 "لحمكن": 1, "أوذانك": 1, "لحمكم": 1, "فخلالكما": 1, "ولكنما": 1,
 "أكذاك": 1, "بينهم": 1, "بينهن": 1, "فبنفسكم": 1, "أعليكما": 1,
 "أمنهما": 1, "أوعنها": 1, "مثلهم": 1, "مثلهن": 1, "أوجميعهما": 1,
 "أفبمثلي": 1, "بينها": 1, "أفبمثله": 1, "أفبمثلك": 1, "فعامتها": 1,
 "أفأجمعنا": 1, "فلأنتم": 1, "فلأنتن": 1, "أوعنهن": 1, "أوعنهم": 1,
 "مثلها": 1, "بأجمعكما": 1, "ولأصبح": 1, "أكذي": 1, "أعامتهما": 1,
 "أفبعض": 1, "أوأمامك": 1, "وإنكما": 1, "ألأجمعها": 1, "أفكعامتك": 1,
 "وخلفكم": 1, "وخلفكن": 1, "فرويدك": 1, "أفسوينا": 1, "فحول": 1,
 "لقام": 1, "الففو": 1, "أإنكن": 1, "أإنكم": 1, "أومن": 1,
 "وكسوينا": 1, "أفلفيي": 1, "أفكذلكن": 1, "الفو": 1, "أوغيركم": 1,
 "أوغيركن": 1, "أومما": 1, "أليمينهن": 1, "أليمينهم": 1, "أومع": 1,
 "أوبجميعكم": 1, "أوبجميعكن": 1, "صار": 1, "باللتين": 1, "أفبعينكما": 1,
 "أفمعي": 1, "وبغير": 1, "ولأقله": 1, "أفمعه": 1, "أمثلهما": 1,
 "لته": 1, "لتي": 1, "أكثرهم": 1, "كهاتين": 1, "وبعينها": 1,
 "فبأبك": 1, "وحتى": 1, "وأبكم": 1, "وأبكن": 1, "أبغيركم": 1,
 "أبغيركن": 1, "وخلاله": 1, "ولشبهكن": 1, "أوكلك": 1, "أوكله": 1,
 "كأيها": 1, "ولأقلي": 1, "وأصبح": 1, "أفلبعضهما": 1, "ولهناك": 1,
 "أوكلا": 1, "ألأنت": 1, "فلأقبل": 1, "وبعامتك": 1, "ألأنا": 1,
 "فعامتنا": 1, "أكثرها": 1, "وبعينهن": 1, "وبعينهم": 1, "أبشبهكما": 1,
 "وكأخكما": 1, "وفيكما": 1, "وخلالي": 1, "فلكرب": 1, "أولكليهما": 1,
 "وعداها": 1, "ألنحوك": 1, "وأولئك": 1, "ألنحوه": 1, "ألنحوي": 1,
 "أعامتها": 1, "أفنحوكن": 1, "وبالذين": 1, "أفكلكما": 1, "معهم": 1,
 "لشبهها": 1, "كأخكم": 1, "كأخكن": 1, "فجعل": 1, "فكمثلها": 1,
 "فلغيرنا": 1, "أفلأجمعهما": 1, "ولسويها": 1, "وكالذين": 1, "لسويهن": 1,
 "لسويهم": 1, "وإليكم": 1, "وإليكن": 1, "أفعامتها": 1, "فلإلى": 1,
 "ولنفسهما": 1, "فلإلي": 1, "وعني": 1, "لسويها": 1, "لتينك": 1,
 "أويمين": 1, "وكتجاههما": 1, "أعامتهم": 1, "فباللذين": 1, "فببعضهما": 1,
 "وعنك": 1, "لشبههم": 1, "لشبههن": 1, "فكمثلهن": 1, "فكمثلهم": 1,
 "فعند": 1, "وببعضي": 1, "وبأخنا": 1, "وببعضك": 1, "وسوف": 1,
 "وببعضه": 1, "أعامتي": 1, "أوببعض": 1, "ولأكثرنا": 1, "أوبنحوهم": 1,
 "أوبنحوهن": 1, "كذانك": 1, "فلسويها": 1, "بأنكما": 1, "ولأبه": 1,
 "خلالي": 1, "ولأبي": 1, "ومنهما": 1, "خلاله": 1, "خلالك": 1,
 "أولنفسه": 1, "فلأمامنا": 1, "ألأمامه": 1, "أولنفسك": 1, "أولأمامه": 1,
 "ألأمامك": 1, "ومتى": 1, "أولأمامي": 1, "أولنحوهم": 1, "ألأمامي": 1,
 "أولنحوهن": 1, "فبشبهنا": 1, "فكأخكم": 1, "فكأخكن": 1, "فلسويهم": 1,
 "أفكنفسها": 1, "فتحتهما": 1, "ألنفسهن": 1, "ألنفسهم": 1, "ألديكما": 1,
 "أوكذلك": 1, "أولنحوها": 1, "وبتلقاء": 1, "ومعاذك": 1, "أفبأجمع": 1,
 "ومعاذه": 1, "أفكبعض": 1, "تجاههن": 1, "وكهؤلاء": 1, "ولاسيما": 1,
 "ولسويهم": 1, "أوكحسبي": 1, "أفعامته": 1, "بغيركن": 1, "بغيركم": 1,
 "أوكحسبك": 1, "أوبنحوها": 1, "أوكحسبه": 1, "أفعامتي": 1, "فلأجمعهم": 1,
 "أكأولئك": 1, "فبحيث": 1, "فمعاذه": 1, "أنحوهما": 1, "كبعضكما": 1,
 "ومعاذكما": 1, "أوأجمعنا": 1, "للألى": 1, "فبعضهم": 1, "وبهنالك": 1,
 "فبعضهن": 1, "فلبعضها": 1, "فبات": 1, "أوبغيرنا": 1, "جميعك": 1,
 "فلشبه": 1, "جميعه": 1, "أفلفيهما": 1, "جميعي": 1, "ببعضهما": 1,
 "وبكلها": 1, "فابتدأ": 1, "كأخه": 1, "كأخك": 1, "أبجميعهما": 1,
 "أوبذي": 1, "أفكلا": 1, "بالذي": 1, "فشرع": 1, "أولعلينا": 1,
 "ألأجمعهم": 1, "أوليمينهما": 1, "وبكلهن": 1, "وبكلهم": 1, "إذا": 1,
 "فعننا": 1, "أفكلك": 1, "أفكله": 1, "أبإنكم": 1, "وبجميعنا": 1,
 "لشمال": 1, "وكأجمعي": 1, "وهيا": 1, "وكأجمعه": 1, "وهيت": 1,
 "وكأجمعك": 1, "وبأبكن": 1, "أفمثله": 1, "وبأبكم": 1, "أفمثلك": 1,
 "فبعضها": 1, "فلبعضهن": 1, "فلبعضهم": 1, "أفمثلي": 1, "أوأولاء": 1,
 "أبك": 1, "وإياها": 1, "يمينهم": 1, "يمينهن": 1, "أبه": 1,
 "أولعيننا": 1, "أبي": 1, "أوليس": 1, "ولعنها": 1, "أوبها": 1,
 "لأقلها": 1, "حواليكم": 1, "أوكحسبها": 1, "فككلك": 1, "وكعامتكم": 1,
 "أفأجمعكما": 1, "فتجاه": 1, "فككله": 1, "تجاهكما": 1, "ولأيكم": 1,
 "ولأيكن": 1, "كسوينا": 1, "فلتجاههن": 1, "ابتدأ": 1, "فلتجاههم": 1,
 "أوكشبهه": 1, "فبذات": 1, "أوكشبهك": 1, "أوهذا": 1, "أولمعي": 1,
 "سوى": 1, "سوي": 1, "أوكشبهي": 1, "وراح": 1, "أولمعك": 1,
 "ففيما": 1, "فنفسهما": 1, "فبضعكما": 1, "فلتجاهها": 1, "أوهذه": 1,
 "أوبضعهن": 1, "فبذاك": 1, "أوبضعهم": 1, "كحيث": 1, "أعنكن": 1,
 "أعنكم": 1, "أفلأنت": 1, "وإياهم": 1, "يمينها": 1, "أفلأنا": 1,
 "أوبهن": 1, "أوبهم": 1, "لأقلهن": 1, "أفلهما": 1, "لأقلهم": 1,
 "أكذلكما": 1, "أفلكأنهن": 1, "أوكحسبهم": 1, "أوبهي": 1, "أوكحسبهن": 1,
 "أفنحونا": 1, "ولمنهن": 1, "وأقلكما": 1, "إذن": 1, "ولأخنا": 1,
 "لكي": 1, "لكن": 1, "لكل": 1, "لكم": 1, "فحولهن": 1,
 "ولشبهنا": 1, "أفكتينك": 1, "لأكثرهما": 1, "فشمالكما": 1, "فلتجاهكما": 1,
 "فلحار": 1, "وكإياي": 1, "ولمنها": 1, "وكإياك": 1, "وكإياه": 1,
 "أكعامتي": 1, "لذواتي": 1, "وبأيي": 1, "أكعامته": 1, "الوأب": 1,
 "ولتلك": 1, "الوأخ": 1, "وبأيك": 1, "بأنهن": 1, "بأنهم": 1,
 "فلمعكما": 1, "رجع": 1, "أفليس": 1, "فلكلهما": 1, "أفلعليك": 1,
 "ئ": 1, "بهنالك": 1, "ولشمالهما": 1, "أفمننا": 1, "أوهو": 1,
 "أوهي": 1, "أوأجمعكما": 1, "أولحسبهم": 1, "أولحسبهن": 1, "أوهم": 1,
 "أوهن": 1, "وكهما": 1, "أبتلك": 1, "بهذين": 1, "واللائي": 1,
 "وبأكثركم": 1, "أولحسبها": 1, "ورب": 1, "ألشبه": 1, "لعليه": 1,
 "لعليك": 1, "لأضحى": 1, "بهم": 1, "أكذين": 1, "بأنها": 1,
 "ولشمالكما": 1, "ولستم": 1, "أغيرك": 1, "فلظل": 1, "أولكأنكما": 1,
 "ولستن": 1, "فعندنا": 1, "بتلقاءه": 1, "بتلقاءك": 1, "فجميعهم": 1,
 "أمامنا": 1, "أوليمينها": 1, "بتلقاءي": 1, "أوعينهما": 1, "لنفسهما": 1,
 "ولعينه": 1, "أفببعض": 1, "ولعينك": 1, "كغيرهما": 1, "ولعيني": 1,
 "وهنالك": 1, "وبنحونا": 1, "أولذانك": 1, "وعنده": 1, "أوبسوي": 1,
 "أولحسبي": 1, "أفلعينكما": 1, "أفبنحوكم": 1, "وكذاك": 1, "أولحسبه": 1,
 "أولإننا": 1, "أولحسبك": 1, "أوكشبهكما": 1, "بالألاء": 1, "فلغيرهما": 1,
 "فلعيننا": 1, "فكإياهما": 1, "فلإياكما": 1, "فلكنهن": 1, "فلأجمعهما": 1,
 "أفلستن": 1, "ولذانك": 1, "ولأمامك": 1, "أخكما": 1, "أوليمينهم": 1,
 "أوليمينهن": 1, "ولأمامي": 1, "وباللذين": 1, "فلفوقهن": 1, "أبحسبها": 1,
 "وكأكثر": 1, "لفوقكما": 1, "أولكلكما": 1, "فذي": 1, "وتحتكما": 1,
 "فذو": 1, "أوإليكما": 1, "أولغيركما": 1, "فلإنك": 1, "فذه": 1,
 "أبعيني": 1, "تحتكما": 1, "أفبهاتين": 1, "فأخه": 1, "أولكأنكن": 1,
 "أفكمثلكم": 1, "أفكمثلكن": 1, "فاخلولق": 1, "فلعلنا": 1, "ف": 1,
 "فكحم": 1, "وبذلكن": 1, "وبذلكم": 1, "فلديكما": 1, "فلمعي": 1,
 "فخلفي": 1, "فلمعه": 1, "فخلفه": 1, "بحمهما": 1, "فلمعك": 1,
 "فخلفك": 1, "أفلتلك": 1, "أونحوي": 1, "أبحسبهم": 1, "فإنما": 1,
 "أبحسبهن": 1, "فحيثما": 1, "فهاؤم": 1, "أويمينهما": 1, "معاذي": 1,
 "وببعضنا": 1, "فذا": 1, "معاذه": 1, "آنفا": 1, "أفكجميعهما": 1,
 "أفلذي": 1, "ألكأنما": 1, "فكحسبهن": 1, "فكحسبهم": 1, "أولأمام": 1,
 "وخلفهم": 1, "وخلفهن": 1, "أونحوك": 1, "وكبعضهما": 1, "وإياكما": 1,
 "فكتجاهنا": 1, "أولعينهما": 1, "فحينه": 1, "لدينا": 1, "فكأخكما": 1,
 "وبكم": 1, "وبكل": 1, "وبكن": 1, "وعسى": 1, "أليمينكن": 1,
 "أليمينكم": 1, "أولكأن": 1, "أشمالهما": 1, "كاللاتي": 1, "أولكلك": 1,
 "أفكإنهما": 1, "أوكشبههما": 1, "فأولئكم": 1, "وقد": 1, "ألسويه": 1,
 "ألسويك": 1, "فكحسبها": 1, "أففلان": 1, "وكإننا": 1, "وقط": 1,
 "ولكلهما": 1, "ولأقبل": 1, "كإنك": 1, "أفلأولاء": 1, "كإنه": 1,
 "ألأولئكم": 1, "كإني": 1, "فبإنها": 1, "بعينكما": 1, "فبهذا": 1,
 "فلأجمعنا": 1, "أفكمثله": 1, "وأبهم": 1, "أفكمثلك": 1, "ببعض": 1,
 "أفكمثلي": 1, "تحتي": 1, "فكأنما": 1, "تحته": 1, "أفلأمامه": 1,
 "تحتك": 1, "ففوقي": 1, "وأبها": 1, "لمثلكما": 1, "أوماذا": 1,
 "ولخلفنا": 1, "وأكثرنا": 1, "ومرة": 1, "كنفسك": 1, "ألبعضهما": 1,
 "كنفسه": 1, "فبإنهم": 1, "كنفسي": 1, "فبإنهن": 1, "أفبعامتهما": 1,
 "أفككلنا": 1, "وبعينكن": 1, "وبعينكم": 1, "اللحم": 1, "بأجمعنا": 1,
 "فهاته": 1, "ألمن": 1, "وكل": 1, "وحواليهن": 1, "وكم": 1,
 "فهاتي": 1, "وكي": 1, "لعنهن": 1, "ألمثلكم": 1, "فإنكم": 1,
 "فإنكن": 1, "ألمثلكن": 1, "لفوقي": 1, "وكإنهن": 1, "أبعينه": 1,
 "أكأنهما": 1, "أوبشبهها": 1, "ليمين": 1, "لفوقه": 1, "فلراح": 1,
 "كتلقاء": 1, "أولئك": 1, "أببعضكم": 1, "أببعضكن": 1, "أوبشبههن": 1,
 "أوبشبههم": 1, "أفوقهما": 1, "ولإلينا": 1, "ألما": 1, "بشبهي": 1,
 "ولقد": 1, "بشبهه": 1, "بشبهك": 1, "أفلنفس": 1, "أوكأنك": 1,
 "ألمع": 1, "وللاتي": 1, "فكأني": 1, "شبهك": 1, "أبجميع": 1,
 "فلتلقاءهما": 1, "فكأنك": 1, "فكأنه": 1, "نحوكما": 1, "فرجع": 1,
 "فلأمامي": 1, "فلأمامه": 1, "كعامتك": 1, "فلأمامك": 1, "كعامته": 1,
 "عداهما": 1, "أكغيري": 1, "أكغيره": 1, "أوبذين": 1, "أكغيرك": 1,
 "فشبههما": 1, "فأنتم": 1, "أفكتلكم": 1, "عينهم": 1, "عينهن": 1,
 "أولشبهكن": 1, "أولشبهكم": 1, "وحسبي": 1, "الوبحم": 1, "أكنفسي": 1,
 "فلتلقاءكم": 1, "أكنفسه": 1, "عينها": 1, "فلتلقاءكن": 1, "أكنفسك": 1,
 "أبضعكما": 1, "أفلإليكما": 1, "فدون": 1, "وسبحانكما": 1, "وأولالك": 1,
 "فلعامة": 1, "ولغيرهن": 1, "أفلكأنكم": 1, "أفلكأنكن": 1, "لبعضنا": 1,
 "بضعي": 1, "بضعه": 1, "ولكني": 1, "بضعك": 1, "فبحسبهما": 1,
 "أتحت": 1, "فلبعضكن": 1, "فلبعضكم": 1, "فلهذين": 1, "ألمعهم": 1,
 "لنحو": 1, "فلفوقهما": 1, "أببعض": 1, "أوكغيرهم": 1, "أوكغيرهن": 1,
 "فكعينكن": 1, "ألنحونا": 1, "فلحمنا": 1, "ولتلقاءهم": 1, "ولتلقاءهن": 1,
 "أفبهناك": 1, "أفبحسبنا": 1, "لتلقاء": 1, "وكأنك": 1, "فكشبههما": 1,
 "خلالكم": 1, "خلالكن": 1, "وكأني": 1, "كفونا": 1, "أيمينك": 1,
 "أجميعهن": 1, "أيمينه": 1, "ولتلقاءها": 1, "أيميني": 1, "أوكأن": 1,
 "فلشمالها": 1, "أولعنك": 1, "وبنفسنا": 1, "وبكلكن": 1, "وبكلكم": 1,
 "بأكثرهما": 1, "أفلطالما": 1, "بها": 1, "أولعنه": 1, "وهنا": 1,
 "فحاشاهما": 1, "وبأبهن": 1, "أوكغيرها": 1, "وفوقهما": 1, "ومعهما": 1,
 "فمنذ": 1, "أعنها": 1, "يمينكم": 1, "يمينكن": 1, "وفوقها": 1,
 "أكأجمعها": 1, "فليمينهن": 1, "ألذينك": 1, "التي": 1, "وخلاهن": 1,
 "وخلاهم": 1, "أوبذاك": 1, "أفبكن": 1, "وخلاها": 1, "ليمينها": 1,
 "فلتلقاءه": 1, "ألسويهما": 1, "فلتلقاءك": 1, "جير": 1, "فلتلقاءي": 1,
 "فبنفسنا": 1, "أوجميعكما": 1, "أوبضعكن": 1, "أوبضعكم": 1, "أعنهن": 1,
 "أعنهم": 1, "أوكحسبكم": 1, "فكأنهما": 1, "فمني": 1, "أوكحسبكن": 1,
 "فلهؤلاء": 1, "أكأجمعهن": 1, "هاته": 1, "أوبضعي": 1, "هاتي": 1,
 "ألأولاء": 1, "فمنه": 1, "ولأجمعكم": 1, "ككليهما": 1, "خلالهما": 1,
 "فكفو": 1, "ألتحتها": 1, "بمثلكن": 1, "بمثلكم": 1, "أفبسويه": 1,
 "فخلفهن": 1, "فخلفهم": 1, "أفبسويك": 1, "لأمامكما": 1, "أكهنالك": 1,
 "تبدل": 1, "أوسويكم": 1, "أوسويكن": 1, "حسبها": 1, "فبضعهن": 1,
 "فبضعهم": 1, "تحتنا": 1, "وبجميعكما": 1, "أفبكليكما": 1, "حسبهم": 1,
 "فبمثله": 1, "فبمثلك": 1, "فبضعها": 1, "ولأخ": 1, "أكنفسنا": 1,
 "وهاؤم": 1, "فبمثلي": 1, "أإنك": 1, "ببعضنا": 1, "أإنه": 1,
 "أإني": 1, "وهاتين": 1, "كعامتي": 1, "وكشبهنا": 1, "وهلا": 1,
 "أوبأجمعك": 1, "أفلبعض": 1, "ألعنها": 1, "ففوقه": 1, "وكعينكما": 1,
 "فخلفها": 1, "ففوقك": 1, "ومساء": 1, "وبعدكما": 1, "لانقلب": 1,
 "فببعضه": 1, "بأكثركن": 1, "كفو": 1, "فببعضك": 1, "أولعليكم": 1,
 "فببعضي": 1, "كأيهما": 1, "بإنكما": 1, "لحمهم": 1, "لإليك": 1,
 "ففيهما": 1, "فاللتين": 1, "فأمامهما": 1, "أفبعين": 1, "وبينهم": 1,
 "أفشبهكم": 1, "أفشبهكن": 1, "لأيكن": 1, "لأيكم": 1, "ولعلى": 1,
 "ولعلي": 1, "ى": 1, "ولعله": 1, "ولعلق": 1, "أكجميعي": 1,
 "وحاشاي": 1, "أولو": 1, "وحاشاه": 1, "وحاشاك": 1, "وكذلكم": 1,
 "وكذلكن": 1, "فعداي": 1, "ألإلينا": 1, "لأخي": 1, "لأخه": 1,
 "أفلإليكم": 1, "كأكثركما": 1, "أكإنكن": 1, "لأخك": 1, "لتجاههما": 1,
 "أفكليكما": 1, "لحمها": 1, "أفكمثلكما": 1, "أفسويك": 1, "وبضع": 1,
 "لهذا": 1, "أكنفسكم": 1, "اللأخ": 1, "فلتحتهن": 1, "اللأب": 1,
 "وكأجمعها": 1, "وسبحانها": 1, "ألشمالهما": 1, "ألعلكما": 1, "ولأمامكما": 1,
 "معاذهم": 1, "معاذهن": 1, "لابتدأ": 1, "اللتيا": 1, "أفثم": 1,
 "لفيكما": 1, "ألعينكما": 1, "وكأجمعهم": 1, "وكأجمعهن": 1, "أفبنفسكما": 1,
 "معاذها": 1, "اللتين": 1, "ولكيلا": 1, "فكعيننا": 1, "أومثلهما": 1,
 "فلأكثركم": 1, "فلأكثركن": 1, "أكإننا": 1, "فلديك": 1, "فلديه": 1,
 "لهذه": 1, "لهذي": 1, "ألهم": 1, "ألهن": 1, "فبتلكما": 1,
 "بأجمعي": 1, "فكأجمعكن": 1, "أشمالكما": 1, "فلإيانا": 1, "ألهو": 1,
 "ألهي": 1, "وككلها": 1, "أفلتحتكما": 1, "ولشمالنا": 1, "فكأجمعكم": 1,
 "فلفوهما": 1, "فكعين": 1, "أفكمثلهم": 1, "أفكمثلهن": 1, "وكتجاهكما": 1,
 "بأجمعك": 1, "أولبعضها": 1, "أفبهم": 1, "فكرب": 1, "أفكمثلها": 1,
 "وعما": 1, "فبعيننا": 1, "أولبعضهم": 1, "أولبعضهن": 1, "فلعليك": 1,
 "فلعليه": 1, "أبعضكن": 1, "أبعضكم": 1, "ألها": 1, "سوينا": 1,
 "ولمعنا": 1, "أككليكما": 1, "فعلينا": 1, "وككلهم": 1, "ولذلكن": 1,
 "ولذلكم": 1, "فأولئك": 1, "بجميعهما": 1, "لشبهكم": 1, "لشبهكن": 1,
 "أهاته": 1, "ومعاذها": 1, "أهاتي": 1, "فاللائي": 1, "أكنحونا": 1,
 "فحولكن": 1, "أوبذلك": 1, "كأخهم": 1, "كأخهن": 1, "فلجميعنا": 1,
 "وكالألى": 1, "ز": 1, "لسويكن": 1, "أفلنحوكم": 1, "أفلنحوكن": 1,
 "لسويكم": 1, "أأولاء": 1, "وإليهم": 1, "وإليهن": 1, "أفلفيكما": 1,
 "لنحوك": 1, "أببعضكما": 1, "كأخها": 1, "فكذلكما": 1, "فحمكما": 1,
 "وبحسبكن": 1, "أوتحت": 1, "أوبأجمعكما": 1, "فكفوهم": 1, "وليمينهن": 1,
 "أوذين": 1, "وإليها": 1, "فأنكن": 1, "ومعاذهم": 1, "ومعاذهن": 1,
 "وليمينهم": 1, "أفبأولئكم": 1, "فأنكم": 1, "أعامتكم": 1, "أعامتكن": 1,
 "وبإنكما": 1, "أفيميننا": 1, "فكحمك": 1, "أوكلهن": 1, "أوكلهم": 1,
 "فكحمه": 1, "أوكإنكما": 1, "فكحمي": 1, "ذلكما": 1, "أفإليكما": 1,
 "كالتي": 1, "فبسوي": 1, "فبسوى": 1, "أبعضهما": 1, "وكاللتيا": 1,
 "حينهن": 1, "أولحسب": 1, "لتبدل": 1, "ولأجمعي": 1, "فبتلقاء": 1,
 "لإننا": 1, "ولأجمعه": 1, "ولأجمعك": 1, "أولنحوكم": 1, "أفنفسكما": 1,
 "أولنحوكن": 1, "فلذات": 1, "أفلكأنه": 1, "أفلمثلك": 1, "أفلكما": 1,
 "أفلمثله": 1, "فبجميعكما": 1, "أفلأولئكم": 1, "أفلمثلي": 1, "أوبذلكما": 1,
 "وكحمهما": 1, "فلسويكن": 1, "فلسويكم": 1, "بعضكما": 1, "ألنفسكن": 1,
 "ألنفسكم": 1, "فلولا": 1, "فلذاك": 1, "أوكلها": 1, "فككلي": 1,
 "حينك": 1, "فبذلكما": 1, "أولهاتين": 1, "أفكغيرهما": 1, "فحذار": 1,
 "ألإننا": 1, "وكاللتين": 1, "فخلاكما": 1, "أولمنه": 1, "فليمينكم": 1,
 "أولمنك": 1, "كأينا": 1, "أولمني": 1, "أخلفهما": 1, "بضعكم": 1,
 "ففيهم": 1, "ففيهن": 1, "بعامته": 1, "بي": 1, "كأين": 1,
 "أفلذينك": 1, "فكأجمعها": 1, "به": 1, "اللتان": 1, "فبأولاء": 1,
 "بعامتك": 1, "بس": 1, "ففيها": 1, "لغيري": 1, "فكأجمعهن": 1,
 "لغيره": 1, "فكأجمعهم": 1, "لغيرك": 1, "ليتنا": 1, "أفكسويكما": 1,
 "حينه": 1, "ألتلكما": 1, "أجمعك": 1, "أجمعه": 1, "أجمعي": 1,
 "بعامتي": 1, "أففوقه": 1, "كإياها": 1, "قد": 1, "أففوقك": 1,
 "كأكثركن": 1, "كأكثركم": 1, "أوشبهكن": 1, "فعينها": 1, "أوشبهكم": 1,
 "فلهاتين": 1, "ولكنهما": 1, "فحواليه": 1, "فببعضكما": 1, "أوأمامهم": 1,
 "أوأمامهن": 1, "فكحمنا": 1, "ألمثل": 1, "لجميعنا": 1, "وأمامها": 1,
 "لتحتكن": 1, "بحسبكن": 1, "بحسبكم": 1, "أفلفوقهن": 1, "أفلفوقهم": 1,
 "ونحوك": 1, "أوفيي": 1, "ونحوه": 1, "ونحوي": 1, "أفلمننا": 1,
 "وأمامهن": 1, "وأمامهم": 1, "وبإياهما": 1, "أفلفوقها": 1, "أفكعامتهم": 1,
 "فلتحتكن": 1, "كإياهن": 1, "كإياهم": 1, "أوككلتا": 1, "فعينهم": 1,
 "أفلهناك": 1, "فعينهن": 1, "وبعضكن": 1, "أإلى": 1, "أإلي": 1,
 "وبعضكم": 1, "ولسوينا": 1, "أفلفيكن": 1, "فلمعنا": 1, "أولشمالكن": 1,
 "أوأمامها": 1, "ولفيهن": 1, "ولفيهم": 1, "أوبمثلكما": 1, "كأجمعنا": 1,
 "ولمنكن": 1, "ولمنكم": 1, "بتجاههن": 1, "بتجاههم": 1, "بأيها": 1,
 "وأمامكن": 1, "فكأنكما": 1, "فلتي": 1, "بأجمعها": 1, "ألإليكما": 1,
 "فلته": 1, "أفلكلكما": 1, "بأيهن": 1, "بأيهم": 1, "فتبدل": 1,
 "ولعنك": 1, "ألنحو": 1, "ألنحن": 1, "ولعني": 1, "أفلديه": 1,
 "وأمامهما": 1, "أفلديك": 1, "كإنكم": 1, "لتلقاءكما": 1, "أفغيرهما": 1,
 "ولفيها": 1, "ولتلكما": 1, "ولمثلهما": 1, "عليك": 1, "فكأبكما": 1,
 "وبأقله": 1, "أفلأمام": 1, "كأولئك": 1, "فلهما": 1, "بأنكن": 1,
 "أفبكلك": 1, "أفبكله": 1, "أفبكلي": 1, "تحتهما": 1, "فلعننا": 1,
 "فبأكثركما": 1, "فكنحو": 1, "تي": 1, "وبأكثرها": 1, "وكأولئكم": 1,
 "ته": 1, "وبفو": 1, "أمامهما": 1, "أوكسوينا": 1, "فعينكن": 1,
 "باللاتي": 1, "أهذان": 1, "وبأكثرهن": 1, "وبأكثرهم": 1, "أوبكلهما": 1,
 "وأجمعي": 1, "ألكأنكم": 1, "ألكأنكن": 1, "وأجمعك": 1, "وأجمعه": 1,
 "ألعليكن": 1, "ألعليكم": 1, "وبتجاهكم": 1, "أفذلكن": 1, "أفذلكم": 1,
 "فكفوكما": 1, "فكمن": 1, "وكنحوه": 1, "وكأولالك": 1, "أكسويكن": 1,
 "وكنحوك": 1, "وكنحوي": 1, "أفنفسنا": 1, "أولإنه": 1, "بمثلهن": 1,
 "بمثلهم": 1, "أولإنك": 1, "أبإنكما": 1, "أفكلها": 1, "أفكلهما": 1,
 "بشبهنا": 1, "أولإني": 1, "فمافتئ": 1, "لخلفها": 1, "فلإنكم": 1,
 "فلإنكن": 1, "بمثلها": 1, "أفأمامهما": 1, "ولتينك": 1, "أفكلهن": 1,
 "أفكلهم": 1, "أفكنحوهما": 1, "وبإياك": 1, "فوقكما": 1, "وبنفسهما": 1,
 "لخلفهن": 1, "بعين": 1, "أوعنكما": 1, "حسبكم": 1, "حسبكن": 1,
 "أسويكن": 1, "أسويكم": 1, "أوكنحوك": 1, "ففونا": 1, "فكما": 1,
 "فمثلكما": 1, "أولغيرنا": 1, "أوبهؤلاء": 1, "حسب": 1, "ألتحتكن": 1,
 "ألتحتكم": 1, "ويكأنهما": 1, "أفيمينهما": 1, "ويميننا": 1, "فكعيني": 1,
 "فبأخهن": 1, "فبأخهم": 1, "أفكأولئك": 1, "كمن": 1, "فأف": 1,
 "فأن": 1, "أوكمثلهما": 1, "فأي": 1, "وتلكما": 1, "لإلى": 1,
 "لإلي": 1, "الوحم": 1, "فلشمالهم": 1, "فلنفسكما": 1, "وعندها": 1,
 "ولأكثر": 1, "فلكنها": 1, "وإياه": 1, "أفبهاته": 1, "فبضعكن": 1,
 "فبضعكم": 1, "أفبهاتي": 1, "فأب": 1, "فأخ": 1, "فله": 1,
 "وخلالكما": 1, "أفكشبهنا": 1, "فلمنه": 1, "ألستن": 1, "ألستم": 1,
 "بأبكن": 1, "فلمنك": 1, "فلإليهما": 1, "فلمني": 1, "نعما": 1,
 "أفسوي": 1, "أفكبعضهما": 1, "أوبعامة": 1, "أفسوى": 1, "وكحسب": 1,
 "فبأخها": 1, "بأكثرها": 1, "أفبسويكم": 1, "أفبسويكن": 1, "كنفسها": 1,
 "فبذين": 1, "وعليهم": 1, "هلا": 1, "فكحسبكن": 1, "فكحسبكم": 1,
 "لشمالها": 1, "ألأجمعه": 1, "أكأجمع": 1, "ألأجمعك": 1, "أفشبهها": 1,
 "ألأجمعي": 1, "ولإليهما": 1, "فلحسبكن": 1, "فلحسبكم": 1, "غ": 1,
 "لشمالهن": 1, "جميعنا": 1, "لشمالهم": 1, "فلحرى": 1, "أفشبههم": 1,
 "أفبشبهكم": 1, "أوكأجمعنا": 1, "أكسوينا": 1, "كنفسهم": 1, "كنفسهن": 1,
 "فخلفهما": 1, "فلنحونا": 1, "فكالذين": 1, "هلم": 1, "لسويك": 1,
 "فكذلك": 1, "لسويه": 1, "لآض": 1, "أفليمينهما": 1, "أبنفسهما": 1,
 "ولأنهما": 1, "تان": 1, "ألخلفهن": 1, "بحمي": 1, "أثمة": 1,
 "وبها": 1, "بحمك": 1, "بحمه": 1, "فبتينك": 1, "أفعينهن": 1,
 "أفعينهم": 1, "فعداك": 1, "وعينكم": 1, "أفتلكم": 1, "وبأبكما": 1,
 "أذاك": 1, "وبهم": 1, "وبهن": 1, "وبهو": 1, "وبهي": 1,
 "ولشرع": 1, "أفعينها": 1, "وتجاهك": 1, "وتجاهه": 1, "أفبذلكما": 1,
 "وتجاهي": 1, "وعليها": 1, "وثم": 1, "كأكثري": 1, "فوكن": 1,
 "كأجمع": 1, "فوكم": 1, "كأكثرك": 1, "كأكثره": 1, "فبإنكم": 1,
 "بينكما": 1, "فبإنكن": 1, "فكإنه": 1, "ويمين": 1, "أفكعامتهما": 1,
 "فكإنك": 1, "أفلعامتنا": 1, "أفلعنكما": 1, "لنفسنا": 1, "وكليهما": 1,
 "فللذين": 1, "وباللتين": 1, "فتلقاءنا": 1, "أكبعضك": 1, "أكبعضه": 1,
 "أكبعضي": 1, "بتلقاءكما": 1, "فبأكثرهم": 1, "فبأكثرهن": 1, "فأوشك": 1,
 "كذاك": 1, "ولإنهن": 1, "آمين": 1, "أتلكم": 1, "فهناك": 1,
 "الوبأخ": 1, "بالذين": 1, "بإنك": 1, "الوبأب": 1, "أحسبكن": 1,
 "بإني": 1, "أكإنكم": 1, "أفكأجمعنا": 1, "ولعن": 1, "تحت": 1,
 "ولعل": 1, "ولإنها": 1, "كذات": 1, "أحسبكم": 1, "ولغدا": 1,
 "ولأمامهما": 1, "لفي": 1, "كأقلكم": 1, "بسوينا": 1, "فليتهم": 1,
 "فكعامتها": 1, "وباللتيا": 1, "ومعاذكم": 1, "ومعاذكن": 1, "فإياهن": 1,
 "لعنكما": 1, "لأمام": 1, "فبأكثرها": 1, "كتانك": 1, "وغيرهما": 1,
 "ألفوق": 1, "أوكلكن": 1, "أوكلكم": 1, "كعيني": 1, "كعينه": 1,
 "فلأمسى": 1, "كعينك": 1, "فأقلك": 1, "أفحسبك": 1, "أ": 1,
 "فأقله": 1, "أفحسبه": 1, "فلنحوكما": 1, "أفحسبي": 1, "فأقلي": 1,
 "كحمكن": 1, "وبحمهم": 1, "بأقلك": 1, "وبحمهن": 1, "بأقله": 1,
 "بأقلي": 1, "وكأب": 1, "وكأخ": 1, "حمه": 1, "بعدك": 1,
 "فللتي": 1, "حمك": 1, "بعده": 1, "أفلنحوهم": 1, "أفلنحوهن": 1,
 "أفليمينك": 1, "حمي": 1, "أفعامتكما": 1, "وبحمها": 1, "وكأن": 1,
 "وماانفك": 1, "وكأي": 1, "أفعليهن": 1, "ولعسى": 1, "أفمعنا": 1,
 "وحوالى": 1, "وحوالي": 1, "آض": 1, "سبحانه": 1, "سبحانك": 1,
 "لأمامه": 1, "بعامتنا": 1, "سبحاني": 1, "أعليه": 1, "أفليميني": 1,
 "أعليك": 1, "لنفسي": 1, "لنفسه": 1, "أليمينها": 1, "لنفسك": 1,
 "لأمامك": 1, "أكحسبهما": 1, "أوكغيركن": 1, "لأجمعنا": 1, "فكعامتهم": 1,
 "ككليكما": 1, "خ": 1, "فبعض": 1, "أوكأنهما": 1, "أعنه": 1,
 "أبحسب": 1, "بغيرهما": 1, "خلف": 1, "أعني": 1, "أومننا": 1,
 "ولتلقاءكم": 1, "ولتلقاءكن": 1, "فإياها": 1, "وكأقل": 1, "أفأمامنا": 1,
 "عامتكما": 1, "أولكم": 1, "تلقاء": 1, "خلا": 1, "وبإنكن": 1,
 "وبإنكم": 1, "فكجميع": 1, "فكتلقاءهما": 1, "ليته": 1, "أفشمالنا": 1,
 "ففيه": 1, "أفلنفسكن": 1, "أفلنفسكم": 1, "باللتيا": 1, "فلتجاهه": 1,
 "أوأولئكم": 1, "فلتجاهك": 1, "ولعامتكم": 1, "ومعاذي": 1, "فلتجاهي": 1,
 "ولعامتكن": 1, "فحولكما": 1, "وعندي": 1, "أكبعضها": 1, "أكأجمعكم": 1,
 "أكأجمعكن": 1, "فحينكما": 1, "فمنها": 1, "وبأكثر": 1, "أوكأننا": 1,
 "أفبتلكما": 1, "وعدا": 1, "فبعامتهما": 1, "فبمثلكن": 1, "فبمثلكم": 1,
 "وخلاكن": 1, "وخلاكم": 1, "أفلتحتهما": 1, "أولبعضهما": 1, "خلالهم": 1,
 "خلالهن": 1, "أجمعها": 1, "سويهما": 1, "أهما": 1, "لمعكما": 1,
 "فلفيه": 1, "وبمثلي": 1, "وبمثله": 1, "وبمثلك": 1, "فبحمنا": 1,
 "فمنهم": 1, "فمنهن": 1, "لسويكما": 1, "أفككليهما": 1, "أسويكما": 1,
 "لأنا": 1, "وبأقل": 1, "أولكلكم": 1, "أولكلكن": 1, "ألغيره": 1,
 "ولفيكن": 1, "فلخلفي": 1, "فبفوي": 1, "أقلهم": 1, "ككل": 1,
 "فبفوه": 1, "أقلهن": 1, "فبفوك": 1, "فهي": 1, "لإليكن": 1,
 "بتجاهكن": 1, "أكهناك": 1, "بتجاهكم": 1, "لإنك": 1, "ألعينهما": 1,
 "لإنه": 1, "أفلشمالنا": 1, "لإني": 1, "فسرعان": 1, "أولتحت": 1,
 "أوبشبهك": 1, "فهل": 1, "فكفوهما": 1, "أوبشبهه": 1, "معاذهما": 1,
 "فخلا": 1, "أوبشبهي": 1, "أفلفوقكن": 1, "أفلفوقكم": 1, "الوكأب": 1,
 "أفكذينك": 1, "الوكأخ": 1, "عندنا": 1, "فلاستحال": 1, "أوهنا": 1,
 "لأبي": 1, "وكلهما": 1, "غدا": 1, "لأبك": 1, "لأبه": 1,
 "فكمثل": 1, "أفبجميعهما": 1, "ولهذين": 1, "أقلها": 1, "أفكنفسنا": 1,
 "كشبهي": 1, "فبذلك": 1, "ألعليهن": 1, "فيكما": 1, "ألعليهم": 1,
 "كشبهك": 1, "كذلك": 1, "كشبهه": 1, "فكتلقاء": 1, "وله": 1,
 "ولن": 1, "فأقلهما": 1, "ولك": 1, "ولمنك": 1, "أوفوقه": 1,
 "ولي": 1, "ولو": 1, "بأكثر": 1, "ونعم": 1, "ولمنه": 1,
 "أولأنتم": 1, "ولأيهما": 1, "وأخنا": 1, "أولديكم": 1, "لدنها": 1,
 "وبمن": 1, "وماذا": 1, "فلكلتا": 1, "وبتجاهنا": 1, "أككليهما": 1,
 "هذان": 1, "وبما": 1, "لدنهن": 1, "لدنهم": 1, "باللائي": 1,
 "وكجميعنا": 1, "فلفوها": 1, "ألكأنهن": 1, "فينا": 1, "واللتان": 1,
 "لعليكما": 1, "ولجميعكما": 1, "لغيركما": 1, "فلشمالهما": 1, "أبذواتي": 1,
 "أفكنحوكم": 1, "ولديكم": 1, "ولديكن": 1, "أفكنحوكن": 1, "فأجمعهم": 1,
 "فأجمعهن": 1, "فلأكثرها": 1, "أكنفسهن": 1, "أكنفسهم": 1, "أولنفسكم": 1,
 "فبفوهما": 1, "أكثرهن": 1, "واللذان": 1, "فكحمهما": 1, "أفكشبه": 1,
 "فذان": 1, "معاذكم": 1, "معاذكن": 1, "فذاك": 1, "فكأنها": 1,
 "ولبعضكن": 1, "ولبعضكم": 1, "فأمامنا": 1, "فذات": 1, "أفمثلكن": 1,
 "أببعضهما": 1, "أفمثلكم": 1, "فكأنهم": 1, "فكأنهن": 1, "فبتلقاءي": 1,
 "أويميننا": 1, "فكتجاهكما": 1, "فبتلقاءك": 1, "وبمثلنا": 1, "فبتلقاءه": 1,
 "أفلديكما": 1, "فلدني": 1, "فأخكن": 1, "فلأكثرهم": 1, "فلأكثرهن": 1,
 "فأخكم": 1, "أكنفسها": 1, "فلدنك": 1, "فلستما": 1, "فبعضكما": 1,
 "ألكل": 1, "ألكم": 1, "وكهاتين": 1, "أفلبعضنا": 1, "تحتها": 1,
 "ولولا": 1, "أفبنفسكم": 1, "وسبحاننا": 1, "ضمنه": 1, "ضمنك": 1,
 "بجميع": 1, "كتين": 1, "أفذواتا": 1, "فيمينهن": 1, "صباح": 1,
 "فظل": 1, "أوكعامتهما": 1, "كأجمعهما": 1, "أفذواتي": 1, "وكمثلكن": 1,
 "وكمثلكم": 1, "أونحن": 1, "أونحو": 1, "فيمينها": 1, "لتلقاءي": 1,
 "أوكلي": 1, "أعلي": 1, "لتلقاءك": 1, "لتلقاءه": 1, "فلإياه": 1,
 "أومثلنا": 1, "فبأبي": 1, "أولبعضكم": 1, "أولبعضكن": 1, "أفمعك": 1,
 "أبعضهن": 1, "أبعضهم": 1, "أفإليهما": 1, "كسوى": 1, "وككلكم": 1,
 "وككلكن": 1, "أوشبهه": 1, "أوشبهك": 1, "أوليست": 1, "ألفيي": 1,
 "ألفيه": 1, "أوليسا": 1, "أوشبهي": 1, "ألفيك": 1, "عليها": 1,
 "وتجاهها": 1, "أفلإنكما": 1, "ببعضه": 1, "وليتها": 1, "أفلأنتن": 1,
 "أفلأنتم": 1, "يومئذ": 1, "بضعكن": 1, "فغيركما": 1, "وتحتهما": 1,
 "ولهؤلاء": 1, "وليتهن": 1, "وليتهم": 1, "وفوقكما": 1, "أفلخلفهما": 1,
 "فتجاهكن": 1, "فتجاهكم": 1, "أفلعليه": 1, "فهب": 1, "ألجميع": 1,
 "أوكذين": 1, "أوبمثلنا": 1, "عليهن": 1, "عليهم": 1, "وتجاههن": 1,
 "وتجاههم": 1, "ولاخلولق": 1, "وأينما": 1, "أولعامتهما": 1, "لأنهما": 1,
 "فبحم": 1, "فبأيهن": 1, "فبأيهم": 1, "لحسبكما": 1, "أعلى": 1,
 "ولغيره": 1, "فلفوقهم": 1, "ولغيرك": 1, "ولغيرها": 1, "ولغيري": 1,
 "تلقاءهما": 1, "أفغيرهن": 1, "أفغيرهم": 1, "فلسن": 1, "أولكله": 1,
 "ولحسبهن": 1, "ولحسبهم": 1, "أكشبههن": 1, "أكشبههم": 1, "أولكلي": 1,
 "فبإيانا": 1, "وأولئكم": 1, "أفغيرها": 1, "أوكإن": 1, "بمثل": 1,
 "ولحسبها": 1, "أكشبهها": 1, "فبتانك": 1, "فلست": 1, "ولأقلنا": 1,
 "أوكأني": 1, "أفلتينك": 1, "فبأيها": 1, "أوكأنه": 1, "ألهما": 1,
 "فلفوقها": 1, "لعمركم": 1, "لعمركن": 1, "وشمال": 1, "أككلهما": 1,
 "ولغيرهم": 1, "أفمنكما": 1, "فاللذان": 1, "فمعاذهم": 1, "فمعاذهن": 1,
 "أفيهما": 1, "وبأولئك": 1, "ألأجمعهما": 1, "أخه": 1, "أخك": 1,
 "فليمينهم": 1, "فبجميع": 1, "أخي": 1, "أولمثلها": 1, "وكهذا": 1,
 "ففيكم": 1, "ففيكن": 1, "ض": 1, "فبكن": 1, "أوبضع": 1,
 "كأبه": 1, "كأبك": 1, "أولمثلهن": 1, "ولنحونا": 1, "كأبي": 1,
 "أفأنتن": 1, "أفأنتم": 1, "أفسويه": 1, "فلفوي": 1, "وكهذه": 1,
 "هاك": 1, "وكهذي": 1, "فلفوك": 1, "فلفوق": 1, "فكنحوكما": 1,
 "أضحى": 1, "فلفوه": 1, "فمعاذها": 1, "أوكعامتكم": 1, "أخذ": 1,
 "أوكعامتكن": 1, "فإنكما": 1, "أفبمثلكم": 1, "أفبمثلكن": 1, "ولإني": 1,
 "ولإنك": 1, "فليمينها": 1, "ولإنه": 1, "أوكذاك": 1, "بذواتي": 1,
 "لإلينا": 1, "ولذواتي": 1, "ألذين": 1, "أفلذلكن": 1, "لحسبهما": 1,
 "أوأمامكن": 1, "أفلذلكم": 1, "أوشبههن": 1, "أوشبههم": 1, "أونفسكما": 1,
 "ولهنالك": 1, "وغيرها": 1, "أوبغيركما": 1, "فبأقلهما": 1, "أوكلهما": 1,
 "أفكعامتها": 1, "ولبعضه": 1, "ولبعضك": 1, "فلجعل": 1, "أبعينك": 1,
 "أفبجميعنا": 1, "ولبعضي": 1, "فمعه": 1, "فمعك": 1, "وغيرهن": 1,
 "ولدنهما": 1, "وغيرهم": 1, "أفكعامتهن": 1, "فمعي": 1, "أفغير": 1,
 "تحتهن": 1, "لإياهما": 1, "أأولئكم": 1, "وبعضك": 1, "وبعضه": 1,
 "وبعضي": 1, "إنكم": 1, "إنكن": 1, "كإياكن": 1, "تلك": 1,
 "فعنهم": 1, "فعينكم": 1, "أوشبهها": 1, "أولأولالك": 1, "أفلنفسها": 1,
 "غداة": 1, "فبحسبنا": 1, "وبإنها": 1, "أفهناك": 1, "أولسويك": 1,
 "نفسكما": 1, "أولسويه": 1, "أأنتما": 1, "لهنالك": 1, "فخلاكم": 1,
 "أفلكأنما": 1, "فخلاكن": 1, "فلأخهما": 1, "فأقل": 1, "فشبهكن": 1,
 "فشبهكم": 1, "أعين": 1, "فلبعضكما": 1, "أفلمني": 1, "حاشاكم": 1,
 "حاشاكن": 1, "أفلمنك": 1, "وتلكم": 1, "وخلفهما": 1, "أفلمنه": 1,
 "أوبأجمع": 1, "وكتلكما": 1, "لذلك": 1, "فليست": 1, "أفلنفسهن": 1,
 "أفلنفسهم": 1, "أفكأنكم": 1, "وبإنهن": 1, "وبإنهم": 1, "فليسا": 1,
 "ألشمالك": 1, "ففلان": 1, "فهما": 1, "لمنكن": 1, "فبعينهما": 1,
 "ويكأنكما": 1, "ألشماله": 1, "أوفلان": 1, "أينا": 1, "ألشمالي": 1,
 "أفلعامة": 1, "ونحونا": 1, "فماانفك": 1, "أفلدى": 1, "فغيرها": 1,
 "أفلدي": 1, "أوإلينا": 1, "فبمثلهن": 1, "فبمثلهم": 1, "ألديهما": 1,
 "أفمنهما": 1, "فلعل": 1, "فلعن": 1, "أإليكن": 1, "فغيرهم": 1,
 "فغيرهن": 1, "أولنفسكن": 1, "أغيرنا": 1, "فبمثلها": 1, "حسبهما": 1,
 "وتحتنا": 1, "كأبنا": 1, "ألإنهما": 1, "كأجمعكن": 1, "أفلمعي": 1,
 "لإنهن": 1, "وببعضهما": 1, "أفلمعك": 1, "كسوي": 1, "فمنكم": 1,
 "فمنكن": 1, "أفلمعه": 1, "وليميني": 1, "أفلقلما": 1, "أولديها": 1,
 "بحسب": 1, "وليمينه": 1, "أسويها": 1, "وليمينك": 1, "أعلينا": 1,
 "ومنكم": 1, "فلكأنهما": 1, "ومنكن": 1, "بتانك": 1, "إنما": 1,
 "وخلالهما": 1, "ألدينا": 1, "أفبأجمعهما": 1, "أوأمامكما": 1, "فلإنها": 1,
 "فكشبهكم": 1, "فكشبهكن": 1, "أنحوكما": 1, "ومكانك": 1, "أفبذواتي": 1,
 "كالألاء": 1, "أذينك": 1, "أفكهذه": 1, "فلإنهم": 1, "فلإنهن": 1,
 "أفلفيكم": 1, "ويمينكما": 1, "أفكلكن": 1, "أفكلكم": 1, "أفكحسبنا": 1,
 "لخلفكم": 1, "لخلفكن": 1, "فلسويكما": 1, "أكهاتي": 1, "أنفسنا": 1,
 "أكهاته": 1, "أسويهن": 1, "أسويهم": 1, "أبسويكما": 1, "فحاشاي": 1,
 "أوكعينكم": 1, "فحاشاه": 1, "فحاشاك": 1, "أفببعضك": 1, "أوليسوا": 1,
 "أوكسويه": 1, "أوكسويك": 1, "أكسويك": 1, "أكسويه": 1, "وبكما": 1,
 "أوكأجمعي": 1, "أوكأجمعه": 1, "ولنفسها": 1, "أوكأجمعك": 1, "وبغيرنا": 1,
 "وبأجمع": 1, "أوأجمعك": 1, "فلكنكن": 1, "فلكنكم": 1, "وحولهما": 1,
 "أفبإن": 1, "فأقلنا": 1, "أسويه": 1, "أسويك": 1, "أفلشمالهما": 1,
 "أوأجمعي": 1, "فشمالنا": 1, "فنعم": 1, "وجميعكما": 1, "انبرى": 1,
 "فنفسكما": 1, "ليستا": 1, "أوبنفسي": 1, "أوفوقي": 1, "فأخهن": 1,
 "أفمثلها": 1, "فأخهم": 1, "أوبنفسك": 1, "أوبعضها": 1, "أوبنفسه": 1,
 "فلما": 1, "ألتحت": 1, "أوأجمعه": 1, "أفلعامتها": 1, "وكعينكن": 1,
 "فكنفسكما": 1, "وكعينكم": 1, "أوأنا": 1, "ولديهن": 1, "فأجمعكم": 1,
 "فأجمعكن": 1, "أفكنحوهم": 1, "أفكنحوهن": 1, "ولكأننا": 1, "لجميعهما": 1,
 "أبغيرك": 1, "أبغيره": 1, "أبغيري": 1, "ولبعضها": 1, "أولأولئكم": 1,
 "وأقلهما": 1, "ولديها": 1, "أفكنحوها": 1, "وحي": 1, "وحم": 1,
 "ولبعضهن": 1, "أكغيركما": 1, "وبغيرهما": 1, "أوتحتكن": 1, "أفمثلهن": 1,
 "فأخها": 1, "أفمثلهم": 1, "فبنحوكن": 1, "فكأنكم": 1, "فكأنكن": 1,
 "فبنحوكم": 1, "فلأيكن": 1, "فلأيكم": 1, "أوتحتكم": 1, "أفلعامتهم": 1,
 "أفلعامتهن": 1, "أعامتهن": 1, "كأبهما": 1, "كأبها": 1, "ولعمركما": 1,
 "فخلف": 1, "أفوق": 1, "فضمنكما": 1, "أوبإنكما": 1, "أفبنفسكن": 1,
 "وكمثلها": 1, "ألعلي": 1, "ألعلى": 1, "ألعله": 1, "أفلفوقكما": 1,
 "ألعلك": 1, "أقلي": 1, "وبفونا": 1, "أكجميعكن": 1, "أقلك": 1,
 "فبفو": 1, "وكمثلهن": 1, "وكمثلهم": 1, "فككل": 1, "أبنفسهن": 1,
 "فيمينه": 1, "أوكبعضهن": 1, "فيمينك": 1, "أوأجمع": 1, "بأجمع": 1,
 "فيميني": 1, "فلمثلهما": 1, "أفكعامتكما": 1, "أفلخلفنا": 1, "أولعننا": 1,
 "أبكلي": 1, "وبضعكما": 1, "أبكلك": 1, "والتي": 1, "أبكله": 1,
 "فبأكثركم": 1, "فبأكثركن": 1, "لفوي": 1, "فكهي": 1, "ولعينكن": 1,
 "ولعينكم": 1, "ألفوقهن": 1, "ألفوقهم": 1, "وتجاهكما": 1, "ولإنكن": 1,
 "ولإنكم": 1, "أولكأنهما": 1, "أينما": 1, "لفوك": 1, "لفوق": 1,
 "ألفوقها": 1, "فحينهما": 1, "ولإن": 1, "أبشبهنا": 1, "أولديهم": 1,
 "لفوه": 1, "شمالهم": 1, "أكمثلك": 1, "أكمثله": 1, "فإليه": 1,
 "ذلكن": 1, "فكلنا": 1, "فإليك": 1, "أولغيرهما": 1, "أوبحسبك": 1,
 "أوبحسبه": 1, "فلمثلها": 1, "وكاد": 1, "أوبحسبي": 1, "فلأنهم": 1,
 "أولأولاء": 1, "أوبكليكما": 1, "فبعامتكما": 1, "ن": 1, "فلذين": 1,
 "أفلعلهم": 1, "وشمالكما": 1, "كحمهم": 1, "للذي": 1, "كحمهن": 1,
 "وبحمكم": 1, "وبحمكن": 1, "أفلعلهن": 1, "بكلهما": 1, "ولأبك": 1,
 "ألذلكما": 1, "غيرك": 1, "غيره": 1, "كحمها": 1, "غيري": 1,
 "أفبتلك": 1, "وهكذا": 1, "وكان": 1, "كمثلكن": 1, "فلمثلهن": 1,
 "فلمثلهم": 1, "كمثلكم": 1, "ولعنكما": 1, "ألنفسها": 1, "أوغير": 1,
 "وآض": 1, "أويمينكما": 1, "أفبمثلها": 1, "ولدنكما": 1, "خلفك": 1,
 "أكمثلهم": 1, "أكمثلهن": 1, "فمعاذكم": 1, "فمعاذكن": 1, "خلفي": 1,
 "فعامته": 1, "ونحوهم": 1, "فعندك": 1, "وجميعهما": 1, "وجميعنا": 1,
 "أكأجمعهما": 1, "أوكعامتها": 1, "فعامتي": 1, "أففيكن": 1, "فلأقلها": 1,
 "أفلمثلكن": 1, "أفلغيرهما": 1, "أمام": 1, "وسويهما": 1, "أولأمامك": 1,
 "لإياها": 1, "فمثلهما": 1, "وبتجاهكما": 1, "فلأقلهن": 1, "فلأقلهم": 1,
 "أكشبهكن": 1, "أكشبهكم": 1, "أأجمعكن": 1, "أبأجمعك": 1, "أأجمعكم": 1,
 "أبأجمعه": 1, "لإياهن": 1, "لإياهم": 1, "وهاهنا": 1, "وبيني": 1,
 "ومعكن": 1, "كاللواتي": 1, "أولمثلكن": 1, "ومعكم": 1, "ألأمامكم": 1,
 "ألأمامكن": 1, "أفبمثلهم": 1, "أفبمثلهن": 1, "ولأمامه": 1, "أولنفسي": 1,
 "أكمثلها": 1, "أعامة": 1, "وكلكما": 1, "لتجاه": 1, "أكذينك": 1,
 "أوكعامتهم": 1, "أوكعامتهن": 1, "فلسويهن": 1, "أفبحسبك": 1, "وحيثما": 1,
 "أفبحسبه": 1, "شتان": 1, "فيهما": 1, "لأكثرها": 1, "فكهم": 1,
 "إنها": 1, "فكهو": 1, "فسبحاننا": 1, "ألفيكن": 1, "أفنحوك": 1,
 "فكالذي": 1, "أفنحوه": 1, "ولدنكم": 1, "حرى": 1, "أفنحوي": 1,
 "أفبإنهما": 1, "أفكلما": 1, "أوككلهما": 1, "منكم": 1, "وكنحوكن": 1,
 "وكنحوكم": 1, "منكن": 1, "أفكعامتكن": 1, "أفكعامتكم": 1, "ولديهم": 1,
 "فأجمعكما": 1, "أولشمالي": 1, "وغيركن": 1, "وغيركم": 1, "أولشمالك": 1,
 "فلأمامكما": 1, "أولشماله": 1, "وبضعكم": 1, "أفأولئك": 1, "أولستن": 1,
 "أولستم": 1, "ولأيكما": 1, "لأكثرهم": 1, "لأكثرهن": 1, "أكعينكم": 1,
 "إنهم": 1, "إنهن": 1, "أكعينكن": 1, "مما": 1, "عنده": 1,
 "غيرهما": 1, "عندك": 1, "وبأني": 1, "كلك": 1, "وككلتا": 1,
 "باللذين": 1, "وبأنك": 1, "أولكلهم": 1, "أولكلهن": 1, "وبأنه": 1,
 "فلإليكم": 1, "فلإليكن": 1, "أكحسبه": 1, "أقلكم": 1, "أفكسوى": 1,
 "أفكسوي": 1, "أكحسبك": 1, "نفسها": 1, "كهم": 1, "أكحسبي": 1,
 "كهن": 1, "أفيهن": 1, "فكأجمعك": 1, "أفيهم": 1, "فكأجمعه": 1,
 "فكأجمعي": 1, "بيد": 1, "فلشمالي": 1, "وبمثل": 1, "لعننا": 1,
 "فكمثلهما": 1, "نفسهن": 1, "أكجميعكما": 1, "نفسهم": 1, "لسوي": 1,
 "لسوى": 1, "بين": 1, "وجميعهم": 1, "هنا": 1, "لسوف": 1,
 "فيمينكما": 1, "وبكليهما": 1, "خلفهما": 1, "أومعكم": 1, "أومعكن": 1,
 "بعامتها": 1, "ولأنشأ": 1, "فبأكثرك": 1, "ألعامتهم": 1, "أففوقنا": 1,
 "فبأكثره": 1, "فبأكثري": 1, "أوكجميعهما": 1, "فضمنها": 1, "لتحول": 1,
 "أولكلها": 1, "وكغيرنا": 1, "ولحمنا": 1, "ألنفسهما": 1, "أفبذينك": 1,
 "تلقاءي": 1, "تلقاءه": 1, "فلفوكن": 1, "فلفوكم": 1, "وحسبها": 1,
 "وسبحان": 1, "فنحوكما": 1, "فلحسب": 1, "أولسويكم": 1, "أوبضعك": 1,
 "وحسبهن": 1, "وحسبهم": 1, "أفعامتك": 1, "وبأولئكم": 1, "فأخكما": 1,
 "ألعليه": 1, "وبينهما": 1, "لدنكن": 1, "لدنكم": 1, "تجاه": 1,
 "فعندكما": 1, "لديكم": 1, "وبإياكما": 1, "وتانك": 1, "أبأولالك": 1,
 "أولغير": 1, "وكأننا": 1, "فكغيركما": 1, "فغداة": 1, "فمعاذك": 1,
 "وحواليكم": 1, "وحواليكن": 1, "ألفي": 1, "ر": 1, "أفكإني": 1,
 "فحمنا": 1, "ألمثلهم": 1, "ألمثلهن": 1, "وكنفسهما": 1, "فبذي": 1,
 "ولكنكما": 1, "بمثله": 1, "ولبعضهم": 1, "بمثلك": 1, "أببعضها": 1,
 "ألعني": 1, "فمعاذي": 1, "بمثلي": 1, "أوبشبهكن": 1, "أوبشبهكم": 1,
 "ألمثلها": 1, "أولتحتها": 1, "أببعضهم": 1, "أببعضهن": 1, "كلكما": 1,
 "بنفسنا": 1, "فأنكما": 1, "أفوقك": 1, "أوبسويكم": 1, "أوبسويكن": 1,
 "أفوقي": 1, "أفبعضهن": 1, "أفبعضهم": 1, "وشبه": 1, "ألعينهم": 1,
 "ألعينهن": 1, "أوبضعكما": 1, "وعنهما": 1, "فبجميعنا": 1, "وللذين": 1,
 "فعما": 1, "شبهنا": 1, "أولشبههن": 1, "أولشبههم": 1, "لأولاء": 1,
 "فأننا": 1, "وطالما": 1, "كليكما": 1, "أفهما": 1, "لأخهما": 1,
 "أولشبهها": 1, "أفببعضنا": 1, "ألحسبهما": 1, "أفبعضها": 1, "وكفوي": 1,
 "وكفوه": 1, "وكفوك": 1, "ألعينها": 1, "كتلقاءكما": 1, "وأيان": 1,
 "عليكم": 1, "وتجاهكن": 1, "فلعليهما": 1, "وتجاهكم": 1, "وبأجمعكما": 1,
 "فتجاهها": 1, "عنه": 1, "لإياك": 1, "فمثلهم": 1, "فمثلهن": 1,
 "بأولئك": 1, "أوليمين": 1, "الألى": 1, "بضعهن": 1, "بضعهم": 1,
 "عينكم": 1, "عينكن": 1, "أفلشمالكما": 1, "ولأمامكم": 1, "فلتلكما": 1,
 "ولفيكم": 1, "أشمالهم": 1, "وكإن": 1, "أوبه": 1, "وبمثلكما": 1,
 "ألتينك": 1, "ولكأنكما": 1, "فلذلكما": 1, "أشمالهن": 1, "فتجاههن": 1,
 "فتجاههم": 1, "أوبي": 1, "ولراح": 1, "كأخي": 1, "فعامة": 1,
 "وبذلكما": 1, "أفخلفك": 1, "وحاشانا": 1, "فمثلها": 1, "أولذلكما": 1,
 "فكهما": 1, "فبأيكن": 1, "فبأيكم": 1, "فكهذي": 1, "أوبحسبهما": 1,
 "أكلكما": 1, "فلعين": 1, "فكهذه": 1, "أفكحسبهما": 1, "أفوقها": 1,
 "فكأكثركن": 1, "فكأكثركم": 1, "فأيكما": 1, "أفبنفسها": 1, "أفلعليكما": 1,
 "أوكشبه": 1, "وحمي": 1, "أفكعامتي": 1, "فلهاتي": 1, "وحمك": 1,
 "فلهاته": 1, "وحمه": 1, "أفوقهم": 1, "أفوقهن": 1, "فكذينك": 1,
 "أفكلي": 1, "كأننا": 1, "وبسوي": 1, "فلحمهما": 1, "فأبنا": 1,
 "وأقلكم": 1, "أفحسبكما": 1, "فبكلهم": 1, "فبكلهن": 1, "أفبأجمعي": 1,
 "مثلهما": 1, "أفبأجمعه": 1, "أفبأجمعك": 1, "ولأجمعهما": 1, "أولهن": 1,
 "أولهم": 1, "أولهي": 1, "ولأبكما": 1, "فشمالهن": 1, "فشمالهم": 1,
 "كهاته": 1, "كهاتي": 1, "أكثرك": 1, "ولعينهن": 1, "ولعينهم": 1,
 "أبإنكن": 1, "أفكنحوه": 1, "أفكنحوك": 1, "أفلديكن": 1, "بضعهما": 1,
 "فلتحتهما": 1, "أفكنحوي": 1, "ولعينها": 1, "وبهناك": 1, "وكحسبهما": 1,
 "أولجميعكم": 1, "أولجميعكن": 1, "ولجميع": 1, "أفعليه": 1, "أكنحوكما": 1,
 "أفإنكما": 1, "فبكلها": 1, "بحسبه": 1, "بحسبي": 1, "فلشبهكن": 1,
 "أفلجميعك": 1, "أولها": 1, "أفلجميعه": 1, "أفلجميعي": 1, "فشمالها": 1,
 "فبنحوهما": 1, "حولهن": 1, "فعلي": 1, "أبنحونا": 1, "أوخلفهما": 1,
 "كمثلها": 1, "أكجميعكم": 1, "فحوالينا": 1, "وفيما": 1, "فكعينهن": 1,
 "وبأجمعهما": 1, "ولنفسنا": 1, "د": 1, "فلعامتهما": 1, "فكمثلكما": 1,
 "أخهما": 1, "أولفيكما": 1, "ضمننا": 1, "أقله": 1, "وببعضكما": 1,
 "أوبنفسنا": 1, "ألعليكما": 1, "أفبإننا": 1, "أذلك": 1, "أكغيرنا": 1,
 "أفأمامي": 1, "أفغيري": 1, "كمثلهن": 1, "فلمثلكن": 1, "فلمثلكم": 1,
 "كمثلهم": 1, "أفأمامك": 1, "أفغيرك": 1, "أفأمامه": 1, "فلعامتهم": 1,
 "أفغيره": 1, "أفلحسبه": 1, "أفلحسبك": 1, "أفلحسبي": 1, "أفمثلهما": 1,
 "أفلهؤلاء": 1, "كأكثرهما": 1, "لأبها": 1, "ففوكما": 1, "وكسويهما": 1,
 "أفعامتنا": 1, "فخلاهم": 1, "فخلاهن": 1, "أكشبهكما": 1, "فأنه": 1,
 "فشبههن": 1, "فشبههم": 1, "رويدك": 1, "فأنى": 1, "أفلتحت": 1,
 "فخلاها": 1, "كإياك": 1, "لغير": 1, "فأنا": 1, "فشبهها": 1,
 "أولإنها": 1, "فأنت": 1, "لديكما": 1, "أفبأجمعكما": 1, "وبسويكن": 1,
 "وبسويكم": 1, "وبكلكما": 1, "وكاللاتي": 1, "فكالألى": 1, "أفلخلفكما": 1,
 "فكمثلي": 1, "لأبهم": 1, "فكمثله": 1, "لأبهن": 1, "فكمثلك": 1,
 "أكبعض": 1, "ولفونا": 1, "وبإيانا": 1, "ولتلقاء": 1, "أبعضكما": 1,
 "أولنفسها": 1, "أكأجمعكما": 1, "والذين": 1, "فكغيرك": 1, "أفلهو": 1,
 "فكغيره": 1, "أفلهم": 1, "أفلهن": 1, "فكغيري": 1, "فحسبكم": 1,
 "فحسبكن": 1, "حاشاها": 1, "فقام": 1, "أطالما": 1, "أفلخلفهم": 1,
 "أولخلفهما": 1, "أفنفسهما": 1, "أبكلنا": 1, "حاشاهم": 1, "حاشاهن": 1,
 "وبتلقاءنا": 1, "وكعامتكن": 1, "فليتهما": 1, "وكأيك": 1, "وكأيه": 1,
 "وكأين": 1, "وكأيي": 1, "فغيركم": 1, "فغيركن": 1, "لأنكن": 1,
 "لأنكم": 1, "أولنفسهن": 1, "أولنفسهم": 1, "فبجميعهما": 1, "أفلكأنهما": 1,
 "أنتم": 1, "فلعينها": 1, "أفأنتما": 1, "فحوالي": 1, "فهذان": 1,
 "أفلها": 1, "حمكما": 1, "وكحمكما": 1, "فليستا": 1, "ونفسها": 1,
 "وهذه": 1, "حوالي": 1, "ألعامتكم": 1, "وهذي": 1, "ألعامتكن": 1,
 "حوالى": 1, "وكنفسها": 1, "أومعها": 1, "وحبذا": 1, "وكنحوها": 1,
 "فبأنكم": 1, "فلإليهم": 1, "فلإليهن": 1, "وبتين": 1, "أفليستا": 1,
 "فإن": 1, "فإي": 1, "أفيكن": 1, "أكأننا": 1, "أفيكم": 1,
 "فإذ": 1, "وكنحوهن": 1, "أفحسبنا": 1, "وكنحوهم": 1, "فلإليها": 1,
 "فكشبهه": 1, "فكشبهك": 1, "أفشمال": 1, "نفسكم": 1, "فكشبهي": 1,
 "ونفسهم": 1, "فحمي": 1, "وهذا": 1, "فشمالكن": 1, "فحمك": 1,
 "وكنفسهم": 1, "أبأولئكم": 1, "فحمه": 1, "وكنفسهن": 1, "أومعهم": 1,
 "أومعهن": 1, "فكإياكما": 1, "لمنهما": 1, "ولعينكما": 1, "أفكأجمعكما": 1,
 "أوكجميعي": 1, "فلدنهما": 1, "فحولك": 1, "أوكجميعه": 1, "فكذين": 1,
 "أوجميعهن": 1, "أوجميعهم": 1, "باللواتي": 1, "لظل": 1, "هذين": 1,
 "فلشبهه": 1, "أولذواتي": 1, "فلشبهك": 1, "فلشبهي": 1, "بنفسك": 1,
 "وأجمعكما": 1, "فلعينهم": 1, "بنفسه": 1, "بنفسي": 1, "أبحسبنا": 1,
 "فلبعضك": 1, "فلبعضه": 1, "وحسبكم": 1, "أوكذواتي": 1, "فلبعضي": 1,
 "أفكذانك": 1, "إنكما": 1, "أوسوى": 1, "أنفسكما": 1, "أوسوي": 1,
 "وكأبكما": 1, "ذيت": 1, "كهناك": 1, "أوجميعها": 1, "ولعامتنا": 1,
 "أفلشمالكم": 1, "قلما": 1, "أفبهؤلاء": 1, "ألذاك": 1, "أفلعامتكم": 1,
 "أحسبنا": 1, "أفلعامتكن": 1, "لتلقاءهما": 1, "فبنحوها": 1, "ولذينك": 1,
 "فلأيها": 1, "أبسويها": 1, "وكعينهن": 1, "وحيننا": 1, "فبشبه": 1,
 "أيان": 1, "حاشاهما": 1, "وكذين": 1, "شمالها": 1, "وحمهما": 1,
 "أوبعامتهن": 1, "أوبعامتهم": 1, "أبسويهم": 1, "أبسويهن": 1, "وكعينها": 1,
 "فبأكثرهما": 1, "أوبعامتها": 1, "وإياهن": 1, "أبغيركما": 1, "وبهما": 1,
 "وفوقكن": 1, "وكأولئك": 1, "فلتبدل": 1, "فبنحوهن": 1, "فوقكم": 1,
 "فبنحوهم": 1, "فلأيهن": 1, "فلأيهم": 1, "فبحمه": 1, "فبحمك": 1,
 "فلأبهم": 1, "أكأولالك": 1, "فبحمي": 1, "وخلفي": 1, "فكأجمعهما": 1,
 "أنحونا": 1, "وخلفك": 1, "أكعامتكن": 1, "أكعامتكم": 1, "أنفسهن": 1,
 "أفلكأني": 1, "فلعسى": 1, "أفلأنتما": 1, "وبأيكم": 1, "وبأيكن": 1,
 "فبما": 1, "أكجميعها": 1, "ذين": 1, "فبمن": 1, "وغيري": 1,
 "أفلذين": 1, "أيكما": 1, "أكجميعهم": 1, "وغيرك": 1, "أكجميعهن": 1,
 "وغيره": 1, "فببعضها": 1, "فلشبههما": 1, "أوإنهما": 1, "فلأبها": 1,
 "أكمثلي": 1, "وعليك": 1, "وعليه": 1, "أوبذينك": 1, "وكلنا": 1,
 "ولأمامها": 1, "أفيميني": 1, "لمننا": 1, "مافتئ": 1, "فمثلكم": 1,
 "فمثلكن": 1, "ألغيركم": 1, "ألغيركن": 1, "أولجميع": 1, "أعيني": 1,
 "أعينه": 1, "أعينك": 1, "وكأخكن": 1, "وكأخكم": 1, "أفلذواتي": 1,
 "فلعينه": 1, "كشبهكما": 1, "فلعيني": 1, "فلتحتك": 1, "فلتحته": 1,
 "أفلأجمعكن": 1, "أفلأجمعكم": 1, "ولفيكما": 1, "فبتلقاءهما": 1, "فلأوشك": 1,
 "ولأجمع": 1, "ولأمامهم": 1, "ولأمامهن": 1, "هاهنا": 1, "أوبعضنا": 1,
 "أوبشبه": 1, "ألمنهن": 1, "وعينهن": 1, "أولالك": 1, "وكشبه": 1,
 "أفلسوينا": 1, "لأنتم": 1, "لأنتن": 1, "لهاتين": 1, "ألمنهم": 1,
 "أبعامتهما": 1, "وجعل": 1, "أوبعيننا": 1, "فكعامتكم": 1, "فكعامتكن": 1,
 "غيركما": 1, "فلكنهما": 1, "لبعض": 1, "فألا": 1, "بإنكم": 1,
 "وأقلنا": 1, "بإنكن": 1, "فنفسكن": 1, "أفكعينكما": 1, "فنفسكم": 1,
 "أفوقكم": 1, "أففيك": 1, "فخلالنا": 1, "وتينك": 1, "وعينها": 1,
 "أوكنفسي": 1, "أولدينا": 1, "أوكنفسك": 1, "الوفو": 1, "أوكنفسه": 1,
 "ومعها": 1, "فأبدا": 1, "أوبعامتهما": 1, "أفلمن": 1, "وليستا": 1,
 "أكمثلكم": 1, "أكمثلكن": 1, "وكتلك": 1, "أولإلينا": 1, "أفشبهي": 1,
 "أفشبهه": 1, "ألشبهكما": 1, "أفشبهك": 1, "أففيهم": 1, "أولنحوهما": 1,
 "ألأمامها": 1, "أأجمعها": 1, "أشبههم": 1, "أأمامنا": 1, "أشبههن": 1,
 "أوشمالكم": 1, "أوشمالكن": 1, "فبتلقاءنا": 1, "ق": 1, "أولطالما": 1,
 "فكأكثرهن": 1, "فكأكثرهم": 1, "فلأقلكن": 1, "أففيها": 1, "فلأقلكم": 1,
 "ألأمامهم": 1, "ألأمامهن": 1, "أأجمعهن": 1, "أفشمالي": 1, "أليس": 1,
 "أأجمعهم": 1, "أفشماله": 1, "أشبهها": 1, "أفشمالك": 1, "لإياكن": 1,
 "لإياكم": 1, "بذلكما": 1, "وجميعي": 1, "ومعهن": 1, "ومعهم": 1,
 "وجميعك": 1, "أوكأولئك": 1, "أفلمع": 1, "أفلما": 1, "أكهن": 1,
 "أكعينهم": 1, "ولعامتي": 1, "وكجميعك": 1, "وكجميعه": 1, "وكجميعي": 1,
 "ولعامتك": 1, "أجميعكما": 1, "ولعامته": 1, "وبعامتكم": 1, "وبعامتكن": 1,
 "أوهذان": 1, "وكنحوهما": 1, "وكلا": 1, "فكإنكن": 1, "وبأخها": 1,
 "ألفيهن": 1, "ألفيهم": 1, "وحمها": 1, "وعامتهما": 1, "أفبعامتكن": 1,
 "ألفيها": 1, "لمنهن": 1, "ولكأني": 1, "للذين": 1, "وحمهن": 1,
 "وكغيرهن": 1, "وحمهم": 1, "ولكأنه": 1, "أكعينها": 1, "لعامتنا": 1,
 "فبعامتكن": 1, "فلسويك": 1, "وكغيرهم": 1, "فلسويه": 1, "وكلي": 1,
 "خلفنا": 1, "وكلك": 1, "فحواليك": 1, "وكله": 1, "لأكثركم": 1,
 "لأكثركن": 1, "ولدنها": 1, "أكذلك": 1, "أكعينه": 1, "أولإنهما": 1,
 "وكنفسكما": 1, "أكعينك": 1, "كنحوي": 1, "أفبسويهم": 1, "كنحوه": 1,
 "أكعيني": 1, "كنحوك": 1, "أوبنفس": 1, "أوبحسبها": 1, "فكالألاء": 1,
 "أفبشبهها": 1, "سبحاننا": 1, "فمثلي": 1, "ولعمرهما": 1, "فليتنا": 1,
 "فمثلك": 1, "كعين": 1, "فمثله": 1, "الوكحم": 1, "أفبشبههن": 1,
 "أفبشبههم": 1, "ولفيي": 1, "ولدنهم": 1, "ولدنهن": 1, "أوبتلكما": 1,
 "كنفسكم": 1, "كنفسكن": 1, "أليست": 1, "بمثلكما": 1, "أفكغير": 1,
 "عامتهن": 1, "أكعينهما": 1, "أفبسويها": 1, "أغيركما": 1, "مازال": 1,
 "فككلتا": 1, "وكمثله": 1, "وأول": 1, "وكمثلك": 1, "فأينا": 1,
 "وكمثلي": 1, "وعلينا": 1, "فوها": 1, "وللواتي": 1, "فهؤلاء": 1,
 "فبحسبك": 1, "فلحسبها": 1, "وبهاته": 1, "فبحسبه": 1, "وبهاتي": 1,
 "ث": 1, "فبحسبي": 1, "أولسويهم": 1, "أولسويهن": 1, "وكذلك": 1,
 "فسبحانهما": 1, "أفعينكن": 1, "أفعينكم": 1, "وإنما": 1, "فلحسبهن": 1,
 "فلحسبهم": 1, "وعداه": 1, "أولسويها": 1, "وعداك": 1, "وككلك": 1,
 "أفلبعضه": 1, "وككله": 1, "فبأجمعنا": 1, "أفلبعضك": 1, "أفبإنكما": 1,
 "أكبعضنا": 1, "أونحوكن": 1, "أفلبعضي": 1, "وبأيه": 1, "أكعامتك": 1,
 "فوهن": 1, "فوهم": 1, "فمنهما": 1, "أوبسويهم": 1, "فكأين": 1,
 "أوبسويهن": 1, "أفيك": 1, "فبالتي": 1, "أفيه": 1, "أفيي": 1,
 "أفلأمامكما": 1, "فبعينه": 1, "فبعينك": 1, "وبعينهما": 1, "فتلكما": 1,
 "فبعيني": 1, "ومعي": 1, "فبكل": 1, "فبكم": 1, "ومعه": 1,
 "ومعك": 1, "أفإن": 1, "وكأجمع": 1, "كعامتكما": 1, "ولخلفك": 1,
 "أفعليهم": 1, "فحاشا": 1, "وألا": 1, "أوبسويها": 1, "وليس": 1,
 "وليت": 1, "فسبحانك": 1, "أفلمثلنا": 1, "أوفوقنا": 1, "أفلشمال": 1,
 "أقلكما": 1, "بعضهم": 1, "بعضهن": 1, "أفبعضكن": 1, "أفبعضكم": 1,
 "أولمن": 1, "بأبكما": 1, "وأجمع": 1, "وفوكن": 1, "أفلحسبهما": 1,
 "فتحتها": 1, "فقد": 1, "ولات": 1, "وخلفكما": 1, "أفعنكما": 1,
 "أولتحتكن": 1, "وكالذي": 1, "أوكإننا": 1, "وليمينكن": 1, "وليمينكم": 1,
 "مساء": 1, "فلتحت": 1, "أكحسبكم": 1, "أكحسبكن": 1, "بعضها": 1,
 "أولمع": 1, "أفلبعضكما": 1, "أولما": 1, "أوكعيننا": 1, "وبأخي": 1,
 "وكذا": 1, "وإذ": 1, "خلفه": 1, "لتلقاءهم": 1, "لتلقاءهن": 1,
 "وبحسبهما": 1, "ألإلي": 1, "ألإلى": 1, "أوبحسب": 1, "أوبعامتكن": 1,
 "بهاتين": 1, "أوبعامتكم": 1, "أولخلفي": 1, "أولخلفه": 1, "فلعنكما": 1,
 "أفسويهما": 1, "ألكأنكما": 1, "فأخذ": 1, "أبسويكم": 1, "أبسويكن": 1,
 "وبئس": 1, "وعننا": 1, "وكتجاهك": 1, "وكذه": 1, "ويومئذ": 1,
 "أفلإننا": 1, "وكذي": 1, "مذ": 1, "وإن": 1, "لتلقاءها": 1,
 "فعامتك": 1, "ولدنه": 1, "أولخلفك": 1, "أولتلك": 1, "فلأبكم": 1,
 "فلأبكن": 1, "وبأكثركن": 1, "ونفسك": 1, "ونفسه": 1, "فكبعضها": 1,
 "ونفسي": 1, "كتجاههم": 1, "كتجاههن": 1, "أكهذا": 1, "أكعامتهن": 1,
 "أفلأمامكم": 1, "أفلأمامكن": 1, "أنحوي": 1, "وبأيهم": 1, "وبأيهن": 1,
 "أجميعنا": 1, "أنحوك": 1, "من": 1, "فكبعضهن": 1, "فكبعضهم": 1,
 "كتجاهها": 1, "أخلفنا": 1, "أكهذه": 1, "أكعامتها": 1, "أفتحتهما": 1,
 "وبأيها": 1, "وبحسبنا": 1, "وكأنهن": 1, "وكأنهم": 1, "أفببعضكما": 1,
 "الولفو": 1, "لكلي": 1, "لكننا": 1, "لكله": 1, "لكلك": 1,
 "ولكلكن": 1, "بنحوها": 1, "ولكلكم": 1, "أولجميعها": 1, "فبكلكم": 1,
 "فبكلكن": 1, "أوعليها": 1, "فكتجاههما": 1, "الكأب": 1, "وبتلقاءهما": 1,
 "والآن": 1, "أعنهما": 1, "أولكن": 1, "أبمثلكما": 1, "أولكل": 1,
 "أوخلفهم": 1, "بعدها": 1, "فلا": 1, "كأخهما": 1, "بعدهم": 1,
 "بعدهن": 1, "ي": 1, "فلن": 1, "كغيركن": 1, "كغيركم": 1,
 "فلم": 1, "فلك": 1, "ألعامتهما": 1, "فلي": 1, "فلو": 1,
 "بنحوهن": 1, "بنحوهم": 1, "أولجميعهم": 1, "ولحم": 1, "أولجميعهن": 1,
 "أوعليهن": 1, "وباللائي": 1, "أوعليهم": 1, "لعينه": 1, "أفلإليها": 1,
 "فبعضهما": 1, "فلنحوي": 1, "أبأجمعي": 1, "فلنحوك": 1, "فبأخكما": 1,
 "فلنحوه": 1, "فلصار": 1, "لكأنما": 1, "عنها": 1, "كأجمعكما": 1,
 "طفق": 1, "وشمالها": 1, "أولمنهما": 1, "فلأمام": 1, "لتجاهكن": 1,
 "بات": 1, "لتجاهكم": 1, "أفلديهم": 1, "عنهم": 1, "لكأنك": 1,
 "أفلديهن": 1, "لكأنه": 1, "لكأني": 1, "بتلكما": 1, "ألعامة": 1,
 "فإزاء": 1, "فتحتهن": 1, "أفلإنهما": 1, "فكليهما": 1, "أفلفي": 1,
 "أولمثلكم": 1, "أوبعينك": 1, "وبينه": 1, "فغيرهما": 1, "أولستما": 1,
 "وكجميع": 1, "لاخلولق": 1, "أوشمالهم": 1, "أوشمالهن": 1, "وبينك": 1,
 "فلات": 1, "ألمنها": 1, "ليت": 1, "ضمنهما": 1, "فحسبه": 1,
 "ولدني": 1, "لمنكما": 1, "كتجاهكم": 1, "أوشمالها": 1, "فلان": 1,
 "فلشمالهن": 1, "فبينهما": 1, "أكثركما": 1, "أفلي": 1, "فلنفسه": 1,
 "فلأنتما": 1, "ألكلهما": 1, "أفإنه": 1, "وكحسبك": 1, "أفإنك": 1,
 "وكحسبه": 1, "فلنفسك": 1, "بتجاههما": 1, "ولتجاهكم": 1, "ولتجاهكن": 1,
 "أولأجمعنا": 1, "كتلقاءي": 1, "كتلقاءه": 1, "كتلقاءك": 1, "أفلشبههن": 1,
 "أفلشبههم": 1, "أفبعيننا": 1, "وبعامتهم": 1, "وبعامتهن": 1, "فكجميعهن": 1,
 "فكجميعهم": 1, "فلنفسي": 1, "فكاللذين": 1, "س": 1, "فكإنهن": 1,
 "فكإنهم": 1, "اللفو": 1, "فصباح": 1, "أشبهكم": 1, "أشبهكن": 1,
 "وعندكن": 1, "أوكشبهنا": 1, "وبعامتها": 1, "فكجميعها": 1, "حيننا": 1,
 "ألعامتك": 1, "وكذات": 1, "ألعامته": 1, "وبشبهنا": 1, "أوأجمعها": 1,
 "ألعامتي": 1, "كهؤلاء": 1, "أوفيكما": 1, "وحمكن": 1, "وحمكم": 1,
 "وتحول": 1, "أفكغيرنا": 1, "أفكأنهما": 1, "فبسويه": 1, "أولمثل": 1,
 "فبسويك": 1, "فبتجاهنا": 1, "فكبعضكن": 1, "فكبعضكم": 1, "أفبحسبي": 1,
 "لذات": 1, "فإنهما": 1, "أبأولاء": 1, "وكأيكما": 1, "ولغيركما": 1,
 "فكنحوهما": 1, "ولكننا": 1, "لجعل": 1, "أكشبههما": 1, "أفكأنما": 1,
 "وإليكما": 1, "وكأقلنا": 1, "ونفسكم": 1, "فلأنشأ": 1, "ونفسكن": 1,
 "فبأقلكن": 1, "فبأقلكم": 1, "وكنفسكم": 1, "وكنفسكن": 1, "أوكذينك": 1,
 "لذاك": 1, "وضمنه": 1, "وخلالنا": 1, "وضمنك": 1, "فكهن": 1,
 "وضمني": 1, "ويكأننا": 1, "أخها": 1, "فلأولئك": 1, "ولأولالك": 1,
 "ممن": 1, "أوجميعكن": 1, "وعندك": 1, "فمادام": 1, "أوجميعكم": 1,
 "فلتلك": 1, "لانبرى": 1, "أولعامتكن": 1, "أولعامتكم": 1, "إياك": 1,
 "أفبنحوكن": 1, "أجميع": 1, "وكفوكن": 1, "وكفوكم": 1, "بهناك": 1,
 "أفلخلفها": 1, "وكأجمعكم": 1, "ألإليهما": 1, "وشبهنا": 1, "ألفيكم": 1,
 "أفليمينكن": 1, "فلكنما": 1, "فإياهما": 1, "لمثلنا": 1, "وأبهن": 1,
 "وشمالهن": 1, "اخلولق": 1, "ألبعضي": 1, "أخهن": 1, "أخهم": 1,
 "فكسويكن": 1, "فكسويكم": 1, "ألبعضك": 1, "ألبعضه": 1, "لأمامكن": 1,
 "حيثما": 1, "لأمامكم": 1, "أفكأجمعكن": 1, "لإليهما": 1, "أبذلكما": 1,
 "وبعامتهما": 1, "فلمثل": 1, "فكتلقاءكم": 1, "فكتلقاءكن": 1, "كأكثر": 1,
 "لعيننا": 1, "أولعلكن": 1, "أولعلكم": 1, "فالألى": 1, "فبها": 1,
 "هاتان": 1, "فبسوينا": 1, "فلعامتنا": 1, "فبمثلهما": 1, "لديهما": 1,
 "فبهن": 1, "أولشمالهما": 1, "فبهم": 1, "فبهي": 1, "أفلذلك": 1,
 "فبهو": 1, "وبشبهه": 1, "لفينا": 1, "وبشبهك": 1, "أكهما": 1,
 "بأقلكما": 1, "وبشبهي": 1, "فبأجمعي": 1, "بتلقاء": 1, "فبأجمعه": 1,
 "بحم": 1, "فبأجمعك": 1, "أفلخلفهن": 1, "وليمينها": 1, "ولأب": 1,
 "ألكأنهما": 1, "وقلما": 1, "أكحسبها": 1, "أولفي": 1, "بعضكم": 1,
 "بعضكن": 1, "أفعامتكم": 1, "أفعامتكن": 1, "فحبذا": 1, "أوبشبهكما": 1,
 "فللتيا": 1, "أولكلتا": 1, "وفوهن": 1, "وفوهم": 1, "أفلنحوهما": 1,
 "أوخلفها": 1, "لذينك": 1, "ألجميعهم": 1, "بعينهما": 1, "كتلك": 1,
 "حمهن": 1, "حمهم": 1, "فللتين": 1, "وفوها": 1, "فلستن": 1,
 "بأجمعه": 1, "فكغيرنا": 1, "أوببعضكم": 1, "أوببعضكن": 1, "ألفيهما": 1,
 "أكأنكما": 1, "أفلنا": 1, "أفليمين": 1, "ولأن": 1, "ولأي": 1,
 "أكحسبهم": 1, "أكحسبهن": 1, "وعينك": 1, "أفبعضكما": 1, "وعينه": 1,
 "الألاء": 1, "وعيني": 1, "كبعضكن": 1, "كبعضكم": 1, "أفلأجمعها": 1,
 "فأيان": 1, "للاتي": 1, "بجميعهم": 1, "بجميعهن": 1, "بتجاهك": 1,
 "وكأخها": 1, "وبأقلي": 1, "فكهاته": 1, "فكهاتي": 1, "وبأقلك": 1,
 "ألغيرهم": 1, "ألغيرهن": 1, "بتجاهه": 1, "فبغيركن": 1, "فبغيركم": 1,
 "وكأخهن": 1, "وكأخهم": 1, "فلهي": 1, "فلدينا": 1, "وكذلكما": 1,
 "فنحوكم": 1, "فنحوكن": 1, "ألغيرها": 1, "فجميعي": 1, "أفلأجمعهن": 1,
 "أفلأجمعهم": 1, "فجميعك": 1, "كحسبنا": 1, "فجميعه": 1, "أفلعلنا": 1,
 "وكحم": 1, "أوذي": 1, "بأبكم": 1, "بجميعها": 1, "أفكتلكما": 1,
 "أفبهما": 1, "فنفسها": 1, "نحوهما": 1, "أبنفسنا": 1, "أجمعهم": 1,
 "أجمعهن": 1, "أفثمة": 1, "لخلفهما": 1, "ألخلفهم": 1, "وعينكن": 1,
 "لإنهما": 1, "ولفوكما": 1, "كذي": 1, "فشبهكما": 1, "أبعامتنا": 1,
 "أفعليها": 1, "كذه": 1, "فأول": 1, "فأوه": 1, "فإياهم": 1,
 "بإنها": 1, "أفلفيها": 1, "فبعد": 1, "عندي": 1, "فلذلك": 1,
 "بأخها": 1, "كعامة": 1, "كذا": 1, "أتحته": 1, "أتحتك": 1,
 "وأبدا": 1, "فأخي": 1, "أولتلكم": 1, "بإنهم": 1, "أتحتي": 1,
 "بإنهن": 1, "فلخلفهما": 1, "ففيك": 1, "فنفسهن": 1, "ففيم": 1,
 "فنفسهم": 1, "ففيي": 1, "ولتلقاءهما": 1, "ألخلفها": 1, "أوكغير": 1,
 "أومثلكما": 1, "ألشبهنا": 1, "فأخك": 1, "عنهن": 1, "فأمسى": 1,
 "وراءك": 1, "ومنهم": 1, "ومنهن": 1, "كبعضي": 1, "كبعضه": 1,
 "أوذلكما": 1, "أفبنحوكما": 1, "كبعضك": 1, "أفتحته": 1, "أفتحتك": 1,
 "واللذين": 1, "كبعضهما": 1, "ألأنتن": 1, "أفتحتي": 1, "ألأنتم": 1,
 "تارة": 1, "أوكنحونا": 1, "فلإياهم": 1, "فلعمرنا": 1, "أوبهاتين": 1,
 "ضمنكم": 1, "فلفيهما": 1, "ولأجمعكما": 1, "أفهاتي": 1, "فحاشاكما": 1,
 "أفأنا": 1, "أفهاته": 1, "بذين": 1, "فعينكما": 1, "ليتهما": 1,
 "ومنها": 1, "فلكلكما": 1, "فلأخي": 1, "ألعامتها": 1, "ليتكن": 1,
 "أفلشمالك": 1, "لسنا": 1, "ولبعض": 1, "بعامة": 1, "فبعدنا": 1,
 "أفلعامتهما": 1, "فكشبهها": 1, "فكأولئكم": 1, "وهناك": 1, "لكلكم": 1,
 "أنفسهما": 1, "أبمثل": 1, "لكلكن": 1, "وكأكثرهم": 1, "وكأكثرهن": 1,
 "فضمنهن": 1, "لإنها": 1, "فضمنهم": 1, "أفكأنكن": 1, "أفعنها": 1,
 "بجميعكما": 1, "ومعكما": 1, "فثم": 1, "فكشبههم": 1, "فضمنكم": 1,
 "فكشبههن": 1, "كهو": 1, "وكأكثرها": 1, "لإنهم": 1, "أولعنكما": 1,
 "أفلسويك": 1, "وكأبنا": 1, "أفلسويه": 1, "أفعنهن": 1, "أفعنهم": 1,
 "فعدا": 1, "وكتجاهنا": 1, "أقلكن": 1, "فوقنا": 1, "لعلهما": 1,
 "وبكلتا": 1, "بإياكن": 1, "بإياكم": 1, "وكشبهك": 1, "ومكانكم": 1,
 "ومكانكن": 1, "وليتكما": 1, "فليمينهما": 1, "فلأنها": 1, "فإياي": 1,
 "أوكبعضهم": 1, "فلتين": 1, "فلشماله": 1, "فإياك": 1, "فإياه": 1,
 "وإنكم": 1, "وإنكن": 1, "أفلمثلكما": 1, "فبيننا": 1, "فلشمالك": 1,
 "فلأنهن": 1, "أفبحسبهما": 1, "ألذانك": 1, "أوكبعضها": 1, "ألمنهما": 1,
 "ولمعكما": 1, "فكلما": 1, "وكلاهما": 1, "فبنفسهما": 1, "وعليهما": 1,
 "فكحسبكما": 1, "أبجميعنا": 1, "أفبكليهما": 1, "ولدنكن": 1, "أوبأجمعنا": 1,
 "أبحسبكما": 1, "أذانك": 1, "أشمالها": 1, "أبأجمعكما": 1, "ألحسب": 1,
 "غيرنا": 1, "أفبنفسهن": 1, "أفبنفسهم": 1, "وأب": 1, "وأخ": 1,
 "ولعلكم": 1, "ولعلكن": 1, "وعامتنا": 1, "فلهناك": 1, "ألإنه": 1,
 "أولسويكن": 1, "ألإنك": 1, "أنتما": 1, "ألإني": 1, "أفلهاته": 1,
 "لوما": 1, "وبعدهما": 1, "أفلهاتي": 1, "يمينك": 1, "يمينه": 1,
 "يميني": 1, "أوعامتهما": 1, "أوشماله": 1, "أوشمالك": 1, "ألمني": 1,
 "أوشمالي": 1, "أولفوقكن": 1, "كأقلهما": 1, "بماذا": 1, "معاذك": 1,
 "وحيني": 1, "أفلعليكن": 1, "أفيها": 1, "أفكليهما": 1, "وحينه": 1,
 "وحينك": 1, "وأف": 1, "وأن": 1, "وأي": 1, "وإليه": 1,
 "وإليك": 1, "حم": 1, "كلها": 1, "حي": 1, "أمعهم": 1,
 "فلشبهكم": 1, "حسبي": 1, "أمعهن": 1, "ولبات": 1, "حسبك": 1,
 "فبأقلها": 1, "بنا": 1, "حسبه": 1, "أوككلنا": 1, "ؤ": 1,
 "بكلنا": 1, "ألذي": 1, "فلارتد": 1, "أولحسبكما": 1, "وبشبهكما": 1,
 "وحرى": 1, "لكليهما": 1, "ولنحوهما": 1, "أفبأولاء": 1, "ولهاته": 1,
 "خلاكما": 1, "وككليهما": 1, "ولهاتي": 1, "ولإليها": 1, "كلهم": 1,
 "كلهن": 1, "أونفسي": 1, "أونفسه": 1, "أونفسك": 1, "ألنفس": 1,
 "أمعها": 1, "فاللذين": 1, "وكشبهه": 1, "وكشبهي": 1, "فبأقلهن": 1,
 "فبأقلهم": 1, "أخكن": 1, "ألحسبكما": 1, "أخكم": 1, "فكسويهن": 1,
 "فكسويهم": 1, "بأخنا": 1, "فكفونا": 1, "فلنا": 1, "أنهن": 1,
 "فجميعها": 1, "أنهم": 1, "ولصار": 1, "وكفوها": 1, "لذه": 1,
 "ألجميعنا": 1, "لذي": 1, "فحي": 1, "ولانبرى": 1, "أومعكما": 1,
 "ألعامتهن": 1, "فحم": 1, "وكفوهن": 1, "وكفوهم": 1, "لذا": 1,
 "ولفوقكن": 1, "كعيننا": 1, "فكسويها": 1, "أكهي": 1, "أكهو": 1,
 "أوله": 1, "أكهم": 1, "أنكما": 1, "وأخي": 1, "هيت": 1,
 "لشبهكما": 1, "هيا": 1, "لمثلهما": 1, "أنها": 1, "فجميعهن": 1,
 "فلأمامكن": 1, "فلأمامكم": 1, "فكذات": 1, "أبذي": 1, "فكنفس": 1,
 "لتلقاءكم": 1, "أفعليكم": 1, "لتلقاءكن": 1, "ولفيك": 1, "ولفيه": 1,
 "منكما": 1, "وبتي": 1, "وأضحى": 1, "فعليكما": 1, "أولعامتها": 1,
 "وبته": 1, "فبعامتها": 1, "ولرجع": 1, "أفلعليهما": 1, "ودونك": 1,
 "أولعامتهن": 1, "أولعامتهم": 1, "وخلفه": 1, "فبعامتهن": 1, "فبعامتهم": 1,
 "فكذاك": 1, "فلأجمعكما": 1, "يمينهما": 1, "لديه": 1, "لديك": 1,
 "ففوقكن": 1, "ففوقكم": 1, "أولعامتنا": 1, "وأمس": 1, "فكنفسهم": 1,
 "فكنفسهن": 1, "أفلنفسهما": 1, "ألطالما": 1, "بأن": 1, "ظل": 1,
 "بأي": 1, "فغدا": 1, "وبعامة": 1, "أفلمنهما": 1, "لكليكما": 1,
 "فكأبنا": 1, "تلقاءك": 1, "أفلك": 1, "أفجميعها": 1, "أفلم": 1,
 "أفلن": 1, "أفله": 1, "أفلو": 1, "فبالذي": 1, "كتجاهكن": 1,
 "فذلكم": 1, "فذلكن": 1, "أمامك": 1, "فلطالما": 1, "أمامه": 1,
 "أولعلهن": 1, "أمامي": 1, "وإنه": 1, "وإنك": 1, "أفجميعهن": 1,
 "أفجميعهم": 1, "أفلا": 1, "وإني": 1, "فكنفسها": 1, "وحولنا": 1,
 "أبإننا": 1, "فتحتكن": 1, "فتحتكم": 1, "ألفيكما": 1, "بأب": 1,
 "وأما": 1, "بأخ": 1, "بنفسكما": 1, "أوشك": 1, "أفنفسك": 1,
 "بأبهم": 1, "فنحوها": 1, "بأبهن": 1, "أفنفسي": 1, "ألبعضها": 1,
 "فوقهما": 1, "كبعضهن": 1, "كبعضهم": 1, "أوغيرك": 1, "أوغيره": 1,
 "أوغيري": 1, "للائي": 1, "بجميعكم": 1, "بجميعكن": 1, "ألخلفك": 1,
 "لكأنها": 1, "وعنكن": 1, "فكغيرهما": 1, "أوكجميعكما": 1, "فبغيرها": 1,
 "أبعامة": 1, "فبأجمعكما": 1, "أكنفسكن": 1, "لكأنهن": 1, "لكأنهم": 1,
 "فوكما": 1, "كلهما": 1, "وككلكما": 1, "فليتكم": 1, "فبغيرهن": 1,
 "أولمنهن": 1, "فبغيرهم": 1, "أفكإننا": 1, "فلعينكما": 1, "فببعضنا": 1,
 "فنحوهم": 1, "بأبها": 1, "فنحوهن": 1, "ألبعضهم": 1, "ألبعضهن": 1,
 "كبعضها": 1, "بأكثركما": 1, "أوبأولاء": 1, "فماذا": 1, "أفلشبه": 1,
 "أوكأولاء": 1, "بإياها": 1, "لخلفهم": 1, "وببعض": 1, "حواليهما": 1,
 "ثم": 1, "وأينا": 1, "ولأولئك": 1, "أفلنفسنا": 1, "فبينكما": 1,
 "أفلسنا": 1, "فعداها": 1, "أجمعكم": 1, "أجمعكن": 1, "ألخلفكن": 1,
 "ولأخكم": 1, "ولأخكن": 1, "ألخلفكم": 1, "أفعليكما": 1, "فجميع": 1,
 "فعداهن": 1, "فعداهم": 1, "فلخلفكم": 1, "فلخلفكن": 1, "فبين": 1,
 "سويكما": 1, "ولجميعي": 1, "للتي": 1, "أولذلك": 1, "ولجميعه": 1,
 "أفعليكن": 1, "ألسويكما": 1, "ولجميعك": 1, "لئن": 1, "أشبهكما": 1,
 "أوجميع": 1, "ولفوقي": 1, "استحال": 1, "لعلهن": 1, "فكاللائي": 1,
 "ولغيرهما": 1, "ولعلنا": 1, "فلأخ": 1, "فلأب": 1, "ولتجاهها": 1,
 "ولكأنهما": 1, "الفكحم": 1, "أوخلفكن": 1, "فلدننا": 1, "فبعين": 1,
 "أوبسويهما": 1, "أفمنكن": 1, "إنهما": 1, "أفمنكم": 1, "إزاء": 1,
 "لنا": 1, "فبهنالك": 1, "وكجميعها": 1, "أوبكما": 1, "فإياكم": 1,
 "فذلكما": 1, "وبجميعهما": 1, "فلمنكما": 1, "وشمالنا": 1, "وإليهما": 1,
 "فلأن": 1, "ومثلنا": 1, "أكنفسهما": 1, "فلأي": 1, "أفأمام": 1,
 "أكلتا": 1, "أوببعضكما": 1, "ولتجاههم": 1, "لكلهما": 1, "ولتجاههن": 1,
 "فعداكما": 1, "أوعليك": 1, "أوعليه": 1, "أمن": 1, "وكأجمعكن": 1,
 "وبحمكما": 1, "أكأجمعك": 1, "فلكأننا": 1, "فبأبكما": 1, "فلفيكم": 1,
 "فكجميعكن": 1, "فكجميعكم": 1, "فلفيكن": 1, "ولأقلها": 1, "فأيهما": 1,
 "أفكجميعهم": 1, "أفكجميعهن": 1, "أفلشبهكن": 1, "أفلشبهكم": 1, "وبذانك": 1,
 "كعامتهن": 1, "وكيفما": 1, "وفوي": 1, "وفوه": 1, "أمثل": 1,
 "وفوك": 1, "وفوق": 1, "تلقاءكن": 1, "تلقاءكم": 1, "وعندهن": 1,
 "وعندهم": 1, "ألتلكم": 1, "أما": 1, "فمازال": 1, "أمد": 1,
 "ككلكم": 1, "اللواتي": 1, "أمس": 1, "كنحونا": 1, "أمع": 1,
 "أولمعه": 1, "أفلأولالك": 1, "فأنتما": 1, "أولإليه": 1, "لأخكما": 1,
 "وليته": 1, "وليتك": 1, "أوتحتهن": 1, "غير": 1, "وليتي": 1,
 "أفكأنها": 1, "أوكبعضكم": 1, "أوكبعضكن": 1, "فاللواتي": 1, "وإنهم": 1,
 "أولست": 1, "وإنهن": 1, "لعلها": 1, "أكنحو": 1, "وبنحوي": 1,
 "أفكأنهن": 1, "أفكأنهم": 1, "وبنحوك": 1, "فلأنكن": 1, "وبنحوه": 1,
 "أولعينكم": 1, "بعيننا": 1, "وإنها": 1, "فلأقل": 1, "إليكن": 1,
 "إليكم": 1, "فبإنهما": 1, "أفبنفسهما": 1, "أوتحتها": 1, "فلإنهما": 1,
 "بتلكم": 1, "فكتلكم": 1, "أفنحن": 1, "أفنحو": 1, "وبشبههما": 1,
 "أويمينه": 1, "أفبكلها": 1, "بكلي": 1, "أفتحتكما": 1, "بكلك": 1,
 "بكله": 1, "أويمينك": 1, "أكتينك": 1, "نحوها": 1, "أفبذلكن": 1,
 "أفمنها": 1, "أفبذلكم": 1, "أولنحوي": 1, "ط": 1, "أولنحوك": 1,
 "أولنحوه": 1, "أولنفس": 1, "وأمسى": 1, "أبنفسي": 1, "نحوهم": 1,
 "أبنفسه": 1, "نحوهن": 1, "كغير": 1, "أوبحسبهم": 1, "أوبحسبهن": 1,
 "إياكم": 1, "إياكن": 1, "ألكلي": 1, "وأقل": 1, "ألكله": 1,
 "أويميني": 1, "أفبمثل": 1, "ولأجمعنا": 1, "كأقلنا": 1, "أومعك": 1,
 "كعامتنا": 1, "أومعي": 1, "أشمالكم": 1, "أفبكلهن": 1, "أفبكلهم": 1,
 "أشمالكن": 1, "وفوقنا": 1, "ولكنهن": 1, "أبمثلهما": 1, "فسويهم": 1,
 "لكنه": 1, "فسويهن": 1, "أومعهما": 1, "لكنك": 1, "آها": 1,
 "فكتينك": 1, "لأمامهن": 1, "لكني": 1, "فكتلقاءهم": 1, "فكتلقاءهن": 1,
 "وبأبك": 1, "أفكإنه": 1, "وبأبي": 1, "ألسويكم": 1, "ألسويكن": 1,
 "كجميعي": 1, "ولكان": 1, "كجميعك": 1, "أولمننا": 1, "ولسويك": 1,
 "كجميعه": 1, "بأكثره": 1, "واللواتي": 1, "بأكثرك": 1, "ذواتي": 1,
 "بأكثري": 1, "أولتحتهن": 1, "فساء": 1, "أبمثلنا": 1, "ولسويه": 1,
 "ولكاد": 1, "أولعلها": 1, "ذواتا": 1, "فسويها": 1, "أفليميننا": 1,
 "أيميننا": 1, "ولأننا": 1, "لأمامها": 1, "فغيرك": 1, "أيمينها": 1,
 "فكتلقاءها": 1, "فغيره": 1, "فغيري": 1, "أبذين": 1, "ولسنا": 1,
 "فبطآن": 1, "ولحمي": 1, "ولعمرها": 1, "فلأخنا": 1, "ولحمه": 1,
 "أوببعضها": 1, "هذا": 1, "ولحمك": 1, "فلمننا": 1, "أفعامتهم": 1,
 "أفعامتهن": 1, "ألعنك": 1, "أفكهاتين": 1, "أفلعنكم": 1, "يمينكما": 1,
 "أبنفسكما": 1, "وبأقلكن": 1, "فحسبي": 1, "أمثلكن": 1, "أمثلكم": 1,
 "حمكن": 1, "حمكم": 1, "فحسبك": 1, "فكحسبي": 1, "أفمنه": 1,
 "فيي": 1, "فبشبهك": 1, "أفمنك": 1, "أولعليكن": 1, "فكحسبك": 1,
 "فيك": 1, "أوكمثلكم": 1, "فكحسبه": 1, "أوكمثلكن": 1, "أولعامتك": 1,
 "فليتك": 1, "ولعمرهم": 1, "أولعامته": 1, "هذي": 1, "ولعمرهن": 1,
 "أوببعضهم": 1, "فليتي": 1, "أوببعضهن": 1, "وتلقاءي": 1, "وسويه": 1,
 "أفلغيره": 1, "وسويك": 1, "أفلغيرك": 1, "فكأقلنا": 1, "ولدى": 1,
 "فبشبهي": 1, "أفلغيري": 1, "ولدي": 1, "لمعنا": 1, "لأبكم": 1,
 "فليتكما": 1, "أمهما": 1, "لأبكن": 1, "أولأمامكما": 1, "وبأولالك": 1,
 "كأقلكما": 1, "وحواليهم": 1, "ألشمالها": 1, "أفذلكما": 1, "بحسبهما": 1,
 "ألعلكم": 1, "ألعلكن": 1, "ألست": 1, "فأيي": 1, "لأقلهما": 1,
 "وتحتي": 1, "وكتلقاء": 1, "فأيك": 1, "فأين": 1, "فأيه": 1,
 "لحسبنا": 1, "أفإليكم": 1, "أوإننا": 1, "كحسبي": 1, "أفنفسها": 1,
 "كحسبك": 1, "كحسبه": 1, "ففوي": 1, "ففوه": 1, "ففوق": 1,
 "ففوك": 1, "كليهما": 1, "ومنه": 1, "ومنك": 1, "وبسويهن": 1,
 "وبسويهم": 1, "وجير": 1, "وكاللائي": 1, "ومني": 1, "ألشمالهن": 1,
 "أكإنك": 1, "أكإنه": 1, "فبحسب": 1, "أكإني": 1, "ولإياهم": 1,
 "فحمهما": 1, "فلكلنا": 1, "ونفسكما": 1, "أفلكل": 1, "أفلكم": 1,
 "أفلكن": 1, "فحسبهم": 1, "فحسبهن": 1, "أفخلفكم": 1, "أغيركم": 1,
 "أفخلفكن": 1, "أيمينهن": 1, "وكتين": 1, "لعليهما": 1, "أفلإليك": 1,
 "أفوقه": 1, "وتحت": 1, "أفلحسبنا": 1, "وبأولاء": 1, "وكتجاهه": 1,
 "وكتجاهي": 1, "فحسبها": 1, "فكأقلكما": 1, "أفبذي": 1, "لخلفنا": 1,
 "أفكجميعها": 1, "أفلنحوكما": 1, "أولأمامكن": 1, "أولأمامكم": 1, "أوكبعضك": 1,
 "ولإياها": 1, "ولفوقك": 1, "لأنهن": 1, "لأنهم": 1, "ولفوقه": 1,
 "أفإلى": 1, "أفإلي": 1, "كأنهما": 1, "أوكبعضه": 1, "وللتي": 1,
 "لفوقك": 1, "فكتلقاءكما": 1, "وكيف": 1, "بحمها": 1, "سويه": 1,
 "سويك": 1, "أعينكن": 1, "أعينكم": 1, "فلسنا": 1, "وفيه": 1,
 "وفيم": 1, "وفيك": 1, "وفيي": 1, "حاشاه": 1, "حاشاك": 1,
 "وعليكما": 1, "حاشاي": 1, "لشمالي": 1, "أفلكلكن": 1, "أفلكلكم": 1,
 "ففوكم": 1, "لشمالك": 1, "فمثل": 1, "أغير": 1, "لشماله": 1,
 "أكأنكم": 1, "فبينه": 1, "بحمهن": 1, "أكل": 1, "فبيني": 1,
 "بحمهم": 1, "وكيت": 1, "أفحسبهما": 1, "بإياهن": 1, "بإياهم": 1,
 "أكمثل": 1, "فبذواتي": 1, "كشبههم": 1, "كشبههن": 1, "هنالك": 1,
 "حوله": 1, "وكأكثركم": 1, "وكأكثركن": 1, "بأكثركم": 1, "أولمعكما": 1,
 "أونحوهما": 1, "ولخلفهما": 1, "فبإياكن": 1, "لكلهم": 1, "لكلهن": 1,
 "وبتلك": 1, "أوكأولالك": 1, "كاللتين": 1, "أفبضعكم": 1, "أفبضعكن": 1,
 "وآنفا": 1, "أفبغيرنا": 1, "لمعهما": 1, "كتلقاءكم": 1, "لكلها": 1,
 "لإنكم": 1, "كاللتيا": 1, "لإنكن": 1, "ولعنهما": 1, "أفلجميعكن": 1,
 "لسويهما": 1, "أففيكم": 1, "بله": 1, "أفلعليكم": 1, "كشبهها": 1,
 "بلى": 1, "لقد": 1, "وكسويكن": 1, "ذوا": 1, "وكسويكم": 1,
 "أولحسبهما": 1, "أفليسوا": 1, "وأجمعهما": 1, "لدي": 1, "لدى": 1,
 "أوفيها": 1, "أفلمثل": 1, "لدن": 1, "أفبضع": 1, "أفمنهن": 1,
 "كإنكما": 1, "فبتلقاءكما": 1, "وكعامة": 1, "فسوى": 1, "لأولالك": 1,
 "أوفيهن": 1, "أوفيهم": 1, "ولكنه": 1, "فسوف": 1, "ولكنك": 1,
 "أوكمثلكما": 1, "أأمامهما": 1, "البأب": 1, "البأخ": 1, "أيمينكما": 1,
 "فلدي": 1, "فلدى": 1, "وحواليها": 1, "فلدن": 1, "أوحسبنا": 1,
 "فاللتان": 1, "أبذينك": 1, "أفكنحوكما": 1, "أوبجميعنا": 1, "اللذين": 1,
 "قبل": 1, "تجاهي": 1, "وبنحوهن": 1, "تجاهك": 1, "وذا": 1,
 "تجاهه": 1, "أفكجميعكم": 1, "أفكجميعكن": 1, "فلفيهم": 1, "فلفيهن": 1,
 "ولخلفي": 1, "وحواليهما": 1, "هكذا": 1, "وللألى": 1, "فعامتكم": 1,
 "ولخلفه": 1, "فلأكثرهما": 1, "أجميعي": 1, "أوشمالهما": 1, "أجميعك": 1,
 "أجميعه": 1, "أومني": 1, "أوكسويكم": 1, "أوكسويكن": 1, "أومنك": 1,
 "تلقاءهن": 1, "أومنه": 1, "تلقاءهم": 1, "واستحال": 1, "هب": 1,
 "وذي": 1, "وذو": 1, "أكنحوهما": 1, "وبنحوها": 1, "وذه": 1,
 "وكأكثرهما": 1, "كنفسكما": 1, "ألعينكم": 1, "وكبعضكن": 1, "وكبعضكم": 1,
 "كتلكم": 1, "ألعينكن": 1, "أفبمثلهما": 1, "وطفق": 1, "أمعكم": 1,
 "فلشبههم": 1, "فلشبههن": 1, "أمعكن": 1, "كخ": 1, "ألنفسه": 1,
 "سويكم": 1, "سويكن": 1, "فبإياكما": 1, "فباللاتي": 1, "وبأنهما": 1,
 "ولحمهما": 1, "ألتحتكما": 1, "كم": 1, "كل": 1, "وكإيانا": 1,
 "وهذان": 1, "وكتجاه": 1, "أولتحتك": 1, "كلكم": 1, "كلكن": 1,
 "أليمينكما": 1, "وكأقلهما": 1, "كتلكما": 1, "فلدنكما": 1, "فلشبهها": 1,
 "أفلفوق": 1, "فجميعكم": 1, "فجميعكن": 1, "ولذا": 1, "ومثلكما": 1,
 "أفكهو": 1, "أنكن": 1, "فآمين": 1, "وضمن": 1, "بتلقاءكم": 1,
 "أفذين": 1, "بتلقاءكن": 1, "وببعضها": 1, "فكاللواتي": 1, "أفكشبهكما": 1,
 "أعامتنا": 1, "أوكسويهما": 1, "أوسويكما": 1, "فلأنكم": 1, "وأولاء": 1,
 "فكمثلنا": 1, "وكلتا": 1, "ولذي": 1, "أولعل": 1, "أولعن": 1,
 "فلقد": 1, "ولذه": 1, "ألأجمع": 1, "ولإنكما": 1, "شبههما": 1,
 "فلجميعكم": 1, "فلجميعكن": 1, "أككل": 1, "أبتلكم": 1, "خلاها": 1,
 "عليكن": 1, "وبسوينا": 1, "فسويكم": 1, "فسويكن": 1, "أفلتحتها": 1,
 "بإن": 1, "أفككل": 1, "أولإنكما": 1, "أوبغيركم": 1, "أوكتلكم": 1,
 "أوبغيركن": 1, "ب": 1, "كحم": 1, "أولفينا": 1, "ألسويهم": 1,
 "ألسويهن": 1, "ولكأن": 1, "وذات": 1, "وإلا": 1, "فبذانك": 1,
 "ألسويها": 1, "وحسبكما": 1, "فلنحوهما": 1, "وإلى": 1, "وإلي": 1,
 "فحيننا": 1, "خلاهم": 1, "خلاهن": 1, "أكذانك": 1, "أبهناك": 1,
 "أفلتحتهن": 1, "لإياي": 1, "لغيرنا": 1, "كسويكن": 1, "كسويكم": 1,
 "وأكثر": 1, "شمال": 1, "فآض": 1, "فأصلا": 1, "أوقلما": 1,
 "أفشمالكم": 1, "أفشمالكن": 1, "فأكثرهم": 1, "فأكثرهن": 1, "أكليهما": 1,
 "أفلعنهن": 1, "أفلعنهم": 1, "أوبذلكم": 1, "أوكمثلها": 1, "أوبذلكن": 1,
 "أمثلها": 1, "فلعمر": 1, "كسويهما": 1, "وضمننا": 1, "فتلكم": 1,
 "فلتلكم": 1, "فأكثرها": 1, "أفلعنها": 1, "أوكمثلهم": 1, "أفلفوقك": 1,
 "أوكمثلهن": 1, "أمثلهن": 1, "أفلفوقه": 1, "أمثلهم": 1, "فلحسبكما": 1,
 "أوبأولئكم": 1, "أفبذانك": 1, "أمما": 1, "ألعننا": 1, "أكلما": 1,
 "اللذان": 1, "تحتكن": 1, "تحتكم": 1, "ولعمركم": 1, "فعنكم": 1,
 "فعنكن": 1, "ولعمركن": 1, "أوكهناك": 1, "فسويك": 1, "فسويه": 1,
 "أوعينهم": 1, "أوعينهن": 1, "فكسويكما": 1, "أكحسبكما": 1, "جميعكما": 1,
 "فآنفا": 1, "ولسويكن": 1, "أعينهما": 1, "ولسويكم": 1, "وأيا": 1,
 "أوبعضهما": 1, "أفلديهما": 1, "وحينهما": 1, "فبعضي": 1, "لكأنكم": 1,
 "فبعضه": 1, "فبعضك": 1, "أوعينها": 1, "لحمهما": 1, "فحولهما": 1,
 "ألبعضكم": 1, "ألبعضكن": 1, "ونحوكما": 1, "لإنكما": 1, "أفبشبهه": 1,
 "أوبهما": 1, "أفبشبهك": 1, "بحسبنا": 1, "أفبشبهي": 1, "ولشبههن": 1,
 "أوعامتكم": 1, "أوعامتكن": 1, "معكن": 1, "أفنحوهم": 1, "أوأنتما": 1,
 "لأخنا": 1, "أوكعامتك": 1, "ولأخهم": 1, "ولأخهن": 1, "وكحسبنا": 1,
 "أوكعامته": 1, "أقلهما": 1, "فلخلفها": 1, "أوكعامتي": 1, "أفنحوها": 1,
 "بذلكم": 1, "بذلكن": 1, "فلمعكن": 1, "فلمعكم": 1, "فكسوى": 1,
 "فعداكم": 1, "ولأخها": 1, "وتلقاءكم": 1, "فلخلفهم": 1, "فلخلفهن": 1,
 "وتلقاءكن": 1, "أكعين": 1, "فلغيري": 1, "أففوقهم": 1, "فلغيرك": 1,
 "فلغيره": 1, "ولشبهها": 1, "ليميننا": 1, "ولعلهم": 1, "لذين": 1,
 "ألإليكن": 1, "ولعلهن": 1, "لنحونا": 1, "أهو": 1, "أكغيرهما": 1,
 "أهي": 1, "بحمكن": 1, "بحمكم": 1, "ولأولاء": 1, "ولنحوه": 1,
 "ألإليكم": 1, "أفلكلها": 1, "ولنحوك": 1, "أهن": 1, "أوغيرنا": 1,
 "بضعها": 1, "أفبعيني": 1, "أفبنحونا": 1, "أبكلكم": 1, "بفونا": 1,
 "أفبعينه": 1, "وبتجاهي": 1, "أوبكلهن": 1, "وبتجاهك": 1, "وبتجاهه": 1,
 "وبذينك": 1, "وبعدهن": 1, "وبعدهم": 1, "عما": 1, "فلمنهما": 1,
 "أولفوقي": 1, "أولفوقه": 1, "أعينهن": 1, "أعينهم": 1, "أذي": 1,
 "أوبكلها": 1, "كلتا": 1, "وبعدها": 1, "أوعيني": 1, "كله": 1,
 "فلعامتهن": 1, "أولمعنا": 1, "ساء": 1, "أوعينك": 1, "أعينها": 1,
 "وفلان": 1, "أوعينه": 1, "أبضعكم": 1, "لطالما": 1, "أوبك": 1,
 "الولأخ": 1, "وحسبنا": 1, "أفلكلهن": 1, "أفلكلهم": 1, "ألمعي": 1,
 "فضحوة": 1, "ألمعك": 1, "أككلنا": 1, "ألمعه": 1, "أفبنفسي": 1,
 "أفلعليهن": 1, "كلما": 1, "أفلعليهم": 1, "فلعلكن": 1, "فلعلكم": 1,
 "كتلقاءها": 1, "فضمن": 1, "وتلقاءهما": 1, "أوكحسب": 1, "أوكنحو": 1,
 "فكعينه": 1, "أفلجميعها": 1, "وعداكم": 1, "وعداكن": 1, "لنحن": 1,
 "كشبهكم": 1, "كشبهكن": 1, "وضمنكما": 1, "وبأبها": 1, "أبغيرنا": 1,
 "أفبضعها": 1, "أوكنحوكما": 1, "أفخلفي": 1, "ولعلها": 1, "حينكما": 1,
 "وكغيرهما": 1, "أفبضعهم": 1, "أوأمامهما": 1, "أفبضعهن": 1, "أبنفسك": 1,
 "فبفوكما": 1, "أولإنكم": 1, "أولإنكن": 1, "أفلعليها": 1, "كتلقاءهم": 1,
 "كتلقاءهن": 1, "كتجاههما": 1, "أليسوا": 1, "فكتي": 1, "أفلجميعهن": 1,
 "أفلجميعهم": 1, "أوهاهنا": 1, "فكته": 1, "أعليكم": 1, "أعليكن": 1,
 "لغدا": 1, "أفلمعها": 1, "فلأنا": 1, "إليها": 1, "لحيث": 1,
 "أفيمينك": 1, "أشبههما": 1, "ولعليكم": 1, "ولعليكن": 1, "وكأنه": 1,
 "أفيمينه": 1, "فبأنهما": 1, "أولكأننا": 1, "ألكلك": 1, "عدانا": 1,
 "أوخلفكم": 1, "أفبنا": 1, "ألفوقك": 1, "كلاهما": 1, "أومعه": 1,
 "فلأني": 1, "أفلمعهم": 1, "أفلمعهن": 1, "فلأنه": 1, "إليهن": 1,
 "إليهم": 1, "أكمن": 1, "أفلهنالك": 1, "أإليك": 1, "فراح": 1,
 "أإليه": 1, "أفبعامة": 1, "حوالينا": 1, "فمعكن": 1, "فمعكم": 1,
 "وأنت": 1, "لاسيما": 1, "كإياكم": 1, "فكأخنا": 1, "أولفوقنا": 1,
 "فأجمع": 1, "ولفوق": 1, "ولفوك": 1, "ولفوه": 1, "ولفوي": 1,
 "أوبإنها": 1, "وحولكما": 1, "أمامهن": 1, "وبأنكما": 1, "إياها": 1,
 "أوبحسبكم": 1, "أوبحسبكن": 1, "وفوكم": 1, "إليكما": 1, "أوبإنهم": 1,
 "بغيرنا": 1, "نحوكم": 1, "نحوكن": 1, "لبات": 1, "إياهم": 1,
 "إياهن": 1, "وأنك": 1, "أففوقكما": 1, "وأنه": 1, "وأنى": 1,
 "وأني": 1, "أبنا": 1, "وشمالي": 1, "وشماله": 1, "لما": 1,
 "أفبكلكن": 1, "أفبكلكم": 1, "ولأبنا": 1, "ولكلهن": 1, "ولكلهم": 1,
 "فوقك": 1, "أكلها": 1, "أبنفس": 1, "أولأجمعكما": 1, "أفلأمامها": 1,
 "أولشمالها": 1, "بحسبكما": 1, "كغيرها": 1, "أفغيركن": 1, "ألأولالك": 1,
 "أوكتلك": 1, "أفغيركم": 1, "فلأيهما": 1, "أبنحوهما": 1, "أفلأمامهن": 1,
 "وأننا": 1, "أولشمالهن": 1, "أولشمالهم": 1, "تلقاءكما": 1, "بعدكم": 1,
 "بعدكن": 1, "شبه": 1, "لأمامهم": 1, "كغيرهن": 1, "كغيرهم": 1,
 "فوق": 1, "فوك": 1, "وعنها": 1, "لعلينا": 1, "فوه": 1,
 "وبأبه": 1, "فوي": 1, "بنحوكن": 1, "ولكلها": 1, "بنحوكم": 1,
 "كأبكما": 1, "أكلهن": 1, "فهذين": 1, "لشمالكم": 1, "أكلهم": 1,
 "أوعليكن": 1, "أفمثل": 1, "أليمين": 1, "وذوا": 1, "الفلفو": 1,
 "وكجميعكن": 1, "فبسويهما": 1, "ولتحتهم": 1, "ولتحتهن": 1, "فككلهن": 1,
 "فككلهم": 1, "أولخلفكن": 1, "أولخلفكم": 1, "بحمكما": 1, "فلإياكن": 1,
 "فلإياكم": 1, "فكنحونا": 1, "عنهما": 1, "أفكعين": 1, "أفكعامته": 1,
 "الأخ": 1, "الأب": 1, "أولأنتما": 1, "فكأبه": 1, "فكأبك": 1,
 "فكأبي": 1, "عنكم": 1, "عنكن": 1, "فكهذا": 1, "فكعامتي": 1,
 "فكعامته": 1, "كنحوكما": 1, "فكعامتك": 1, "فلغير": 1, "وبأجمعه": 1,
 "وبأجمعي": 1, "فتحت": 1, "ولاستحال": 1, "أكأنه": 1, "أكأنك": 1,
 "فخلفكما": 1, "فحينك": 1, "وبأبهم": 1, "أكأني": 1, "ولتحتها": 1,
 "فلفوقي": 1, "وبأجمعها": 1, "بفوكما": 1, "فكأيكما": 1, "أبإني": 1,
 "أبإنك": 1, "ألأجمعكما": 1, "أبإنه": 1, "لأجمعه": 1, "أبضع": 1,
 "فلفوقه": 1, "لأجمعك": 1, "لتجاهها": 1, "أوبعضكم": 1, "أوبعضكن": 1,
 "لأجمعي": 1, "أولسنا": 1, "أجل": 1, "ألعلهم": 1, "وبضعهما": 1,
 "ألعلهن": 1, "كجميعهن": 1, "كجميعهم": 1, "فلفوقك": 1, "وبأقلكما": 1,
 "فيومئذ": 1, "لتجاههن": 1, "نعم": 1, "أولعلهم": 1, "أفوقكن": 1,
 "فبفوكن": 1, "فبفوكم": 1, "أبأجمعهن": 1, "ألعلها": 1, "فلكأنهن": 1,
 "كجميعها": 1, "لأنشأ": 1, "أفإليهن": 1, "فلكأنهم": 1, "فبأولالك": 1,
 "وبأجمعهن": 1, "وبأجمعهم": 1, "ألشمالكم": 1, "ألشمالكن": 1, "لكاد": 1,
 "ويكأن": 1, "لأيهما": 1, "لي": 1, "لو": 1, "لن": 1,
 "له": 1, "لم": 1, "لك": 1, "ولخلفكما": 1, "لبعضهما": 1,
 "ولإياكن": 1, "ولإياكم": 1, "إما": 1, "وبسوى": 1, "كإننا": 1,
 "فكفوه": 1, "لحم": 1, "فكفوك": 1, "كعينهما": 1, "بأجمعهم": 1,
 "فكفوي": 1, "أفسويكن": 1, "أفسويكم": 1, "ألشبههما": 1, "عامتنا": 1,
 "أفخلفهم": 1, "أفخلفهن": 1, "أولمعهما": 1, "لفوقهم": 1, "لفوقهن": 1,
 "ولكله": 1, "ولكلك": 1, "فعنهما": 1, "ولكلي": 1, "وبهؤلاء": 1,
 "لدنك": 1, "وانقلب": 1, "أفخلفها": 1, "أفكبعضنا": 1, "لفوقها": 1,
 "أكأنهم": 1, "لا": 1, "فلعلينا": 1, "أولأمامهن": 1, "أولأمامهم": 1,
 "أفنحوهما": 1, "أوبضعه": 1, "فبكما": 1, "ففينا": 1, "فكأكثر": 1,
 "فلتجاهنا": 1, "فكنحوي": 1, "أوعينكم": 1, "فتان": 1, "أكذلكم": 1,
 "فكنحوك": 1, "أكذلكن": 1, "عوض": 1, "فكنحوه": 1, "بأقلهما": 1,
 "يميننا": 1, "أثم": 1, "ومازال": 1, "أفتحتنا": 1, "ككلكما": 1,
 "فعيننا": 1, "لدنه": 1, "ألغيركما": 1, "فكأخك": 1, "عينهما": 1,
 "فكأخه": 1, "فذواتي": 1, "ولنحوكن": 1, "ولنحوكم": 1, "فبأولئك": 1,
 "فكتانك": 1, "بأبي": 1, "بأبه": 1, "أفكبعضكن": 1, "بأبك": 1,
 "وأمامنا": 1, "أولشمالنا": 1, "ألفوقكما": 1, "لعامتك": 1, "فلغدا": 1,
 "أفكجميعكما": 1, "لعامته": 1, "أفلمنها": 1, "ولأخكما": 1, "وتلقاءها": 1,
 "لعامتي": 1, "أولهذا": 1, "ولشبهكم": 1, "أفكنفس": 1, "أأمامكما": 1,
 "لأينا": 1, "أأمامك": 1, "أولهو": 1, "ألإن": 1, "أونفسنا": 1,
 "أوعامتهم": 1, "لخلفكما": 1, "أوعامتهن": 1, "معهن": 1, "أفنحوكم": 1,
 "تجاهها": 1, "فلمعها": 1, "ة": 1, "أأمامه": 1, "أفإننا": 1,
 "كالذي": 1, "لستم": 1, "لستن": 1, "لعسى": 1, "أوعامتها": 1,
 "معها": 1, "حتى": 1, "فتين": 1, "تجاههم": 1, "فلمعهن": 1,
 "فلمعهم": 1, "كجميعهما": 1, "أكثري": 1, "أفبعضهما": 1, "لعينهما": 1,
 "ألإنكما": 1, "وتلقاءهم": 1, "أفلمنهن": 1, "أفلمنهم": 1, "وتلقاءهن": 1,
 "فلأصبح": 1, "أكثره": 1, "أولهذه": 1, "وكأجمعهما": 1, "فتحتي": 1,
 "فتحته": 1, "فتحتك": 1, "وبإني": 1, "ولشمالها": 1, "وبإنه": 1,
 "وبإنك": 1, "ولشبهي": 1, "وكسويهن": 1, "لفيهما": 1, "وكسويهم": 1,
 "ولشبهك": 1, "ولشبهه": 1, "جعل": 1, "أوبسوى": 1, "بتجاهنا": 1,
 "أفلديكم": 1, "دون": 1, "فبعدهن": 1, "أولهنالك": 1, "نفسهما": 1,
 "ومادام": 1, "لشمالهما": 1, "أوفيكن": 1, "أوفيكم": 1, "فبالألى": 1,
 "أفكأجمع": 1, "فلسويهما": 1, "فحواليهما": 1, "فبأقلكما": 1, "وكسويها": 1,
 "وبأكثرنا": 1, "أبسويهما": 1, "وكهن": 1, "أوكسويها": 1, "وباللواتي": 1,
 "فبشبهكما": 1, "شبهه": 1, "وكهم": 1, "عيننا": 1, "أولا": 1,
 "وإذن": 1, "ولخلفهن": 1, "أأجمعكما": 1, "شبهي": 1, "وبنحوكن": 1,
 "وبنحوكم": 1, "وفوقهم": 1, "أهذه": 1, "ألمعهن": 1, "أفبكما": 1,
 "أكأجمعهم": 1, "وشتان": 1, "فبإياكم": 1, "ولم": 1, "فهاتين": 1,
 "فيكم": 1, "فيكن": 1, "وبعيننا": 1, "أهذا": 1, "ألمعها": 1,
 "وبأكثرهما": 1, "أوبإن": 1, "أفشبهكما": 1, "فمنك": 1, "فبأبه": 1,
 "أنفسكم": 1, "أمسى": 1, "أوكسويهم": 1, "أوكسويهن": 1, "هم": 1,
 "أولك": 1, "أولم": 1, "أوبهناك": 1, "وإذا": 1, "أولن": 1,
 "أفلمعكما": 1, "أولي": 1, "وكتلقاءكم": 1, "وكتلقاءكن": 1, "فعوض": 1,
 "وأبهما": 1, "إليهما": 1, "أعليهم": 1, "أعليهن": 1, "أفعليك": 1,
 "فبهناك": 1, "فالذي": 1, "أوكذلكن": 1, "أوكذلكم": 1, "أهاتين": 1,
 "ولعليهم": 1, "ولعليهن": 1, "فإننا": 1, "أتحتنا": 1, "بأقلها": 1,
 "لفوها": 1, "لجميعكما": 1, "أفلكأننا": 1, "ألأجمعنا": 1, "فنحوي": 1,
 "فنحوه": 1, "ولعليها": 1, "فكان": 1, "فنحوك": 1, "بحسبك": 1,
 "بأقلهن": 1, "كأيي": 1, "بأقلهم": 1, "لشبهنا": 1, "كأيك": 1,
 "لفوهن": 1, "لفوهم": 1, "كأيه": 1, "أخلفي": 1, "فكأكثرهما": 1,
 "فعينهما": 1, "فبعينكم": 1, "كمثل": 1, "أعليها": 1, "قط": 1,
 "أفلمعكم": 1, "أفلمعكن": 1, "فلأيي": 1, "فلأيه": 1, "فلأيك": 1,
 "لإياه": 1, "ومنذ": 1, "لسوينا": 1, "فمعهن": 1, "فمعهم": 1,
 "أفبتلكم": 1, "عليه": 1, "ألعنهن": 1, "فكعينهما": 1, "ألعنهم": 1,
 "فلغيرها": 1, "بعضهما": 1, "مثل": 1, "فشماله": 1, "أففوق": 1,
 "أوكنحوي": 1, "ولأكثرهن": 1, "ولأكثرهم": 1, "وبتينك": 1, "فسويكما": 1,
 "أوكنحوه": 1, "فلغيرهن": 1, "للواتي": 1, "ك": 1, "فلغيرهم": 1,
 "نحو": 1, "لبعضكن": 1, "لبعضكم": 1, "ولإلي": 1, "فباللواتي": 1,
 "أفلذانك": 1, "فكبعضي": 1, "ولأكثرها": 1, "أوبإنكم": 1, "أوبإنكن": 1,
 "أفكأنكما": 1, "فكبعضك": 1, "فكبعضه": 1, "أليستا": 1, "ألنفسنا": 1,
 "فمعها": 1, "كحسب": 1, "وأيه": 1, "وأين": 1, "فلعامتكما": 1,
 "وأيك": 1, "وأيي": 1, "فبشبهها": 1, "أفلتحتكن": 1, "أفلتحتكم": 1,
 "فليمينكما": 1, "أوهناك": 1, "فكحسبهما": 1, "ولفوقهم": 1, "ولفوقهن": 1,
 "أفكهن": 1, "أفكهم": 1, "لأمامي": 1, "ولأني": 1, "أفمني": 1,
 "ولأنه": 1, "أفكهي": 1, "ولأنك": 1, "أوبغيرهم": 1, "وقام": 1,
 "أوبغيرهن": 1, "فبئس": 1, "أفلعنكن": 1, "ألمنكما": 1, "ولأنت": 1,
 "ولأنا": 1, "فشبه": 1, "أوبغيرها": 1, "أوبمثلكم": 1, "أوبمثلكن": 1,
 "ومثلهما": 1, "فبشبههم": 1, "فبشبههن": 1, "أفلشماله": 1, "أفلعنك": 1,
 "فليته": 1, "خلاكم": 1, "ولتجاه": 1, "خلاكن": 1, "أولعامتي": 1,
 "وبكلنا": 1, "ولفوقها": 1, "هن": 1, "فبكليكما": 1, "هذه": 1,
 "أولعليها": 1, "وبأقلها": 1, "فبتجاهكن": 1, "أوبكليهما": 1, "كسويهن": 1,
 "كسويهم": 1, "أفشمالهم": 1, "أفشمالهن": 1, "وتلقاء": 1, "الكحم": 1,
 "ككلهن": 1, "ككلهم": 1, "وبجميعها": 1, "فعنها": 1, "أولعينهم": 1,
 "أولعينهن": 1, "وهما": 1, "فأكثركم": 1, "فأكثركن": 1, "فبحمهما": 1,
 "فتلقاءي": 1, "ألذلك": 1, "وكذواتي": 1, "أولعينها": 1, "أفكأولئكم": 1,
 "فتلقاءه": 1, "شمالهما": 1, "لأقلنا": 1, "أوبنا": 1, "كفوكم": 1,
 "كفوكن": 1, "ألمعهما": 1, "ولسويكما": 1, "أولعليهن": 1, "أولعليهم": 1,
 "أوكغيرهما": 1, "وبأقلهن": 1, "وبأقلهم": 1, "كسويها": 1, "حسبهن": 1,
 "فلعمركم": 1, "ولأقلكن": 1, "ولأقلكم": 1, "أفلعينهما": 1, "ككلها": 1,
 "تحتهم": 1, "وبجميعهن": 1, "وبجميعهم": 1, "أوسوينا": 1, "فحين": 1,
 "أفبحسبكما": 1, "وشبهي": 1, "لتحتنا": 1, "وشبهه": 1, "وشبهك": 1,
 "بعينك": 1, "بعينه": 1, "فلأبكما": 1, "فبعامة": 1, "بعيني": 1,
 "فحولنا": 1, "أوليستا": 1, "وبتجاههما": 1, "فكتلكما": 1, "لكأن": 1,
 "أفبعامتنا": 1, "كأجمعكم": 1, "ج": 1, "أوبعضهم": 1, "أوبعضهن": 1,
 "فكأيهم": 1, "لعلكما": 1, "فبفوها": 1, "فكأيهن": 1, "خلالكما": 1,
 "أبكليهما": 1, "بشبههما": 1, "أفكهذا": 1, "أوتينك": 1, "فبفوهن": 1,
 "فبفوهم": 1, "أشمالك": 1, "أشماله": 1, "فبأنك": 1, "أبأجمعكن": 1,
 "أبأجمعكم": 1, "فبنحوكما": 1, "وكإياكما": 1, "فحيث": 1, "وبسويها": 1,
 "أوعننا": 1, "وبأجمعكن": 1, "وبأجمعكم": 1, "بيننا": 1, "كأنه": 1,
 "ألهذه": 1, "مثلنا": 1, "وبحيث": 1, "فبأني": 1, "لعمركما": 1,
 "ولإياكما": 1, "كيت": 1, "ألتحتهن": 1, "أفكجميعي": 1, "أفكجميعه": 1,
 "ولمننا": 1, "أفكجميعك": 1, "فلنحن": 1, "أفأجمعها": 1, "ألتحتهم": 1,
 "عندهما": 1, "أفسويهن": 1, "أفسويهم": 1, "كجميعكن": 1, "كجميعكم": 1,
 "كيف": 1, "أفأجمعهن": 1, "كتجاهكما": 1, "أفأجمعهم": 1, "أفسويها": 1,
 "أوحسبكما": 1, "وأمامكم": 1, "أوبذانك": 1, "أليميننا": 1, "ألهذا": 1,
 "لمثلي": 1, "فأجمعهما": 1, "لمثلك": 1, "لديكن": 1, "لمثله": 1,
 "أولحسبنا": 1, "وكسويكما": 1, "وهذين": 1, "أأنتم": 1, "أفيمينكما": 1,
 "كذينك": 1, "وكتلقاءنا": 1, "بأننا": 1, "وأخها": 1, "أوبكلكم": 1,
 "أوبكلكن": 1, "فذينك": 1, "وبعدكن": 1, "وبعدكم": 1, "فلسوي": 1,
 "لفوقكم": 1, "لفوقكن": 1, "وأخهن": 1, "وأخهم": 1, "أفلخلفي": 1,
 "أفلخلفك": 1, "أفلخلفه": 1, "وضمنهما": 1, "كجميع": 1, "فبأخكن": 1,
 "أفبأجمعنا": 1, "فبأخكم": 1, "أوكغيرك": 1, "أوكغيره": 1, "أوكغيري": 1,
 "فلسوف": 1, "فبإياها": 1, "ولطالما": 1, "أيهما": 1, "لمثلها": 1,
 "فلعلهن": 1, "فلعلهم": 1, "وبينكما": 1, "فذواتا": 1, "أولخلفكما": 1,
 "أكثرنا": 1, "أوشمالكما": 1, "لحمهن": 1, "وعداهن": 1, "لأخذ": 1,
 "ولمن": 1, "كفوه": 1, "كيفما": 1, "أولفوقهما": 1, "أبهما": 1,
 "وعاد": 1, "أوبعين": 1, "وشمالهما": 1, "فلعينهن": 1, "كفوك": 1,
 "بفوهما": 1, "فكأيهما": 1, "ولمع": 1, "ولما": 1, "أإنهما": 1,
 "بإياكما": 1, "وكعين": 1, "ولشبه": 1, "أفإليكن": 1, "أوكنفسهما": 1,
 "أوككل": 1, "فبإياهن": 1, "فبإياهم": 1, "لإليه": 1, "أولإنهم": 1,
 "أولإنهن": 1, "حمهما": 1, "لمثلهن": 1, "لمثلهم": 1, "أفبه": 1,
 "فلعلها": 1, "كفوي": 1, "أفبك": 1, "أفلكأنك": 1, "لذلكم": 1,
 "لذلكن": 1, "أعامتك": 1, "أبذاك": 1, "أفبي": 1, "أعامته": 1,
 "فلكلهن": 1, "وغدا": 1, "فلأمامهن": 1, "فلأمامهم": 1, "وكأيها": 1,
 "ففوقها": 1, "فلسوينا": 1, "الفبفو": 1, "أففيه": 1, "وبأخهم": 1,
 "وبأخهن": 1, "أففيي": 1, "فأيا": 1, "فاستحال": 1, "بسوي": 1,
 "أبسويك": 1, "أبسويه": 1, "فبأبكم": 1, "فبعامتكم": 1, "وكغير": 1,
 "وساء": 1, "معهما": 1, "أهاتان": 1, "أفمعكن": 1, "ونحن": 1,
 "وأوه": 1, "ونحو": 1, "مكانك": 1, "اللاتي": 1, "فلأمامها": 1,
 "وكأيهن": 1, "وكأيهم": 1, "ففوقهن": 1, "ففوقهم": 1, "أولنحونا": 1,
 "فكأيها": 1, "ولجميعكن": 1, "ولجميعكم": 1, "فكنفسكم": 1, "فكنفسكن": 1,
 "أفمنهم": 1, "أفكمن": 1, "وأجمعنا": 1, "وبأخك": 1, "ثمة": 1,
 "وبأخه": 1, "فبأنكن": 1, "ما": 1, "كجميعكما": 1, "مع": 1,
 "عنكما": 1, "أوبضعهما": 1, "أوبنحونا": 1, "أبنحوكما": 1, "أفبغيرهما": 1,
 "ورويدك": 1, "ذات": 1, "مه": 1, "أفبغير": 1, "فلعمرك": 1,
 "فلبعضنا": 1, "فلعمره": 1, "فلعمري": 1, "ولعلك": 1, "فلنفس": 1,
 "لعيني": 1, "أفكمثل": 1, "أفجميعكن": 1, "أفجميعكم": 1, "لعينك": 1,
 "أفلشبههما": 1, "ومثل": 1, "أبعينهن": 1, "فتحتهم": 1, "أوبعينه": 1,
 "أكلكن": 1, "أفكعامة": 1, "أكلكم": 1, "ولمثلها": 1, "أوبعيني": 1,
 "ولإيانا": 1, "ولأوشك": 1, "ألفوقكن": 1, "ولأجمعكن": 1, "أكأولاء": 1,
 "ونعما": 1, "كنحوهما": 1, "ومكانكما": 1, "وفينا": 1, "ولإياهن": 1,
 "كمثلهما": 1, "فبعضنا": 1, "فلمثلكما": 1, "فأنك": 1, "أوكحسبنا": 1,
 "وإيانا": 1, "وحواليكما": 1, "أولتحتهم": 1, "أوأولئك": 1, "ولدنك": 1,
 "لأنها": 1, "حولكما": 1, "ولمثلهن": 1, "فأني": 1, "ولمثلهم": 1,
 "أبغيرهما": 1, "كهما": 1, "أوعليهما": 1, "فأنشأ": 1, "أفتحت": 1,
 "أوبضعنا": 1, "أوكهاتين": 1, "فكأولئك": 1, "لجميعكم": 1, "لجميعكن": 1,
 "لعلك": 1, "أفلستما": 1, "وحاشاكما": 1, "أفكأجمعكم": 1, "أوكمثلي": 1,
 "أوكمثله": 1, "أوكمثلك": 1, "وضمنكم": 1, "أكشبهي": 1, "أأنتن": 1,
 "جميع": 1, "ولتحتكم": 1, "أكإنهما": 1, "أكشبهك": 1, "ولتحتكن": 1,
 "فككلكن": 1, "أكشبهه": 1, "فككلكم": 1, "فحسبكما": 1, "فلإياهن": 1,
 "مثلي": 1, "أولخلفهن": 1, "أولخلفهم": 1, "مثله": 1, "أفبهذه": 1,
 "مثلك": 1, "ليتكم": 1, "وبعضنا": 1, "أبعينها": 1, "لكأنهما": 1,
 "أفلفينا": 1, "لأمسى": 1, "أفلغيركما": 1, "فلإياها": 1, "أولخلفها": 1,
 "كأكثرنا": 1, "أفبهذا": 1, "وسويكما": 1, "عين": 1, "فلشبهكما": 1,
 "فهاتان": 1, "وإياك": 1, "وإياي": 1, "ألنحوهم": 1, "ألنحوهن": 1,
 "ولأبهما": 1, "وحيث": 1, "كشبه": 1, "ولفوقكم": 1, "بنحوكما": 1,
 "أفبحسبهم": 1, "أفبحسبهن": 1, "فكتجاه": 1, "أوبمثلها": 1, "ولأقل": 1,
 "ش": 1, "ولتبدل": 1, "مثلكما": 1, "ولأكثركن": 1, "ولأكثركم": 1,
 "وحاشاكم": 1, "أفبحسبها": 1, "وحاشاكن": 1, "أوبمثلهم": 1, "أوبمثلهن": 1,
 "أوكبعض": 1, "وأنتما": 1, "وبأبنا": 1, "ألمعنا": 1, "أفلكله": 1,
 "ألنحوها": 1, "أفلكلك": 1, "أوبتلك": 1, "فبشبهكم": 1, "فبشبهكن": 1,
 "أفلكلي": 1, "فلإنكما": 1, "فكإنهما": 1, "وحين": 1, "أولديهما": 1,
 "ألشمالكما": 1, "كفوها": 1, "فلعليهم": 1, "فلعليهن": 1, "فلذا": 1,
 "فكلهما": 1, "أأجمعي": 1, "ألهاتي": 1, "ولحسبنا": 1, "أوكأنما": 1,
 "أفمعكما": 1, "وبنفسها": 1, "ألهاته": 1, "ككلكن": 1, "فبأينا": 1,
 "فليتكن": 1, "فبتجاهك": 1, "أوخلفكما": 1, "فلفوقنا": 1, "فبتجاهه": 1,
 "فبتجاهي": 1, "أولعينكن": 1, "أوكغيرنا": 1, "كإن": 1, "فبته": 1,
 "ولأخهما": 1, "أوكحسبكما": 1, "فبتي": 1, "أكأجمعنا": 1, "وبالتي": 1,
 "ألذلكن": 1, "فلذي": 1, "ألذلكم": 1, "كفوهم": 1, "كفوهن": 1,
 "فلعليها": 1, "فلذه": 1, "بفوكن": 1, "وتلقاءه": 1, "وبجميعكن": 1,
 "وبجميعكم": 1, "وتلقاءك": 1, "بفوكم": 1, "وبأقلكم": 1, "وبنفسهم": 1,
 "وبنفسهن": 1, "ولأقلهن": 1, "ولأقلهم": 1, "ولنحوها": 1, "أهنا": 1,
 "وخلانا": 1, "لجميع": 1, "ولكنكم": 1, "ولكنكن": 1, "وبكلهما": 1,
 "فمعاذنا": 1, "أأمام": 1, "لإليهم": 1, "لإليهن": 1, "أولأجمعهما": 1,
 "لتحت": 1, "ففوكن": 1, "ولهذا": 1, "أفمثلكما": 1, "ذلك": 1,
 "فليميننا": 1, "لإليها": 1, "وكعامتكما": 1, "فحواليكما": 1, "ولهذي": 1,
 "ولهذه": 1, "أففيكما": 1, "ولنحوهن": 1, "ولنحوهم": 1, "وعنهم": 1,
 "أفكعامتنا": 1, "كتجاهي": 1, "كتجاهك": 1, "وبضعنا": 1, "كتجاهه": 1,
 "فلذينك": 1, "أوهاتين": 1, "أفلهي": 1, "فأمامكن": 1, "وأقلك": 1,
 "وأقله": 1, "وأقلي": 1, "ودون": 1, "وصباح": 1, "فليسوا": 1,
 "ولفيهما": 1, "أفلنحن": 1, "أوشبهنا": 1, "وكشبهها": 1, "أفلنحو": 1,
 "شماله": 1, "شمالك": 1, "شمالي": 1, "وكشبههم": 1, "وكشبههن": 1,
 "وسوي": 1, "وسوى": 1, "أفلغير": 1, "وذاك": 1, "تجاهكن": 1,
 "تجاهكم": 1, "وذان": 1, "وفوهما": 1, "أفليمينكم": 1, "أفلمنكن": 1,
 "أفلمنكم": 1, "أوغيركما": 1, "أوبتلكم": 1, "فلاخلولق": 1, "وبهذي": 1,
 "وبتانك": 1, "أبضعكن": 1, "أفبعامتكما": 1, "وبهذه": 1, "لأقلكما": 1,
 "أمامها": 1, "لعمري": 1, "فكحسبنا": 1, "وبأخ": 1, "وفو": 1,
 "وفي": 1, "فبإننا": 1, "أمامهم": 1, "وأخكن": 1, "وأخكم": 1,
 "ولانقلب": 1, "بسويه": 1, "فعندهما": 1, "أكعامتنا": 1, "ولأنكم": 1,
 "أفعينهما": 1, "ولأنكن": 1, "وبهذا": 1, "كأولئكم": 1, "لجميعه": 1,
 "لجميعك": 1, "لجميعي": 1, "معاذنا": 1, "بذي": 1, "ونفسهما": 1,
 "أوهاتان": 1, "بذه": 1, "وحار": 1, "بأجمعهن": 1, "بحيث": 1,
 "ولفي": 1, "ولفو": 1, "ولشمالهم": 1, "ولشمالهن": 1, "ولإليهم": 1,
 "ولإليهن": 1, "وبمثلكن": 1, "وبمثلكم": 1, "أوشبه": 1, "وبحسب": 1,
 "أويمينكن": 1, "أويمينكم": 1, "فلعينكن": 1, "أولمثلهم": 1, "فلعينكم": 1,
 "ولخلف": 1, "فأولاء": 1, "فكالتي": 1, "ولخلفهم": 1, "فلإن": 1,
 "أوبشبهنا": 1, "لأصبح": 1, "أولشمالكما": 1, "أوكهم": 1, "أوكهن": 1,
 "أوكهو": 1, "أوكهي": 1, "بذا": 1, "لمثلكن": 1, "لمثلكم": 1,
 "أفكمثلنا": 1, "فضمني": 1, "أولاء": 1, "ولنفس": 1, "فبعينها": 1,
 "أوهكذا": 1, "لنفسكم": 1, "لنفسكن": 1, "ألنا": 1, "فبنحو": 1,
 "وحوالينا": 1, "ولمعها": 1, "لعامة": 1, "أفكنفسه": 1, "فعليها": 1,
 "وكنفسي": 1, "أفلشمالي": 1, "وكنفسك": 1, "أفبجميعي": 1, "أإنكما": 1,
 "وكنفسه": 1, "وبهذين": 1, "أبعضي": 1, "ولمعهم": 1, "ومعاذنا": 1,
 "أبعضه": 1, "ولمعهن": 1, "أبعضك": 1, "أولتينك": 1, "فعليهن": 1,
 "فعليهم": 1, "أولأجمع": 1, "أوكهذه": 1, "أفبجميعه": 1, "بأقلكن": 1,
 "معاذكما": 1, "بأقلكم": 1, "فبأنه": 1, "كأني": 1, "فضمنهما": 1,
 "لفوكن": 1, "لفوكم": 1, "فمكانك": 1, "كأنك": 1, "أفنفسه": 1,
 "فبعينهن": 1, "شبهكن": 1, "شبهكم": 1, "فبعينهم": 1, "بسويهما": 1,
 "أوإن": 1, "وإلينا": 1, "ذان": 1, "ذاك": 1, "أوذاك": 1,
 "فإليهما": 1, "بأيهما": 1, "لبعضها": 1, "بسوى": 1, "ولأنهم": 1,
 "أفمعكم": 1, "فبأبكن": 1, "بعامتهن": 1, "أأجمعه": 1, "أفلسويكما": 1,
 "فيمينكم": 1, "أنتن": 1, "فلغيركن": 1, "فيمينكن": 1, "فلغيركم": 1,
 "فكتجاهي": 1, "لبعضهن": 1, "وتجاهنا": 1, "لبعضهم": 1, "فكتجاهك": 1,
 "أخلفها": 1, "لفيكن": 1, "فكتجاهه": 1, "فحوالى": 1, "وليتنا": 1,
 "وبكليكما": 1, "ألجميعكما": 1, "فكسويه": 1, "فلجميعهما": 1, "فكسويك": 1,
 "وأمام": 1, "مننا": 1, "فبكلك": 1, "ألغيرهما": 1, "فبكله": 1,
 "ولتلقاءنا": 1, "فبكلي": 1, "وباللاتي": 1, "وذانك": 1, "أفكبعضه": 1,
 "أفكبعضك": 1, "فأينما": 1, "ألجميعهما": 1, "أفكبعضي": 1, "أوكنفسنا": 1,
 "فبنفسهم": 1, "فبنفسهن": 1, "فإياكن": 1, "أفكأجمعك": 1, "أفلذاك": 1,
 "وكسوي": 1, "وكسوى": 1, "أفكأجمعه": 1, "أفكأجمعي": 1, "أعننا": 1,
 "فتجاههما": 1, "أفلإلينا": 1, "فبنفسها": 1, "أففي": 1, "ولمثلكن": 1,
 "فكأجمعنا": 1, "ولمثلكم": 1, "كشبههما": 1, "فارتد": 1, "فكحمهم": 1,
 "فكحمهن": 1, "فعندهم": 1, "فعندهن": 1, "مكانكم": 1, "مكانكن": 1,
 "كتينك": 1, "لجميعهم": 1, "لجميعهن": 1, "فكأكثركما": 1, "أوشبههما": 1,
 "أفبشبهكما": 1, "ليتها": 1, "فبينك": 1, "لعامتكما": 1, "فبحمكن": 1,
 "كإيانا": 1, "فبحمكم": 1, "ه": 1, "ألأنتما": 1, "ليتهم": 1,
 "ليتهن": 1, "ألتحتنا": 1, "أولهما": 1, "ألأولئك": 1, "فبغيرهما": 1,
 "فكحمها": 1, "فعندها": 1, "حسبنا": 1, "أفلأمامهما": 1, "أوكهذا": 1,
 "لجميعها": 1, "كحمي": 1, "كحمه": 1, "كحمك": 1, "أوكبعضكما": 1,
 "بشبهكن": 1, "ولأقلهما": 1, "ألكلكن": 1, "ألكلكم": 1, "وذين": 1,
 "أفلفوقنا": 1, "فبضعنا": 1, "أفلسوى": 1, "أفلسوي": 1, "فهاهنا": 1,
 "فكشبه": 1, "ببعضها": 1, "أبعينهما": 1, "فالألاء": 1, "كأجمعهن": 1,
 "كأجمعهم": 1, "وبنحوهما": 1, "فخلفنا": 1, "أوأمامنا": 1, "ببعضهن": 1,
 "ببعضهم": 1, "وعندكما": 1, "كأجمعها": 1, "كأولاء": 1, "بأينا": 1,
 "ولعمر": 1, "كأخكما": 1, "وذينك": 1, "وذيت": 1, "ألعنكما": 1,
 "فلعنهم": 1, "وكهاتي": 1, "وحواليه": 1, "فحواليها": 1, "لديهن": 1,
 "لديهم": 1, "فإياكما": 1, "وكهاته": 1, "فتارة": 1, "أففيهما": 1,
 "ولفينا": 1, "أذواتي": 1, "وككلهن": 1, "بينك": 1, "أولمنكما": 1,
 "لحمنا": 1, "أولعلهما": 1, "أذواتا": 1, "أبحسبهما": 1, "ألأمامهما": 1,
 "فكلتا": 1, "فكإياي": 1, "فكإياه": 1, "الفكأب": 1, "الفكأخ": 1,
 "فكإياك": 1, "فلعنها": 1, "لخلف": 1, "أفأجمعكن": 1, "أفأجمعكم": 1,
 "لديها": 1, "بشبهكم": 1, "وحسب": 1, "عندكن": 1, "أوكنفسكما": 1,
 "نفسكن": 1, "ولذلكما": 1, "ولإياك": 1, "أكتلكم": 1, "ولإياه": 1,
 "ولإياي": 1, "حواليكما": 1, "أوبتينك": 1, "فكذه": 1, "وكبعضهن": 1,
 "وكبعضهم": 1, "فكعينها": 1, "فكذي": 1, "وسبحانكم": 1, "وسبحانكن": 1,
 "أكإنها": 1, "ولحسبكما": 1, "ذ": 1, "ولهو": 1, "ولهي": 1,
 "ولهم": 1, "مهما": 1, "أولبعض": 1, "ولهن": 1, "أفلبعضكم": 1,
 "أفلبعضكن": 1, "أهؤلاء": 1, "فعامتهن": 1, "أكإنهم": 1, "أكإنهن": 1,
 "فبتجاه": 1, "أفكعينه": 1, "وككلنا": 1, "ونفسهن": 1, "أفكعينك": 1,
 "ولهب": 1, "ولعين": 1, "ولها": 1, "أفكعيني": 1, "أفمعهما": 1,
 "أوكمن": 1, "وأكثركم": 1, "وأكثركن": 1, "فكذا": 1, "وكبعضها": 1,
 "أوبهو": 1, "أولبعضنا": 1, "فكعينهم": 1, "أفلأجمعك": 1, "أبنحوي": 1,
 "فلجميعهم": 1, "فلجميعهن": 1, "أبنحوه": 1, "أبنحوك": 1, "وأمامي": 1,
 "كالألى": 1, "وأمامك": 1, "فطالما": 1, "وأمامه": 1, "فسبحانكما": 1,
 "سويها": 1, "أولمثلكما": 1, "أبذانك": 1, "أكنحوهم": 1, "ماانفك": 1,
 "فلأكثري": 1, "أكنحوهن": 1, "ولنحوي": 1, "فلأكثره": 1, "فلأكثرك": 1,
 "سويهم": 1, "أوبإنهما": 1, "سويهن": 1, "فباللائي": 1, "أفلشبهكما": 1,
 "أفعامة": 1, "أفبغيركما": 1, "أكنحوها": 1, "أوكإني": 1, "أوكإنه": 1,
 "أوكإنك": 1, "أفبعامتك": 1, "أفبعامته": 1, "فلتلقاءنا": 1, "وببعضكم": 1,
 "أإليهم": 1, "أفبعامتي": 1, "فلجميعها": 1, "بالتي": 1, "فعين": 1,
 "أولإن": 1, "أوأمامه": 1, "أوأمامي": 1, "فعنهن": 1, "كأخنا": 1,
 "أفبضعك": 1, "كتلقاءكن": 1, "وكأيكم": 1, "فلنفسهم": 1, "أفبضعي": 1,
 "الفأب": 1, "أوكهاته": 1, "أكتلك": 1, "فأمامه": 1, "أوكهاتي": 1,
 "فأمامي": 1, "أفلهذا": 1, "أفيمينها": 1, "فلنفسنا": 1, "أبإنهما": 1,
 "بتلقاءها": 1, "إذما": 1, "ولعننا": 1, "ألمعكما": 1, "أفلغيرنا": 1,
 "وبأخكم": 1, "وبأخكن": 1, "فأولالك": 1, "أفجميعهما": 1, "أفلعلكما": 1,
 "وسوينا": 1, "أفيمينهن": 1, "عننا": 1, "أفيمينهم": 1, "كعامتهما": 1,
 "أوعليكما": 1, "بتلقاءهم": 1, "بتلقاءهن": 1, "أوكجميعك": 1, "بإياه": 1,
 "فبعدك": 1, "بإياك": 1, "فبعده": 1, "أفعنكن": 1, "فبعدي": 1,
 "أوكلنا": 1, "أوكليهما": 1, "أونحوها": 1, "أفلجميعكم": 1, "بسويكن": 1,
 "بسويكم": 1, "أوأجمعهن": 1, "أوأجمعهم": 1, "ولطفق": 1, "واللتين": 1,
 "بإنهما": 1, "فلحمهن": 1, "فلحمهم": 1, "أفلحسبكما": 1, "أوكجميعهن": 1,
 "أوكجميعهم": 1, "أبذلك": 1, "فلوما": 1, "حولنا": 1, "ولجميعهن": 1,
 "ولجميعهم": 1, "فلخلف": 1, "الوبفو": 1, "ريث": 1, "لأجمعكم": 1,
 "لأجمعكن": 1, "حولهما": 1, "ألنحوكما": 1, "ولسوف": 1, "فبأنهن": 1,
 "فبأنهم": 1, "كأي": 1, "ولسوي": 1, "كأن": 1, "فلإياي": 1,
 "فو": 1, "في": 1, "لعمرنا": 1, "ولأنكما": 1, "وبجميعك": 1,
 "كأخ": 1, "فبأنها": 1, "كأب": 1, "وبجميعه": 1, "وبجميعي": 1,
 "أبأجمع": 1, "فلحمها": 1, "وعلي": 1, "أكإنكما": 1, "أوكجميعها": 1,
 "وحاشاهما": 1, "ولجميعها": 1, "شبههن": 1, "شبههم": 1, "فكإياكن": 1,
 "فكإياكم": 1, "أولتحتنا": 1, "فأكثرك": 1, "فلكأن": 1, "أجمع": 1,
 "فأكثره": 1, "لنفسهن": 1, "فأكثري": 1, "وكحمكن": 1, "فلعنهما": 1,
 "وكحمكم": 1, "أوخلفي": 1, "أوخلفه": 1, "فبجميعهم": 1, "فبجميعهن": 1,
 "فلديهن": 1, "فلديهم": 1, "لإليكما": 1, "لنفسها": 1, "ولإليكم": 1,
 "ولإليكن": 1, "ولحيث": 1, "أولجميعهما": 1, "ولمعكم": 1, "ولمعكن": 1,
 "ألشمال": 1, "فعليكن": 1, "فعليكم": 1, "فبجميعها": 1, "شبهها": 1,
 "أكغير": 1, "وكأخي": 1, "وكأخه": 1, "فبأقل": 1, "وكأخك": 1,
 "أفسويكما": 1, "فعلى": 1, "كأقل": 1, "فعلق": 1, "كتجاه": 1,
 "أفكأجمعها": 1, "ولإننا": 1, "أفلشمالها": 1, "الفحم": 1, "أولشبهنا": 1,
 "أفببعضها": 1, "فكلكما": 1, "أفبإنهن": 1, "أوكنحوهما": 1, "ألعيننا": 1,
 "فلأجمع": 1, "ذا": 1, "أوبعينكما": 1, "فبأكثرنا": 1, "ولتحتي": 1,
 "ألخلفهما": 1, "ولتحتك": 1, "ولتحته": 1, "أفذلك": 1, "ذه": 1,
 "ذي": 1, "ذو": 1, "أكلهما": 1, "فلستم": 1, "أفكأجمعهم": 1,
 "فكجميعك": 1, "فكجميعه": 1, "أبشبهكن": 1, "فكجميعي": 1, "أولدي": 1,
 "ولجعل": 1, "أفككلك": 1, "أفببعضهم": 1, "أفببعضهن": 1, "أفككله": 1,
 "أككلتا": 1, "أفككلي": 1, "وكغيركما": 1, "فانقلب": 1, "وحسبكن": 1,
 "أوبنحوه": 1, "وبتلقاءكما": 1, "أولفيه": 1, "أوبنحوك": 1, "أولفيك": 1,
 "أوبنحوي": 1, "ألنحوكن": 1, "أومنهن": 1, "أومنهم": 1, "فلعنهن": 1,
 "أفبحسبكم": 1, "أفبحسبكن": 1, "فبأنكما": 1, "فبأبها": 1, "لتحته": 1,
 "لتحتي": 1, "أبعين": 1, "ولأمامكن": 1, "بأولاء": 1, "أوبجميع": 1,
 "فبأبهم": 1, "فبأبهن": 1, "وحاشاهم": 1, "وحاشاهن": 1, "ولبعضهما": 1,
 "ولأولئكم": 1, "أوخلفهن": 1, "أوكنفس": 1, "أبإن": 1, "أفوقنا": 1,
 "فحار": 1, "أحسبكما": 1, "وأصلا": 1, "أفلجميعهما": 1, "وبنفسكم": 1,
 "وبنفسكن": 1, "كهنالك": 1, "أوإليكن": 1, "ولمعي": 1, "أوإليكم": 1,
 "وشكان": 1, "فلعليكن": 1, "ولمعك": 1, "أكمثلكما": 1, "ولمعه": 1,
 "فلأقلنا": 1, "أنحن": 1, "فسوي": 1, "أوفوقهما": 1, "أنحو": 1,
 "فهيا": 1, "لحرى": 1, "فهيت": 1, "أفبمثلنا": 1, "فمكانكن": 1,
 "أفقلما": 1, "أبكلكما": 1, "فلبعض": 1, "لنفسكما": 1, "أأمامي": 1,
 "إليه": 1, "إليك": 1, "فلجميعه": 1, "خلالنا": 1, "فلجميعك": 1,
 "أوكأجمعكما": 1, "أكسويكما": 1, "أفأمامهم": 1, "أفأمامهن": 1, "بمثلنا": 1,
 "كعامتكن": 1, "أولكأنكم": 1, "أفلشمالهم": 1, "أفلشمالهن": 1, "صه": 1,
 "ألكلكما": 1, "ألكلهن": 1, "ألكلهم": 1, "ألخلفه": 1, "ويمينهم": 1,
 "فكلا": 1, "أبعيننا": 1, "بينه": 1, "ألدى": 1, "ألدي": 1,
 "ظ": 1, "فلعمركما": 1, "فكلي": 1, "أفعينكما": 1, "فأما": 1,
 "أكثر": 1, "فكلك": 1, "ببعضكن": 1, "أولديه": 1, "ويمينها": 1,
 "فكله": 1, "أشبهي": 1, "أشبهك": 1, "أشبهه": 1, "لإن": 1,
 "فخلالهما": 1, "وكفوهما": 1, "أكبعضكما": 1, "ألكلها": 1, "أبجميعكما": 1,
 "أفأولالك": 1, "أولنفسكما": 1, "فلعنكم": 1, "كاللذين": 1, "فلعلهما": 1,
 "سبحانكن": 1, "سبحانكم": 1, "وكغيركن": 1, "وكغيركم": 1, "دونك": 1,
 "لشمالنا": 1, "عندها": 1, "أفلكأنكما": 1, "وكمثلهما": 1, "أقلنا": 1,
 "أفذاك": 1, "بأكثرنا": 1, "فلكننا": 1, "لدننا": 1, "فكشبهكما": 1,
 "أوليميني": 1, "أوكأجمعهن": 1, "كعينكن": 1, "كعينكم": 1, "هما": 1,
 "ألكأننا": 1, "ولفوهم": 1, "ولأكثري": 1, "ولأكثرك": 1, "وكعينهم": 1,
 "ولأكثره": 1, "عندهم": 1, "عندهن": 1, "منهم": 1, "فلعنك": 1,
 "أوليمينك": 1, "منهن": 1, "كهي": 1, "أفبسوى": 1, "أفبسوي": 1,
 "وته": 1, "أفكحسبك": 1, "أكسويها": 1, "أفكحسبه": 1, "أوكأجمعها": 1,
 "فلعنه": 1, "أفكحسبي": 1, "أبضعهم": 1, "وتي": 1, "وكاللواتي": 1,
 "ومذ": 1, "ليمينكما": 1, "وبضعهم": 1, "فأبهما": 1, "ومع": 1,
 "أصبح": 1, "وما": 1, "لهؤلاء": 1, "فيما": 1, "أفلست": 1,
 "فكأننا": 1, "فلحمك": 1, "فلحمه": 1, "فلحمي": 1, "اللائي": 1,
 "ومن": 1, "وكهذين": 1, "أمامكن": 1, "أمامكم": 1, "فنعما": 1,
 "فلأكثرنا": 1, "كعينكما": 1, "وبنا": 1, "فلتحول": 1, "وبتجاهها": 1,
 "أمعك": 1, "فلدنكن": 1, "فلدنكم": 1, "بذلك": 1, "أكسويهم": 1,
 "وسبحاني": 1, "أكسويهن": 1, "أمعي": 1, "أوكأجمعهم": 1, "وسبحانه": 1,
 "أبضعها": 1, "وسبحانك": 1, "أبمثلي": 1, "لبعضكما": 1, "أبمثلك": 1,
 "فبإياك": 1, "أبمثله": 1, "حيني": 1, "فحمها": 1, "وبنحوهم": 1,
 "فخلالهم": 1, "أويمينها": 1, "لفوقهما": 1, "عندكم": 1, "بأجمعكم": 1,
 "بأجمعكن": 1, "وبمثلها": 1, "فتلقاءك": 1, "حذار": 1, "أفهاهنا": 1,
 "أويمينهن": 1, "عداه": 1, "عداك": 1, "فبتلك": 1, "وبمثلهن": 1,
 "وبمثلهم": 1, "ولوما": 1, "أفهنالك": 1, "فنفس": 1, "أببعضنا": 1,
 "فسبحان": 1, "وفوقكم": 1, "ولخلفكن": 1, "فحمهن": 1, "فحمهم": 1,
 "ككلنا": 1, "أفهذان": 1, "لدني": 1, "أوأجمعكن": 1, "أومثل": 1,
 "فكليكما": 1, "أفعليهما": 1, "وبعين": 1, "أفيمين": 1, "أوثم": 1,
 "بسويها": 1, "فليمينكن": 1, "أوخلف": 1, "لخلفه": 1, "لأقلي": 1,
 "لأقله": 1, "ولعامتكما": 1, "لأقلك": 1, "أكنحوكم": 1, "أكنحوكن": 1,
 "خلاهما": 1, "فعامتكن": 1, "أفيمينكن": 1, "أفيمينكم": 1, "علينا": 1,
 "أوبجميعكما": 1, "أوتحتهما": 1, "وبالألاء": 1, "وخلاهما": 1, "تلقاءها": 1,
 "فكبعض": 1, "ولنحوكما": 1, "بسويهن": 1, "فكذلكن": 1, "فكذلكم": 1,
 "بسويهم": 1, "أوكجميعكن": 1, "كفوهما": 1, "أوكجميعكم": 1, "وحول": 1,
 "ولنفسك": 1, "بعينكن": 1, "فلحمكن": 1, "ولنفسي": 1, "فلحمكم": 1,
 "وبحمنا": 1, "أتلكما": 1, "أولشمال": 1, "أفبنحوي": 1, "وذلكم": 1,
 "وذلكن": 1, "فأخهما": 1, "أفبنحوك": 1, "أفبنحوه": 1, "لأجمعهم": 1,
 "وعداكما": 1, "لأجمعهن": 1, "أبضعك": 1, "أبضعي": 1, "أوكإنكن": 1,
 "أوكإنكم": 1, "لأجمعها": 1, "سبحان": 1, "فلفيها": 1, "أفخلف": 1,
 "فلانقلب": 1, "فشمالك": 1, "ولغيرنا": 1, "أكشبه": 1, "وإيه": 1,
 "أولفوق": 1, "فأجمعي": 1, "وكالتي": 1, "فلشرع": 1, "أفغيرنا": 1,
 "فأجمعه": 1, "كحسبكما": 1, "أوبعامتي": 1, "أوبعامته": 1, "أكشبهنا": 1,
 "أوبعامتك": 1, "أوكأنها": 1, "كاد": 1, "أوليميننا": 1, "وتحتكم": 1,
 "وتحتكن": 1, "أبعينكما": 1, "كأنكم": 1, "كأنكن": 1, "فلأبهن": 1,
 "فلشمالنا": 1, "فمننا": 1, "كان": 1, "فأبكم": 1, "فأبكن": 1,
 "ولمنكما": 1, "بك": 1, "أجمعهما": 1, "لحسب": 1, "أإليكم": 1,
 "أولمثلنا": 1, "أفأولئكم": 1, "فبأجمع": 1, "بل": 1, "فبعدهما": 1,
 "أوبعض": 1, "أوكأنهم": 1, "فلتجاه": 1, "أوكأنهن": 1, "فبغير": 1,
 "بشبههم": 1, "بشبههن": 1, "فلشمالكما": 1, "فكحمكم": 1, "لأجمع": 1,
 "فكحمكن": 1, "كأيهم": 1, "كأيهن": 1, "أفلذلكما": 1, "وفيها": 1,
 "أفبجميعهن": 1, "أفبجميعهم": 1, "وكأكثرك": 1, "فسبحانكن": 1, "فسبحانكم": 1,
 "وكأكثره": 1, "وكأكثري": 1, "فعامتهم": 1, "فبحمها": 1, "وفوكما": 1,
 "وبفوه": 1, "وبفوك": 1, "أيكن": 1, "وبفوي": 1, "أيكم": 1,
 "ومابرح": 1, "أوفيهما": 1, "وحاشا": 1, "فممن": 1, "أجمعكما": 1,
 "فبنفسكن": 1, "فبحمهن": 1, "فبحمهم": 1, "أحسب": 1, "كإياكما": 1,
 "فحينهم": 1, "وغيرنا": 1, "بشبهها": 1, "لفوهما": 1, "بنفسهما": 1,
 "بأخي": 1, "وخلالك": 1, "بخ": 1, "بأخك": 1, "فحينهن": 1,
 "أفبجميعها": 1, "بأخه": 1, "فكهؤلاء": 1, "أفلأجمع": 1, "فلشمالكن": 1,
 "أوهما": 1, "أفلنفسي": 1, "فكتجاههم": 1, "فكتجاههن": 1, "ألحسبي": 1,
 "فبذينك": 1, "فلشمالكم": 1, "فكاللاتي": 1, "ألحسبك": 1, "ألإليها": 1,
 "ألحسبه": 1, "وبتلكم": 1, "لشبههما": 1, "ولحسبهما": 1, "أفكنفسهن": 1,
 "وككلهما": 1, "أفكنفسهم": 1, "أففوقكم": 1, "أففوقكن": 1, "ألإليهن": 1,
 "أفبسويكما": 1, "ألإليهم": 1, "أنشأ": 1, "فلفيكما": 1, "أوككليكما": 1,
 "لعنكم": 1, "لعنكن": 1, "بعامتكما": 1, "فبأبهما": 1, "ليتكما": 1,
 "ألنحوهما": 1, "أغيري": 1, "أغيره": 1, "فكتجاهها": 1, "أونفسهما": 1,
 "أوعين": 1, "وبك": 1, "وكتلقاءي": 1, "وكتلقاءها": 1, "وبه": 1,
 "وابتدأ": 1, "وكتلقاءك": 1, "وبي": 1, "وكتلقاءه": 1, "فلأجمعهن": 1,
 "ألعلينا": 1, "فبهذه": 1, "أفلأولئك": 1, "لات": 1, "فبهذي": 1,
 "أونحوه": 1, "فلفونا": 1, "فيها": 1, "ألمعكم": 1, "ألمعكن": 1,
 "وخلفنا": 1, "وكهناك": 1, "وبعض": 1, "أوشمال": 1, "وكجميعهم": 1,
 "وكجميعهن": 1, "وبعد": 1, "أولعينه": 1, "لأكثرك": 1, "فيهم": 1,
 "أككلي": 1, "لأكثره": 1, "وكإنهم": 1, "لأكثري": 1, "أككله": 1,
 "أوأولالك": 1, "فشتان": 1, "أككلك": 1, "وبس": 1, "لكأنكما": 1,
 "ففوهما": 1, "عدا": 1, "وكتلقاءهم": 1, "وكتلقاءهن": 1, "أفككلتا": 1,
 "عدس": 1, "وبخ": 1, "فلأجمعها": 1, "وبله": 1, "ليسا": 1,
 "وأبنا": 1, "فكعينكم": 1, "أفجميعكما": 1, "فأمامها": 1, "لتجاهه": 1,
 "أكنفسكما": 1, "لتجاهك": 1, "وكأنكن": 1, "وكأنكم": 1, "فعامتكما": 1,
 "لتجاهي": 1, "وأكثرها": 1, "أفلأجمعه": 1, "أفكإنكما": 1, "بطآن": 1,
 "أفلبعضهم": 1, "أفلبعضهن": 1, "أفككلها": 1, "فأجمعنا": 1, "وسبحانهم": 1,
 "وسبحانهن": 1, "فلتحتها": 1, "أومثلهم": 1, "أإليها": 1, "فبإياه": 1,
 "أومثلهن": 1, "أكجميعه": 1, "أفلأجمعي": 1, "أكجميعك": 1, "ولمعهما": 1,
 "أبعضنا": 1, "واها": 1, "أففوقي": 1, "أفككلهم": 1, "أفككلهن": 1,
 "أفلبعضها": 1, "فلتحتهم": 1, "أولهؤلاء": 1, "والألى": 1, "أومثلها": 1,
 "لكلكما": 1, "فعداهما": 1, "وإذما": 1, "فأمامهن": 1, "فأمامهم": 1,
 "فتلقاء": 1, "وأكثرهم": 1, "وأكثرهن": 1, "وبحمهما": 1, "ولظل": 1,
 "كي": 1, "فيميننا": 1, "وبأنهم": 1, "وبأنهن": 1, "فتلقاءهن": 1,
 "أولأمامها": 1, "فتلقاءهم": 1, "أأولئك": 1, "فمرة": 1, "أوبنحوهما": 1,
 "ء": 1, "فلتجاههما": 1, "أبأجمعهما": 1, "فبكلكما": 1, "أعن": 1,
 "أوفيك": 1, "ولكم": 1, "ولكل": 1, "أوفيه": 1, "ولكن": 1,
 "تينك": 1, "ولكي": 1, "فيهن": 1, "وبفوكم": 1, "وبفوكن": 1,
 "لعلهم": 1, "أولكلهما": 1, "فعل": 1, "فليس": 1, "فعن": 1,
 "ذانك": 1, "وبأنها": 1, "أوببعضه": 1, "فتلقاءها": 1, "فليت": 1,
 "أوببعضك": 1, "فعني": 1, "فلأقلكما": 1, "أوعامتكما": 1, "فعنه": 1,
 "أوببعضي": 1, "فعنك": 1, "أكسويكم": 1, "وبتجاهكن": 1, "وبإياي": 1,
 "فليتها": 1, "وبإياه": 1, "وبين": 1, "أوكأجمعكن": 1, "أوكأجمعكم": 1,
 "ولكأنهن": 1, "أوعلي": 1, "أوعلى": 1, "ولكأنهم": 1, "وبأكثري": 1,
 "فبأي": 1, "وبأكثره": 1, "فلدنها": 1, "وبأكثرك": 1, "أبجميعي": 1,
 "أفبضعكما": 1, "لتحتكم": 1, "أبجميعك": 1, "أوكتينك": 1, "أبجميعه": 1,
 "وعليهن": 1, "وعامتكن": 1, "وعامتكم": 1, "أكجميعهما": 1, "أفبعضك": 1,
 "أفبعضه": 1, "أفبعضي": 1, "أبكليكما": 1, "للألاء": 1, "أولتحتي": 1,
 "وبفوهما": 1, "ارتد": 1, "وبيد": 1, "فليتهن": 1, "أولئكم": 1,
 "ولكأنها": 1, "فلدنهن": 1, "فلدنهم": 1, "ولبعضنا": 1, "أفشمالها": 1,
 "ولدينا": 1, "فأكثرهما": 1, "فحمكن": 1, "فحمكم": 1, "ولإياهما": 1,
 "فللاتي": 1, "أولشبهه": 1, "بذات": 1, "ألأمامكما": 1, "أولتحته": 1,
 "أولشبهك": 1, "أولشبهي": 1, "وآمين": 1, "أولسوينا": 1, "أنحوكم": 1,
 "أولأجمعه": 1, "أولأجمعك": 1, "أوتلكما": 1, "أولأجمعي": 1, "لأنتما": 1,
 "وعامته": 1, "وعامتك": 1, "فعليهما": 1, "وعامتي": 1, "ألشبهه": 1,
 "وكمثلنا": 1, "فلنحو": 1, "أكبعضهم": 1, "أكبعضهن": 1, "لعينكن": 1,
 "بذاك": 1, "لعينكم": 1, "فلإياك": 1, "لذلكما": 1, "ببعضك": 1,
 "أولدى": 1, "أوكنفسها": 1, "أولسويكما": 1, "فكم": 1, "فكل": 1,
 "ببعضي": 1, "فكي": 1, "أفكذلك": 1, "وبذاك": 1, "ولئن": 1,
 "فكإياهن": 1, "فكإياهم": 1, "أفكسويه": 1, "أولعنهم": 1, "أولعنهن": 1,
 "أفكسويك": 1, "أوبسوينا": 1, "فبجميعكم": 1, "فبجميعكن": 1, "بأقل": 1,
 "وكحمهن": 1, "وكحمهم": 1, "أولعنها": 1, "وكبعض": 1, "فلديكن": 1,
 "فلديكم": 1, "بنحوهما": 1, "لأيك": 1, "لأيه": 1, "لأيي": 1,
 "وكحمها": 1, "وببعضكن": 1, "أوكنفسهن": 1, "أوكنفسهم": 1, "فمعكما": 1,
 "فبهما": 1, "وليسوا": 1, "وبذات": 1, "فكإياها": 1, "ولنفسكم": 1,
 "ولنفسكن": 1, "فكلها": 1, "وحولك": 1, "فلعينك": 1, "أفببعضكم": 1,
 "أفببعضكن": 1, "وحولي": 1, "فلتحتي": 1, "أولكأنهن": 1, "أفهنا": 1,
 "أبشبهها": 1, "تجاههما": 1, "أبنحوكم": 1, "أبنحوكن": 1, "أفلنفسكما": 1,
 "فكعامتهما": 1, "أفككلكما": 1, "أولفوقكما": 1, "فإما": 1, "وكلهم": 1,
 "إياهما": 1, "وكلهن": 1, "أبكما": 1, "لمنهم": 1, "أوكلتا": 1,
 "أوكعينها": 1, "أفلعلكم": 1, "أوأنت": 1, "أفلعلكن": 1, "أفلفيهم": 1,
 "وكأبهما": 1, "وكلها": 1, "فلمثلنا": 1, "ولأمامنا": 1, "لمنها": 1,
 "أمثلي": 1, "أوكعينهم": 1, "أوكعينهن": 1, "أمثله": 1, "أبعامتكما": 1,
 "فلأولئكم": 1, "أمثلك": 1, "أولديهن": 1, "فكلهم": 1, "فكلهن": 1,
 "فتلقاءكما": 1, "ولتلقاءي": 1, "فكأكثري": 1, "فكأكثره": 1, "ولتلقاءه": 1,
 "فكأكثرك": 1, "ولتلقاءك": 1, "أتحتكم": 1, "أتحتكن": 1, "أبشبههن": 1,
 "أبشبههم": 1, "ولعامتهما": 1, "ونحوهن": 1, "أفبضعه": 1, "أنكم": 1,
 "وكإنكما": 1, "أوكأنكم": 1, "أوكأنكن": 1, "أولإليكن": 1, "أولإليكم": 1,
 "أبأجمعها": 1, "وكأيكن": 1, "أهكذا": 1, "أونحوهن": 1, "وبضعكن": 1,
 "لفوكما": 1, "كأنها": 1, "فبذا": 1, "ولكرب": 1, "هاتين": 1,
 "وجميعهن": 1, "فهلا": 1, "فأبها": 1, "وكأنهما": 1, "ألكأنه": 1,
 "أبنفسكم": 1, "فبعينكن": 1, "فلعينهما": 1, "كأنهم": 1, "كأنهن": 1,
 "فبذه": 1, "أجميعهما": 1, "ألعليك": 1, "أوكعامتنا": 1, "وجميعها": 1,
 "فأبهم": 1, "فأبهن": 1, "فلبات": 1, "ونحوها": 1, "فلتينك": 1,
 "فأمامك": 1, "فرب": 1, "فغيرنا": 1, "الفأخ": 1, "أوبأولالك": 1,
 "عنك": 1, "فلنفسها": 1, "أأمامكم": 1, "عني": 1, "أفبجميعكن": 1,
 "أفبجميعكم": 1, "أوذلكن": 1, "كأيكم": 1, "كأيكن": 1, "أوذلكم": 1,
 "وتحتها": 1, "أول": 1, "أوه": 1, "لتحتها": 1, "أفبأولالك": 1,
 "واللتيا": 1, "وخلفها": 1, "أفذانك": 1, "وككل": 1, "فسبحانهن": 1,
 "فسبحانهم": 1, "فريث": 1, "أعليهما": 1, "وتحتهم": 1, "وتحتهن": 1,
 "وكهنالك": 1, "وإنهما": 1, "أسوينا": 1, "فذوا": 1, "إننا": 1,
 "فسبحانها": 1, "أإن": 1, "كإياه": 1, "كإياي": 1, "فحاشاكم": 1,
 "فحاشاكن": 1, "عند": 1, "فلإننا": 1, "وبغيرهن": 1, "وبغيرهم": 1,
 "أكجميع": 1, "أفبذلك": 1, "ولإليكما": 1, "وببعضهن": 1, "وببعضهم": 1,
 "أفكحسبها": 1, "فللذي": 1, "أنفسها": 1, "أيها": 1, "أفلشمالكن": 1,
 "وحينهم": 1, "ويمينكم": 1, "ويمينكن": 1, "فوقكن": 1, "أشبه": 1,
 "أفلتحتي": 1, "أنفسهم": 1, "تلكم": 1, "أيهن": 1, "أيهم": 1,
 "وأكثره": 1, "وأكثرك": 1, "أوكعينه": 1, "وأكثري": 1, "فلذانك": 1,
 "وبغيرها": 1, "أماذا": 1, "ليمينهما": 1, "فخلالها": 1, "وعينهم": 1,
 "أفلتحتك": 1, "رب": 1, "أقبل": 1, "أفكحسبهم": 1, "أفكحسبهن": 1,
 "لأجمعكما": 1, "ولعنه": 1, "سبحانهن": 1, "سبحانهم": 1, "أومثلي": 1,
 "أوبنفسكما": 1, "ولحمهم": 1, "ولحمهن": 1, "أومثلك": 1, "أومثله": 1,
 "ألعليهما": 1, "أهاهنا": 1, "وخلف": 1, "كعينها": 1, "وكغيرها": 1,
 "ولحمها": 1, "أفلمثلهما": 1, "وكإياهما": 1, "وخلا": 1, "كعينهن": 1,
 "كعينهم": 1, "فكأجمع": 1, "أحسبهن": 1, "وفيهما": 1, "سبحانها": 1,
 "أولجميعك": 1, "أحسبهم": 1, "أولجميعه": 1, "أولجميعي": 1, "أولعامة": 1,
 "أفكنحونا": 1, "ألديها": 1, "أفعيننا": 1, "أولعنهما": 1, "أفماذا": 1,
 "أوحسبي": 1, "فأخنا": 1, "أوحسبه": 1, "أوحسبك": 1, "واخلولق": 1,
 "ألسوى": 1, "أوطالما": 1, "ألسوي": 1, "بإياي": 1, "وكأنها": 1,
 "ولعليه": 1, "حواليك": 1, "ولعليك": 1, "أأمامكن": 1, "بضع": 1,
 "ومافتئ": 1, "وتجاههما": 1, "أفككلكم": 1, "أفككلكن": 1, "أفكسويكم": 1,
 "فلتحتكم": 1, "أوبكلتا": 1, "أفكسويكن": 1, "أفبضعهما": 1, "ألديهم": 1,
 "ألديهن": 1, "وكاللذين": 1, "فبأجمعكم": 1, "ومهما": 1, "فأمامكم": 1,
 "فبأجمعكن": 1, "وبفوها": 1, "أفخلفه": 1, "ألمثلنا": 1, "لأولئك": 1,
 "يمين": 1, "إياي": 1, "وبأنكم": 1, "وبأنكن": 1, "إياه": 1,
 "فأنهن": 1, "أوخلفنا": 1, "فأنهم": 1, "عيني": 1, "بنفسها": 1,
 "فتلقاءكن": 1, "فتلقاءكم": 1, "عينك": 1, "فلأكثركما": 1, "عينه": 1,
 "فأصبح": 1, "أفخلفنا": 1, "وخلاكما": 1, "أحسبها": 1, "فالتي": 1,
 "أعينكما": 1, "بنفسهم": 1, "بنفسهن": 1, "فعنده": 1, "أومثلكم": 1,
 "فعندي": 1, "أومثلكن": 1, "أوفوقكن": 1, "أوفوقكم": 1, "وساءما": 1,
 "بتجاهها": 1, "أفذي": 1, "وبفوهم": 1, "وبفوهن": 1, "أوإليها": 1,
 "وعداهما": 1, "أوفي": 1, "ومعاذ": 1, "شمالنا": 1, "أولإليكما": 1,
 "فأنها": 1, "وتبدل": 1, "وارتد": 1, "وإياهما": 1, "بجميعي": 1,
 "ولعامتهن": 1, "ألفوقنا": 1, "بجميعك": 1, "ضمنكن": 1, "فإلينا": 1,
 "بجميعه": 1, "أفبعضنا": 1, "أفلكليكما": 1, "أوبأجمعكم": 1, "أولأولئك": 1,
 "أوبأجمعكن": 1, "أفبإنكن": 1, "أفبإنكم": 1, "ببعضكما": 1, "أكغيركم": 1,
 "أكغيركن": 1, "ألمنه": 1, "ألمنك": 1, "أوتحتهم": 1, "فتجاهنا": 1,
 "لمعك": 1, "وعنكما": 1, "وكأقلكما": 1, "لمعه": 1, "الذي": 1,
 "لمعي": 1, "بأنكم": 1, "وشبهكما": 1, "فبأقلي": 1, "فبأقله": 1,
 "ولحمكما": 1, "فبأقلك": 1, "فمثلنا": 1, "وكبعضه": 1, "أوبعينكم": 1,
 "وكبعضك": 1, "أوبعينكن": 1, "لتحتهما": 1, "وكبعضي": 1, "ألتحته": 1,
 "بشبهكما": 1, "فكتين": 1, "فبحسبهن": 1, "فبحسبهم": 1, "فمعهما": 1,
 "إلي": 1, "أوكإنها": 1, "الولحم": 1, "أوبعضي": 1, "ألخلفي": 1,
 "فخلالكم": 1, "فخلالكن": 1, "أوبعضه": 1, "أوبعضك": 1, "فبحسبها": 1,
 "ألإليك": 1, "أحسبهما": 1, "ألإليه": 1, "ألكأنها": 1, "ألكأن": 1,
 "ولهاتين": 1, "أفليمينه": 1, "فإني": 1, "أوكإنهن": 1, "أوكإنهم": 1,
 "فإنك": 1, "أوسويهما": 1, "فإنه": 1, "ولإنهما": 1, "أفبذاك": 1,
 "أوكسويكما": 1, "أفنفسهم": 1, "أفنفسهن": 1, "أولإليك": 1, "أإليهن": 1,
 "عامة": 1, "فطفق": 1, "فللألى": 1, "أكمثلنا": 1, "ولكنهم": 1,
 "لتين": 1, "لإليكم": 1, "فأكثر": 1, "فلأمامهما": 1, "أفلجميع": 1,
 "وكفو": 1, "ألمثلكما": 1, "كأبكن": 1, "أكأولئكم": 1, "كأبكم": 1,
 "ولكنها": 1, "أفليمينكما": 1, "لأكثرنا": 1, "وتحته": 1, "وتحتك": 1,
 "وأوشك": 1, "أفبسويهما": 1, "والذي": 1, "بأبهما": 1, "ولسوى": 1,
 "فبكلتا": 1, "أفكلنا": 1, "فبتلقاءكم": 1, "فبتلقاءكن": 1, "أغيركن": 1,
 "أوكبعضي": 1, "فلكيلا": 1, "أفأولاء": 1, "الحم": 1, "وكأكثركما": 1,
 "أبسوى": 1, "أبسوي": 1, "وكتجاههن": 1, "وكتجاههم": 1, "أولغيرها": 1,
 "أكأنكن": 1, "فلمعهما": 1, "أولذينك": 1, "فشمالهما": 1, "ففوها": 1,
 "منذ": 1, "كسويكما": 1, "أفلتحتهم": 1, "ولتحتهما": 1, "وأكثرهما": 1,
 "ففوهن": 1, "خلفكن": 1, "خلفكم": 1, "ففوهم": 1, "مني": 1,
 "ألنفسي": 1, "أفعنكم": 1, "ألعامتنا": 1, "ألنفسك": 1, "منك": 1,
 "وكشبهكم": 1, "وكشبهكن": 1, "منه": 1, "أوأمام": 1, "وكتجاهها": 1,
 "نفسنا": 1, "أولغيرهم": 1, "كأنكما": 1, "أولغيرهن": 1, "فكأكثرها": 1,
 "أفكأولالك": 1, "فكأقلهما": 1, "أوأجمعهما": 1, "أفبشبهكن": 1, "كلا": 1,
 "لعنها": 1, "أففيهن": 1, "فكتجاهكم": 1, "أفينا": 1, "فكتجاهكن": 1,
 "ولأمام": 1, "وحينكما": 1, "أفكشبهها": 1, "وبنفسكما": 1, "أفكذواتي": 1,
 "أفوقكما": 1, "أففوقها": 1, "فضمننا": 1, "أولكلنا": 1, "أفكأولاء": 1,
 "أفلعينه": 1, "أفلعينك": 1, "كنفسنا": 1, "أفكذي": 1, "أفلعيني": 1,
 "فلفينا": 1, "فكجميعكما": 1, "أففوقهن": 1, "أفكنفسكن": 1, "أفكنفسكم": 1,
 "لحمكما": 1, "لعنهم": 1, "فآه": 1, "فكعينك": 1, "أوإليهما": 1,
 "أفشبهنا": 1, "كلي": 1, "ونحوهما": 1, "وغير": 1, "فكذواتي": 1,
 "ولعينهما": 1, "ففوقكما": 1, "أفكشبههن": 1, "أفكشبههم": 1, "جميعها": 1,
 "فلديهما": 1, "أوببعضهما": 1, "فلأجمعكم": 1, "فلأجمعكن": 1, "أوعني": 1,
 "أوعنه": 1, "أوعنك": 1, "لأخ": 1, "لأب": 1, "فوقي": 1,
 "وبسويكما": 1, "فوقه": 1, "أفكعينهما": 1, "فلنحوها": 1, "وهب": 1,
 "أوأمامكم": 1, "وكجميعكم": 1, "أفمثلنا": 1, "لأي": 1, "لأن": 1,
 "لأجمعهما": 1, "فلنحوهن": 1, "فلنحوهم": 1, "وهي": 1, "وهو": 1,
 "وهن": 1, "وهل": 1, "وهم": 1, "فحيني": 1, "أبهؤلاء": 1,
 "جميعهم": 1, "فشبهه": 1, "جميعهن": 1, "وكإنكم": 1, "فشبهك": 1,
 "وكإنكن": 1, "ولكأنما": 1, "حواليه": 1, "فشبهي": 1, "فكأجمعكما": 1,
 "وحينكن": 1, "فحاشانا": 1, "وحينكم": 1, "فلكاد": 1, "بنفس": 1,
 "أوكنحوها": 1, "وبغيركن": 1, "وبغيركم": 1, "أولتحتهما": 1, "ولديهما": 1,
 "أبهذا": 1, "أفعلى": 1, "أفعلي": 1, "أكعيننا": 1, "مابرح": 1,
 "ألعامتكما": 1, "ها": 1, "كإنهما": 1, "فبعدهم": 1, "ولتانك": 1,
 "هج": 1, "فلأضحى": 1, "أولعينكما": 1, "وجميع": 1, "فتجاهكما": 1,
 "أكأنما": 1, "فحوله": 1, "ل": 1, "ألحسبنا": 1, "فحولي": 1,
 "أيمينهما": 1, "وكهي": 1, "وكهو": 1, "وكنفسنا": 1, "أنفسكن": 1,
 "هل": 1, "أومعنا": 1, "فبعدها": 1, "أولعليهما": 1, "هي": 1,
 "هو": 1, "ولحار": 1, "تلكما": 1, "أوكنحوهم": 1, "أوكنحوهن": 1,
 "فلكان": 1, "أفكحسبكم": 1, "أفكحسبكن": 1, "أبهذه": 1, "نحن": 1,
 "فتلك": 1, "فشمالي": 1, "فليمينه": 1, "أب": 1, "فليمينك": 1,
 "أخ": 1, "أفحسبها": 1, "أوشبهكما": 1, "فليميني": 1, "فبينهم": 1,
 "فبينهن": 1, "وجميعه": 1, "فلأننا": 1, "أفهذه": 1, "فوقها": 1,
 "لتحتك": 1, "فلحسبهما": 1, "أبجميعهن": 1, "أبجميعهم": 1, "حولي": 1,
 "وكأقلكن": 1, "فلديها": 1, "وكأقلكم": 1, "أفهذا": 1, "فوقهن": 1,
 "فأكثركما": 1, "أبجميعها": 1, "أكأن": 1, "لنفسهم": 1, "ألعنكن": 1,
 "أي": 1, "فلسوى": 1, "أو": 1, "ألعنكم": 1, "أفحسبهن": 1,
 "حولك": 1, "أف": 1, "أفحسبهم": 1, "فلأنهما": 1, "أن": 1,
 "أم": 1, "لعين": 1, "لكيلا": 1, "بعامتهم": 1, "فبينها": 1,
 "لأولئكم": 1, "أفبمثلكما": 1, "أوجميعنا": 1, "كهذين": 1, "أفلفوقي": 1,
 "أكعينهن": 1, "فلجميعكما": 1, "ولكأنكن": 1, "ولكأنكم": 1, "فبإياهما": 1,
 "أبعينهم": 1, "وآه": 1, "غيرهم": 1, "غيرهن": 1, "وعليكم": 1,
 "وعليكن": 1, "ولارتد": 1, "وعامتهن": 1, "وعامتهم": 1, "أوككلك": 1,
 "وأبي": 1, "أوككله": 1, "وأبه": 1, "أوككلي": 1, "وأبك": 1,
 "مكانكما": 1, "فلعلى": 1, "فنفسك": 1, "ألديك": 1, "وكأولاء": 1,
 "غيرها": 1, "ألديه": 1, "أفعينه": 1, "أبغير": 1, "لعل": 1,
 "لعن": 1, "فلبعضهما": 1, "وعامتها": 1, "خلاك": 1, "خلاه": 1,
 "خلال": 1, "خلاي": 1, "أوخلفك": 1, "فإليكن": 1, "فإليكم": 1,
 "ألتحتهما": 1, "لولا": 1, "أليمينهما": 1, "فكأيكم": 1, "فكأيكن": 1,
 "أكبعضكم": 1, "فللائي": 1, "أكبعضكن": 1, "لعينهن": 1, "لعينهم": 1,
 "فبله": 1, "أولذين": 1, "أكلاهما": 1, "ليتك": 1, "وفوقهن": 1,
 "أولعلكما": 1, "ولشمالكم": 1, "ولشبهكما": 1, "أبغيرها": 1, "وبأب": 1,
 "أفبنفسنا": 1, "لعمرك": 1, "أنحوهن": 1, "أنحوهم": 1, "لعمره": 1,
 "أولسوى": 1, "أولسوي": 1, "ولشمالكن": 1, "فلخلفكما": 1, "أوإنكما": 1,
 "أفكشبههما": 1, "أوفوق": 1, "أفكنفسي": 1, "أكعامتهما": 1, "أكعامة": 1,
 "وبأي": 1, "أفكنفسك": 1, "فضمنه": 1, "وبأن": 1, "أنحوها": 1,
 "وبأيهما": 1, "فضمنك": 1, "لعينها": 1, "ولعلهما": 1, "أفكإن": 1,
 "ولأينا": 1, "فكإنكم": 1, "فبحسبكما": 1, "ضمنهن": 1, "ضمنهم": 1,
 "لتجاهكما": 1, "فحواليهن": 1, "فبكلنا": 1, "فحواليهم": 1, "بعضنا": 1,
 "آناء": 1, "أبتينك": 1, "لأكثركما": 1, "فلكليكما": 1, "وحسبهما": 1,
 "لأنكما": 1, "وكلما": 1, "لهما": 1, "فلاسيما": 1, "أولعينك": 1,
 "أكهاتين": 1, "لأبكما": 1, "وفوقه": 1, "لكنهما": 1, "وفوقك": 1,
 "أولعيني": 1, "وفوقي": 1, "ضمنها": 1, "وليمينكما": 1, "أككلكما": 1,
 "فكحيث": 1, "أولسن": 1, "أوبعينهم": 1, "أوبعينهن": 1, "أبشبهه": 1,
 "أفبإنها": 1, "أبشبهك": 1, "أفبأجمعها": 1, "أكغيرها": 1, "أبشبهي": 1,
 "فبحسبكن": 1, "فبحسبكم": 1, "أوبنفسها": 1, "فوقهم": 1, "وثمة": 1,
 "ألكلتا": 1, "أولسويهما": 1, "فبإنكما": 1, "أفبإنهم": 1, "أكغيرهم": 1,
 "أفبأجمعهن": 1, "أفبأجمعهم": 1, "أكغيرهن": 1, "أوبنفسهن": 1, "أوبنفسهم": 1,
 "وتجاه": 1, "أبدا": 1, "فإيه": 1, "أفخلفكما": 1, "سرعان": 1,
 "سوف": 1, "أبعامتكم": 1, "أبعامتكن": 1, "أفلخلفكن": 1, "أوبعينها": 1,
 "ولخلفها": 1, "أولإليهن": 1, "أولإليهم": 1, "فأمد": 1, "فخلانا": 1,
 "ونحوكن": 1, "ونحوكم": 1, "جميعهما": 1, "فشبهنا": 1, "ولكأنك": 1,
 "فأمس": 1, "بعد": 1, "وبتجاه": 1, "أوبعضكما": 1, "ولفوهن": 1,
 "ولذاك": 1, "أتينك": 1, "أوليمينه": 1, "وكعينه": 1, "وعيننا": 1,
 "وكعينك": 1, "شبهكما": 1, "أوفوقهم": 1, "وكعيني": 1, "بعض": 1,
 "فخلالهن": 1, "ولفوها": 1, "أفحسب": 1, "ولذات": 1, "أبعامته": 1,
 "وبضعها": 1, "أبعامتك": 1, "أبعامتي": 1, "أولإليها": 1, "أوسويك": 1,
 "أوسويه": 1, "أوكليكما": 1, "ألأمامنا": 1, "وبالذي": 1, "فلغيركما": 1,
 "ماذا": 1, "فلإياهما": 1, "أفشبههما": 1, "فأمامكما": 1, "أنحوكن": 1,
 "أولديكما": 1, "أففينا": 1, "ألكليهما": 1, "أفكلاهما": 1, "فغير": 1,
 "فحاشاها": 1, "أفلنفسه": 1, "أولذلكم": 1, "أفلنفسك": 1, "أولذلكن": 1,
 "بأكثرهم": 1, "أوعامته": 1, "أفكغيركم": 1, "بأكثرهن": 1, "أفكغيركن": 1,
 "ولتلقاءكما": 1, "فببعض": 1, "وذلكما": 1, "وجميعكم": 1, "وجميعكن": 1,
 "لعمرهما": 1, "فلكنهم": 1, "أولعله": 1, "أولعلك": 1, "أوبضعها": 1,
 "كأيكما": 1, "أولعلي": 1, "أولعلى": 1, "أفكعينكم": 1, "فحاشاهم": 1,
 "فحاشاهن": 1, "أفكعينكن": 1, "لكأنكن": 1, "أفأجمعي": 1, "فأقلها": 1,
 "فأضحى": 1, "أفأجمعك": 1, "فلإلينا": 1, "أفأجمعه": 1, "وخلالكم": 1,
 "أفكمثلهما": 1, "وخلالكن": 1, "وبفوكما": 1, "الكفو": 1, "حمها": 1,
 "لراح": 1, "فككليكما": 1, "فهذه": 1, "لكرب": 1, "فهذي": 1,
 "ولدننا": 1, "أكإن": 1, "وليست": 1, "فهذا": 1, "وليسا": 1,
 "فأقلهم": 1, "فأقلهن": 1, "ألكأنك": 1, "وكأبكم": 1, "وكأبكن": 1,
 "ألكأني": 1, "أفكشبهكن": 1, "أفكشبهكم": 1, "أفبشبهنا": 1, "وريث": 1,
 "كما": 1, "أوكعيني": 1, "ألعينه": 1, "وحينهن": 1, "أأجمع": 1,
 "وبطآن": 1, "ألعينك": 1, "ولكليكما": 1, "أوكعينك": 1, "ألعيني": 1,
 "أفلعامتي": 1, "فبأيكما": 1, "فكأخي": 1, "أفبسويهن": 1, "أفهاتان": 1,
 "فأيهن": 1, "فأيهم": 1, "فلكأنكما": 1, "كهذا": 1, "بكليكما": 1,
 "أومنكم": 1, "ولعامتها": 1, "أفبسوينا": 1, "وتلقاءكما": 1, "ألهؤلاء": 1,
 "كهذي": 1, "أفأمامكما": 1, "عاد": 1, "فأيها": 1, "كهذه": 1,
 "فبنحونا": 1, "ولعامتهم": 1, "فونا": 1, "فلأينا": 1, "فلنحوكن": 1,
 "وشبهكم": 1, "وشبهكن": 1, "فلنحوكم": 1, "أبسوينا": 1, "أفلعن": 1,
 "وحينها": 1, "أفلعل": 1, "فلحسبنا": 1, "جميعكم": 1, "جميعكن": 1,
 "فبمثل": 1, "وكعيننا": 1, "فبأجمعها": 1, "أونحوهم": 1, "أفكسويها": 1,
 "أوبعامتنا": 1, "بته": 1, "لأيكما": 1, "أفلكليهما": 1, "بتي": 1,
 "أولغيري": 1, "وبإنهما": 1, "أولغيرك": 1, "ولشبههم": 1, "أولغيره": 1,
 "أفكأجمعهن": 1, "أفهؤلاء": 1, "فشمال": 1, "فلتحتنا": 1, "لأوشك": 1,
 "بضعكما": 1, "أولأمامهما": 1, "فبتين": 1, "عداكما": 1, "فبأجمعهم": 1,
 "أفلنحونا": 1, "فبأجمعهن": 1, "أفكأن": 1, "أفكسويهم": 1, "أفكسويهن": 1,
 "ألديكم": 1, "أكجميعنا": 1, "ألديكن": 1, "أبشبهكم": 1, "فنفسي": 1,
 "فنفسه": 1, "ففو": 1, "ففي": 1, "أفكذين": 1, "ساءما": 1,
 "أليمينه": 1, "فلأبنا": 1, "أمعكما": 1, "ح": 1, "وشبههما": 1,
 "ولديه": 1, "وكجميعكما": 1, "أوفوقها": 1, "فتلقاءهما": 1, "وبأكثركما": 1,
 "لكنكن": 1, "لكنكم": 1, "أفنحوهن": 1, "لشمالكن": 1, "ولديك": 1,
 "بنفسكم": 1, "معكم": 1, "بنفسكن": 1, "أولخلف": 1, "تحول": 1,
 "وكحيث": 1, "أفلخلفكم": 1, "فبسويكن": 1, "فبسويكم": 1, "أوفوقهن": 1,
 "فصار": 1, "أأجمعهما": 1, "ولتلكم": 1, "أقلما": 1, "أوكعامة": 1,
 "أكحسب": 1, "أوككلكما": 1, "وكأبي": 1, "وكأبه": 1, "وكأبك": 1,
 "فإلا": 1, "فهنالك": 1, "كحمنا": 1, "وكتانك": 1, "كغيري": 1,
 "أبنفسكن": 1, "كغيره": 1, "أومنهما": 1, "أومنكن": 1, "كغيرك": 1,
 "ولمثلك": 1, "وبنفسي": 1, "ولمثله": 1, "أفلمثلها": 1, "ولمثلي": 1,
 "وبنفسك": 1, "وبنفسه": 1, "أوعامتك": 1, "أفلسويهم": 1, "أفلسويهن": 1,
 "أليمينك": 1, "أفلمثلهم": 1, "ألخلف": 1, "وبإننا": 1, "أفلمثلهن": 1,
 "أليميني": 1, "ألنحوكم": 1, "بتلك": 1, "أولفيي": 1, "أفجميع": 1,
 "أفلسويها": 1, "فإلي": 1, "فإلى": 1, "أعنكما": 1, "أوحسبهما": 1,
 "فوهما": 1, "ألقلما": 1, "وي": 1, "وأقلها": 1, "فلكم": 1,
 "أأمامهم": 1, "أأمامهن": 1, "أوإليهن": 1, "أوإليهم": 1, "وبإياكن": 1,
 "وبإياكم": 1, "طالما": 1, "أفعينك": 1, "بيني": 1, "ألعنهما": 1,
 "فبسويكما": 1, "ألحسبهم": 1, "فهنا": 1, "ألحسبهن": 1, "فبغيره": 1,
 "ولأيي": 1, "فبغيرك": 1, "ومعنا": 1, "ولأنتن": 1, "ولأنتم": 1,
 "ولأيك": 1, "فبغيري": 1, "ولأيه": 1, "ولتين": 1, "ألحسبها": 1,
 "ولتحتكما": 1, "لذانك": 1, "أفمعها": 1, "أفشمالهما": 1, "فكأكثرنا": 1,
 "أحسبي": 1, "أأجمعنا": 1, "وأقلهم": 1, "أأمامها": 1, "أحسبك": 1,
 "أحسبه": 1, "فبتلقاءها": 1, "علي": 1, "على": 1, "وبأخهما": 1,
 "فمابرح": 1, "علق": 1, "أفنفسكم": 1, "أفنفسكن": 1, "فبتجاههما": 1,
 "أشبهنا": 1, "أغيرها": 1, "أفكذلكما": 1, "فبمثلنا": 1, "أيي": 1,
 "قام": 1, "أأنت": 1, "وبأقلهما": 1, "أيك": 1, "وعينكما": 1,
 "أين": 1, "أيه": 1, "وبعدي": 1, "وبعدك": 1, "فذين": 1,
 "وكمن": 1, "ففوقهما": 1, "أوعامتي": 1, "كأبهن": 1, "أيا": 1,
 "أهم": 1, "كأبهم": 1, "أولنحو": 1, "فبهاتي": 1, "أفلكلهما": 1,
 "فذيت": 1, "أولنحن": 1, "وحاشاها": 1, "فبهاته": 1, "وكما": 1,
 "فبتلقاءهم": 1, "فبتلقاءهن": 1, "أوبمثلهما": 1, "وبتلقاءكم": 1, "وبتلقاءكن": 1,
 "كحمهما": 1, "وحمنا": 1, "أغيرهن": 1, "أغيرهم": 1, "ولمثلكما": 1,
 "أفعني": 1, "أفعن": 1, "لعاد": 1, "أفعنك": 1, "ألفينا": 1,
 "أفعنه": 1, "أهناك": 1, "ولسويهما": 1, "وبينكن": 1, "أفلكأن": 1,
 "أفلإليهم": 1, "بتلقاءهما": 1, "أببعضي": 1, "أفمعهم": 1, "أببعضه": 1,
 "وكتجاهكن": 1, "أببعضك": 1, "لعامتها": 1, "أفمعهن": 1, "فبحمكما": 1,
 "خلفها": 1, "وبكلك": 1, "وذلك": 1, "وبكله": 1, "وبكلي": 1,
 "أفعيني": 1, "وبسويهما": 1, "لعامتهن": 1, "لعامتهم": 1, "أفشبههن": 1,
 "شمالكما": 1, "أفلحسب": 1, "أفعنهما": 1, "خلفهن": 1, "خلفهم": 1,
 "وليمينهما": 1, "أوكشبهكن": 1, "أوكشبهكم": 1, "أوكسوى": 1, "أوكسوي": 1,
 "أولغيركم": 1, "وكنحونا": 1, "أولغيركن": 1, "وبشبهكم": 1, "منها": 1,
 "أوبغير": 1, "أفبغيره": 1, "أفبغيري": 1, "لنحوهما": 1, "وحوله": 1,
 "وتلك": 1, "فتينك": 1, "بالألى": 1, "أكأنها": 1, "عامتكن": 1,
 "عامتكم": 1, "أإننا": 1, "أوبجميعهما": 1, "عامتي": 1, "وكتلكم": 1,
 "عامته": 1, "أوتلك": 1, "عامتك": 1, "أفأجمع": 1, "إيه": 1,
 "وللتيا": 1, "ولفوكم": 1, "ولفوكن": 1, "ألعلهما": 1, "أجمعنا": 1,
 "ومثلكن": 1, "ومثلكم": 1, "فبأب": 1, "فجميعكما": 1, "ألسوينا": 1,
 "وللتين": 1, "أكليكما": 1, "أفبجميع": 1, "بعامتهما": 1, "فلعلي": 1,
 "فإيانا": 1, "أوليمينكما": 1, "أومهما": 1, "أوتحتكما": 1, "ككلهما": 1,
 "وبيننا": 1, "أمثلكما": 1, "أفكعينهم": 1, "أفكعينهن": 1, "أوشمالنا": 1,
 "لشبهك": 1, "ويمينهما": 1, "لشبهه": 1, "لشبهي": 1, "أومنها": 1,
 "أفبعينك": 1, "وعل": 1, "فمتى": 1, "الفبحم": 1, "أوعنهما": 1,
 "راح": 1, "حاشا": 1, "أولأجمعهم": 1, "أولأجمعهن": 1, "أوبكلهم": 1,
 "فكعامة": 1, "ألكأنهم": 1, "بعدكما": 1, "ألهنالك": 1, "لعله": 1,
 "بحمنا": 1, "أولأجمعها": 1, "وكأجمعكما": 1, "فلفوكما": 1, "أفكعينها": 1,
 "وشمالكن": 1, "وشمالكم": 1, "فالذين": 1, "فشمالكم": 1, "ليست": 1,
 "وبعامتنا": 1, "لرجع": 1, "فككلهما": 1, "أفكغيره": 1, "أفكغيرك": 1,
 "فكإننا": 1, "وككلي": 1, "أفكغيري": 1, "أفلشبهنا": 1, "أكثرهما": 1,
 "أفكغيرها": 1, "فكإن": 1, "أفكسوينا": 1, "بغيري": 1, "بكن": 1,
 "بكل": 1, "بكم": 1, "بغيرك": 1, "بغيره": 1, "هؤلاء": 1,
 "ولمنهما": 1, "أفكغيرهم": 1, "أفكغيرهن": 1, "أككلكم": 1, "أككلكن": 1,
 "كنحوكن": 1, "كنحوكم": 1, "أفتلكما": 1, "مادام": 1, "أولمعكن": 1,
 "أولمعكم": 1, "أصلا": 1, "أولفوقك": 1, "أوكنحوكم": 1, "أوكنحوكن": 1,
 "فلعليكم": 1, "أولذي": 1, "فبك": 1, "عداكن": 1, "عداكم": 1,
 "فبي": 1, "وبأبهما": 1, "أفبغيرها": 1, "ألأمام": 1, "أوكإنهما": 1,
 "فبشبههما": 1, "وأقلهن": 1, "فبينكن": 1, "بإيانا": 1, "أبشبه": 1,
 "وكأقلها": 1, "ويكأنهم": 1, "ويكأنهن": 1, "أفأمامكن": 1, "ص": 1,
 "أفأمامها": 1, "كشبهنا": 1, "أولشمالكم": 1, "فبعدكم": 1, "أوكأنكما": 1,
 "فخلاهما": 1, "وأنهما": 1, "وكأقلهن": 1, "فلمع": 1, "وكأقلهم": 1,
 "أوبسويه": 1, "فلأبي": 1, "فكتلقاءك": 1, "أوبسويك": 1, "فكتلقاءه": 1,
 "فلأبك": 1, "أخنا": 1, "فلأبه": 1, "ألسن": 1, "كأنما": 1,
 "أوبغيره": 1, "أفكأننا": 1, "أوبغيرك": 1, "أفلمعهما": 1, "لنفس": 1,
 "فبخ": 1, "أوبغيري": 1, "أفبغيرهن": 1, "وا": 1, "لهناك": 1,
 "فبس": 1, "أوإني": 1, "أفحسبكن": 1, "أفحسبكم": 1, "ألستما": 1,
 "فساءما": 1, "أوإنه": 1, "فكأبكن": 1, "أولمنكم": 1, "أولمنكن": 1,
 "فكأبكم": 1, "أفلتلكما": 1, "لعنه": 1, "فلكنك": 1, "لعنك": 1,
 "فلكنه": 1, "أفكأنه": 1, "وأقبل": 1, "أفلعنهما": 1, "أفكأنك": 1,
 "أفببعضهما": 1, "أجميعهم": 1, "أفكأني": 1, "لتلقاءنا": 1, "بعدهما": 1,
 "أفلإنها": 1, "كذلكما": 1, "أوكهنالك": 1, "كأولالك": 1, "وأبكما": 1,
 "أوككليهما": 1, "أفلإنهن": 1, "أفلإنهم": 1, "أولقلما": 1, "وصار": 1,
 "فلكليهما": 1, "لكما": 1, "لعلي": 1, "وبإن": 1, "ألبعض": 1,
 "بأنهما": 1, "فبنا": 1, "أجميعها": 1, "أفكهما": 1, "وعنهن": 1,
 "أفكسويهما": 1, "فكأقلي": 1, "فبسويها": 1, "فكأقلك": 1, "فكأقله": 1,
 "وغيركما": 1, "فمن": 1, "فمكانكم": 1, "فلمنكم": 1, "فلمنكن": 1,
 "لكنها": 1, "فسويهما": 1, "لعليكم": 1, "لعليكن": 1, "لأكثر": 1,
 "أوكمثلنا": 1, "وحولكن": 1, "وليميننا": 1, "وحولكم": 1, "أوعلينا": 1,
 "لكنهن": 1, "لكنهم": 1, "فلإليكما": 1, "فمذ": 1, "وكعامتك": 1,
 "فبسويهن": 1, "وكعامته": 1, "فبسويهم": 1, "فمع": 1, "وكعامتي": 1,
 "أوبهاتي": 1, "عليكما": 1, "فما": 1, "أوبهاته": 1, "أوكأولئكم": 1,
 "أأنا": 1, "وعند": 1, "جلل": 1, "أوكذانك": 1, "وفونا": 1,
 "كأقله": 1, "فلعامتكن": 1, "كأقلك": 1, "كأقلي": 1, "حين": 1,
 "أفلعلي": 1, "أولهاتي": 1, "أفبإني": 1, "أفلعله": 1, "أفبإنه": 1,
 "أولهاته": 1, "أفلعلك": 1, "أفبإنك": 1, "وكتلقاءكما": 1, "بغيركما": 1,
 "فحواليكن": 1, "فحواليكم": 1, "فببعضكن": 1, "أفلفيك": 1, "فببعضكم": 1,
 "أفبنفسك": 1, "أفلفيه": 1, "أفبحسب": 1, "أفلأجمعنا": 1, "وبعامتي": 1,
 "وبعامته": 1, "فالآن": 1, "حيث": 1, "أوبهنالك": 1, "أفبنفسه": 1,
 "وعداي": 1, "أولنفسهما": 1, "فلعنكن": 1, "فعداكن": 1, "فلجميعي": 1,
 "ولأكثركما": 1, "وعنه": 1, "أوذواتي": 1, "وبعده": 1, "فكأبهما": 1,
 "أفغيركما": 1, "وهاتان": 1, "أبعامتهم": 1, "أبعامتهن": 1, "أفلعينكم": 1,
 "أفلعينكن": 1, "نفسي": 1, "فبضعك": 1, "لتلكما": 1, "فبضعه": 1,
 "نفسك": 1, "لإيانا": 1, "نفسه": 1, "وأمامكما": 1, "فبكلهما": 1,
 "فيمين": 1, "أكبعضهما": 1, "أفبعينهما": 1, "فكإني": 1, "ألهاتين": 1,
 "فنفسنا": 1, "أفككليكما": 1, "أمامكما": 1, "أوبكلكما": 1, "أفبأجمعكن": 1,
 "أفبأجمعكم": 1, "كأجمعه": 1, "معك": 1, "فلأقلهما": 1, "أوبنفسكن": 1,
 "كأجمعك": 1, "معه": 1, "أوبنفسكم": 1, "أبعامتها": 1, "معي": 1,
 "كأجمعي": 1, "فحسبهما": 1, "أفعلينا": 1, "فللواتي": 1, "فكعامتنا": 1,
 "معاذ": 1, "بإننا": 1, "وبتلقاءها": 1, "أفبكلكما": 1, "أفبعينهم": 1,
 "أفبعينهن": 1, "فلأبهما": 1, "وكعامتهن": 1, "فبعدكن": 1, "أفلأمامي": 1,
 "وكعامتهم": 1, "أفلأمامك": 1, "فكنفسهما": 1, "ألشبههن": 1, "ألشبههم": 1,
 "فلكأنكن": 1, "وحسبك": 1, "وحسبه": 1, "ألحسبكم": 1, "ألحسبكن": 1,
 "ألشبهها": 1, "انقلب": 1, "وكأيهما": 1, "وبتلقاءهم": 1, "وبتلقاءهن": 1,
 "أفبجميعكما": 1, "فلقام": 1, "أفبعينها": 1, "أولعني": 1, "فلتلقاء": 1,
 "وانبرى": 1, "أمنكما": 1, "وكإنها": 1, "أفكجميع": 1, "فكعامتهن": 1,
 "أوكشبهها": 1, "حينها": 1, "فكجميعنا": 1, "وبشبهها": 1, "فلعمرها": 1,
 "أوبأجمعه": 1, "أفعين": 1, "أوبأجمعي": 1, "ولكليهما": 1, "وبينهن": 1,
 "أفبذين": 1, "بفو": 1, "أفلإليكن": 1, "فكأي": 1, "أوهنالك": 1,
 "فكأن": 1, "أشمال": 1, "فمعاذكما": 1, "أبأولئك": 1, "فبتجاهها": 1,
 "ومننا": 1, "فكأخ": 1, "فكأب": 1, "لعامتكن": 1, "لعامتكم": 1,
 "فبتجاههن": 1, "فبتجاههم": 1, "فكشبهنا": 1, "أوكشبههن": 1, "أوكشبههم": 1,
 "وبشبههم": 1, "فلعمرهم": 1, "فلعمرهن": 1, "وبشبههن": 1, "بهؤلاء": 1,
 "أفعننا": 1, "وبينها": 1, "ولإنهم": 1, "ألجميعكن": 1, "فبنفس": 1,
 "ألجميعكم": 1, "وكأكثرنا": 1, "لغيرهما": 1, "وكأبها": 1, "ويمينهن": 1,
 "وخلالهم": 1, "وبأننا": 1, "وخلالهن": 1, "سبحانهما": 1, "فكفوكم": 1,
 "فكفوكن": 1, "وبعيني": 1, "أخلف": 1, "وبعينك": 1, "وبعينه": 1,
 "وخلالها": 1, "أكذواتي": 1, "ولشبههما": 1, "فبذلكم": 1, "فبذلكن": 1,
 "هيهات": 1, "وضحوة": 1, "وكعامتهما": 1, "أوبكن": 1, "فجير": 1,
 "أفلإليهن": 1, "لتلكم": 1, "أوبكم": 1, "أوأنتن": 1, "أوأنتم": 1,
 "فأقلكم": 1, "وبينكم": 1, "أفلعامتكما": 1, "فأقلكن": 1, "لدنهما": 1,
 "فتي": 1, "وكأبهم": 1, "وكأبهن": 1, "نخ": 1, "فته": 1,
 "أوكبعضنا": 1, "فانبرى": 1, "وشبهها": 1, "أفكنفسهما": 1, "أفتلك": 1,
 "فكبعضكما": 1, "أبتلكما": 1, "أوبعينهما": 1, "فعاد": 1, "آه": 1,
 "أكأنهن": 1, "لاستحال": 1, "آي": 1, "ولعلكما": 1, "أوبأجمعها": 1,
 "فأيكن": 1, "وكحمنا": 1, "فأيكم": 1, "كأقلكن": 1, "وبسويه": 1,
 "وكتجاهكم": 1, "شمالكم": 1, "وبسويك": 1, "أشمالنا": 1, "وكرب": 1,
 "أوبأجمعهم": 1, "أوبأجمعهن": 1, "ببعضكم": 1, "وبأيكما": 1, "أولتحتكما": 1,
 "وشبههم": 1, "وشبههن": 1, "أكعامتكما": 1, "أفلإن": 1, "الفلأب": 1,
 "لشرع": 1, "الفلأخ": 1, "أفكإنك": 1, "فبأيك": 1, "بهذا": 1,
 "فخلاي": 1, "فبأيه": 1, "فهو": 1, "فخلاه": 1, "فهن": 1,
 "فهم": 1, "فبأيي": 1, "فخلاك": 1, "أوغيرهما": 1, "لأنت": 1,
 "ولمني": 1, "فلأنت": 1, "و": 1, "إذ": 1, "فكيت": 1,
 "لفيها": 1, "فلانبرى": 1, "لكنكما": 1, "ألسنا": 1, "أولعنكم": 1,
 "أولعنكن": 1, "فبماذا": 1, "أفمهما": 1, "بإنه": 1, "لفيهم": 1,
 "لفيهن": 1, "ولتجاههما": 1, "وتارة": 1, "فقط": 1, "أكحسبنا": 1,
 "معكما": 1, "أولمثلي": 1, "أوإليه": 1, "فعسى": 1, "أولمثلك": 1,
 "أوإليك": 1, "أولمثله": 1, "لأنه": 1, "حمنا": 1, "بهذه": 1,
 "لأنك": 1, "إي": 1, "أومنكما": 1, "بهذي": 1, "إن": 1,
 "لأني": 1, "فبعينكما": 1, "أإليكما": 1, "أوكنفسكن": 1, "أوكنفسكم": 1,
 "شرع": 1, "ونفسنا": 1, "ولنفسهم": 1, "ولنفسهن": 1, "ولعيننا": 1,
 "فكغيرها": 1, "بعضي": 1, "فبضعهما": 1, "بعضك": 1, "وهؤلاء": 1,
 "بعضه": 1, "ولكلتا": 1, "أتحتها": 1, "فبنفسي": 1, "أفلعنه": 1,
 "أبنحوهم": 1, "أبنحوهن": 1, "فبنفسك": 1, "فبنفسه": 1, "أفلعني": 1,
 "وكته": 1, "وكلكم": 1, "وكلكن": 1, "فبأولئكم": 1, "أولنا": 1,
 "لمنكم": 1, "أولتحتكم": 1, "وكتي": 1, "وكإني": 1, "بأنك": 1,
 "بأنه": 1, "أبنحوها": 1, "وكإنك": 1, "بأني": 1, "وكإنه": 1,
 "نحوي": 1, "أفبهي": 1, "كمثلنا": 1, "نحوك": 1, "فبهؤلاء": 1,
 "نحوه": 1, "فلأنكما": 1, "أفببعضي": 1, "فلأيكما": 1, "أوكعينكن": 1,
 "وكأخنا": 1, "أولديكن": 1, "فكلكم": 1, "فكلكن": 1, "أفببعضه": 1,
 "فتانك": 1, "فكغيرهن": 1, "فكغيرهم": 1, "أعامتكما": 1, "وبضعهن": 1,
 "أتحتهم": 1, "أتحتهن": 1, "أفيكما": 1, "حار": 1, "أوكعين": 1,
 "وأيكن": 1, "وأيكم": 1, "أفبكلتا": 1, "أفبتينك": 1, "عن": 1,
 "ألغيرنا": 1, "فبنحوه": 1, "فكيف": 1, "فبنحوك": 1, "أبنفسهم": 1,
 "كمثلكما": 1, "فكتلك": 1, "كحسبها": 1, "أفلعلها": 1, "فبكليهما": 1,
 "فبنحوي": 1, "أفلسويكم": 1, "أفلسويكن": 1, "بجميعنا": 1, "ذلكم": 1,
 "أوكذي": 1, "حينكم": 1, "أبنفسها": 1, "وبأخكما": 1, "كحسبهن": 1,
 "أبهنالك": 1, "كحسبهم": 1, "أولكليكما": 1, "أوكذا": 1, "أفبغيرك": 1,
 "أفلمثلكم": 1, "لأبنا": 1, "فبتجاهكما": 1, "حاي": 1, "وبشبهكن": 1,
 "أأجمعك": 1, "فإليكما": 1, "أففوقهما": 1, "كرب": 1, "أفلحسبكم": 1,
 "أفلحسبكن": 1, "وحذار": 1, "وبحمك": 1, "ولحمكم": 1, "وبحمه": 1,
 "فبضع": 1, "وبحمي": 1, "أوهاته": 1, "أبكلهن": 1, "أبكلهم": 1,
 "ولحمكن": 1, "بأولئكم": 1, "أوذلك": 1, "وبإياهن": 1, "أوهاتي": 1,
 "وبإياهم": 1, "فلكلكم": 1, "فلكلكن": 1, "ألخلفنا": 1, "أوكلكما": 1,
 "أبكلها": 1, "أفلكلتا": 1, "أوعن": 1, "أولنفسنا": 1, "وبإياها": 1,
 "فكنفسي": 1, "ولديكما": 1, "فكنفسك": 1, "فكنفسه": 1, "لحسبكن": 1,
 "لحسبكم": 1, "أفبنحو": 1, "حاشانا": 1, "فخلالي": 1, "فمكانكما": 1,
 "فخلاله": 1, "فخلالك": 1, "كحمكم": 1, "أنفس": 1, "وكأخهما": 1,
 "وأقلكن": 1, "أبشبههما": 1, "أوكأجمع": 1, "أكسوى": 1, "أكسوي": 1,
 "أفلنحوها": 1, "وأنها": 1, "فكنحوهن": 1, "فكنحوهم": 1, "أسويهما": 1,
 "فعليك": 1, "فعليه": 1, "وبحسبي": 1, "لعليها": 1, "ولآض": 1,
 "لإياكما": 1, "وبحسبك": 1, "ألغيري": 1, "وبحسبه": 1, "فلأخكما": 1,
 "لعليهم": 1, "لعليهن": 1, "فلعامتها": 1, "كذواتي": 1, "هاؤم": 1,
 "فكهنالك": 1, "ألشمالهم": 1, "فبأخنا": 1, "وأنهن": 1, "وأنهم": 1,
 "فكإنكما": 1, "فكنحوها": 1, "أبنحو": 1, "وعين": 1, "فلأنك": 1,
 "ككلي": 1, "أفلعينهم": 1, "أفلعينهن": 1, "ككلك": 1, "أولشبهكما": 1,
 "ككله": 1, "ألهناك": 1, "أفكإنها": 1, "فأقلكما": 1, "ألتحتي": 1,
 "فلئن": 1, "أفكهنالك": 1, "بأبنا": 1, "الذين": 1, "فلفوقكما": 1,
 "فحرى": 1, "بعدي": 1, "فببعضهن": 1, "فببعضهم": 1, "وللذي": 1,
 "أولعليكما": 1, "أفكنحو": 1, "حاشاكما": 1, "وخلاك": 1, "لتجاهنا": 1,
 "أفلعينها": 1, "أفبشبههما": 1, "أوكهؤلاء": 1, "أوكحسبهما": 1, "أفبعامتكم": 1,
 "بتين": 1, "أبأجمعنا": 1, "أفكإنهم": 1, "أفكإنهن": 1, "ولعامة": 1,
 "أنفسك": 1, "الفكفو": 1, "ألعلنا": 1, "عامتهم": 1, "ولجميعهما": 1,
 "أليسا": 1, "وضمنهن": 1, "لهن": 1, "وأنا": 1, "لهم": 1,
 "لهي": 1, "حسبكما": 1, "لهو": 1, "واللاتي": 1, "إني": 1,
 "فسبحاني": 1, "فسبحانه": 1, "إنك": 1, "فكحمكما": 1, "إنه": 1,
 "أتحتكما": 1, "لها": 1, "لهب": 1, "ألذواتي": 1, "فلآض": 1,
 "فبأبنا": 1, "بأخهما": 1, "ولكما": 1, "أوعينكما": 1, "فكيفما": 1,
 "عامتها": 1, "فقبل": 1, "أبكلتا": 1, "أولحسبكم": 1, "أولحسبكن": 1,
 "بينكم": 1, "بينكن": 1, "أوكل": 1, "ومثلها": 1, "لعلنا": 1,
 "أولأجمعكم": 1, "أولأجمعكن": 1, "أفبنحوهم": 1, "أفبنحوهن": 1, "ومثلهن": 1,
 "ومثلهم": 1, "ولمثل": 1, "لشمالكما": 1, "أفبنحوها": 1, "وأيكما": 1,
 "فلكأنما": 1, "وكأقلي": 1, "وكأقله": 1, "وكأقلك": 1, "أكهؤلاء": 1,
 "فآناء": 1, "أوكعامتكما": 1, "ولذلك": 1, "وشمالهم": 1, "أوإلي": 1,
 "أوإلى": 1, "فلهذه": 1, "فلأخذ": 1, "وأيهما": 1, "لكلنا": 1,
 "فأبي": 1, "فأبه": 1, "ألجميعهن": 1, "فلهذي": 1, "فأبك": 1,
 "لهاتي": 1, "لهاته": 1, "بأخهن": 1, "بأخهم": 1, "لحمه": 1,
 "فكفوهن": 1, "فلهن": 1, "لحمك": 1, "ولأمسى": 1, "فلهم": 1,
 "بتجاهي": 1, "فلهو": 1, "لحمي": 1, "فلشمال": 1, "ولعليكما": 1,
 "فبالألاء": 1, "وبنحو": 1, "ألجميعه": 1, "أولكأني": 1, "ألجميعك": 1,
 "فليمين": 1, "وبتجاههم": 1, "أولكأنك": 1, "ألجميعي": 1, "أولكأنه": 1,
 "فكفوها": 1, "فلها": 1, "فلهب": 1, "وبتجاههن": 1, "ولعمرك": 1,
 "بنحوك": 1, "فلأخك": 1, "ولعمره": 1, "بنحوه": 1, "فلأخه": 1,
 "أوكغيركم": 1, "بنحوي": 1, "ولعمري": 1, "أفأنت": 1, "وكفونا": 1,
 "فلهذا": 1, "وبغيركما": 1, "ولتجاهي": 1, "ولتجاهه": 1, "ولتجاهك": 1,
 "ألجميعها": 1, "وكسويه": 1, "وكسويك": 1, "ولسويهن": 1, "أأولالك": 1,
 "لطفق": 1, "وإننا": 1, "أفكهؤلاء": 1, "أولفوقكم": 1, "وبذواتي": 1,
 "وأخذ": 1, "ألفوقهما": 1, "أبضعهن": 1, "أوبإنهن": 1, "وبتلقاءك": 1,
 "وبتلقاءه": 1, "وبتلقاءي": 1, "وأكثركما": 1, "أفبكلنا": 1, "أفبكل": 1,
 "أفبكم": 1, "وأخك": 1, "وأخه": 1, "أعنك": 1, "وللائي": 1,
 "فكأيي": 1, "بفوي": 1, "نحونا": 1, "بفوه": 1, "فكأيه": 1,
 "أوبحسبنا": 1, "بفوك": 1, "فكأيك": 1, "فبعامتك": 1, "ليمينهن": 1,
 "وإي": 1, "فبعامته": 1, "وأمد": 1, "ألكما": 1, "أفكتلك": 1,
 "فبعامتي": 1, "وأخكما": 1, "فبعامتنا": 1, "أولفيكم": 1, "أولفيكن": 1,
 "وعنكم": 1, "وكتلقاءهما": 1, "فلعامتي": 1, "فلعامته": 1, "فكأبهن": 1,
 "أولمنهم": 1, "فلعامتك": 1, "فكأبهم": 1, "فلكأني": 1, "كأقلها": 1,
 "أجميعكن": 1, "أجميعكم": 1, "أوبهذا": 1, "أسوي": 1, "فلكأنك": 1,
 "كعامتها": 1, "فلكأنه": 1, "أسوى": 1, "كأقلهن": 1, "كأقلهم": 1,
 "أوبهذه": 1, "كعامتهم": 1, "فبيد": 1, "ألعنه": 1, "أمننا": 1,
 "لقلما": 1, "أفلإنكن": 1, "أفلإنكم": 1, "فثمة": 1, "فكجميعهما": 1,
 "أفأمامكم": 1, "فكأبها": 1, "أولمنها": 1, "أفلشبهي": 1, "ألمننا": 1,
 "وكنحو": 1, "أفجميعنا": 1, "أفلشبهك": 1, "كبعض": 1, "أفلشبهه": 1,
 "فبهاتين": 1, "وفيكم": 1, "ولحرى": 1, "وفيكن": 1, "كنفس": 1,
 "أولعامتكما": 1, "ولأبهن": 1, "أولإلي": 1, "ولأبهم": 1, "فبشبهه": 1,
 "فكنفسنا": 1, "فلأخهن": 1, "فلأخهم": 1, "فلمنهم": 1, "وحولها": 1,
 "فلمنهن": 1, "ع": 1, "أوبذواتي": 1, "أوبغيرهما": 1, "بسويكما": 1,
 "ولأبها": 1, "فلأخها": 1, "ولعمرنا": 1, "أيمينهم": 1, "وحولهن": 1,
 "أفلإليه": 1, "فلمنها": 1, "وحولهم": 1, "بكلكما": 1, "أكلنا": 1,
 "وعن": 1, "أوحسب": 1, "لهذين": 1, "أفلإلي": 1, "أفلإلى": 1,
 "أفلأمامنا": 1, "وشمالك": 1, "فحينكم": 1, "أفكل": 1, "فحينكن": 1,
 "أفمما": 1, "البحم": 1, "كغيرنا": 1, "أولإلى": 1, "أفلسن": 1,
 "وغداة": 1, "فعدانا": 1, "لمعهن": 1, "وأيهن": 1, "وأيهم": 1,
 "لمعهم": 1, "فنحن": 1, "فنحو": 1, "كبعضنا": 1, "ولدن": 1,
 "فأنتن": 1, "أنهما": 1, "وممن": 1, "وأيها": 1, "لمعها": 1,
 "فحسب": 1, "أكعامتهم": 1, "أوبأولئك": 1, "كحسبكن": 1, "ومما": 1,
 "كحسبكم": 1, "أوبسويكما": 1, "ألشمالنا": 1, "أنحوه": 1, "فتحول": 1,
 "لستما": 1, "لعمر": 1, "بتجاه": 1, "أولجميعكما": 1, "لأخكن": 1,
 "لأخكم": 1, "لحسبها": 1, "أكنفس": 1, "أوإنها": 1, "أفلحسبهم": 1,
 "أفلحسبهن": 1, "لمن": 1, "لعامتهما": 1, "فكذانك": 1, "أبكلكن": 1,
 "كاللائي": 1, "وكذينك": 1, "ألمنكن": 1, "أمعه": 1, "الولأب": 1,
 "أوحسبكم": 1, "ألمنكم": 1, "أوحسبكن": 1, "أوجميعي": 1, "ليمينكم": 1,
 "ليمينكن": 1, "أوجميعك": 1, "فبغيركما": 1, "كنحو": 1, "أوجميعه": 1,
 "لنحوكن": 1, "لنحوكم": 1, "لبعضي": 1, "ولتجاهنا": 1, "لأننا": 1,
 "لبعضه": 1, "لبعضك": 1, "فلكلها": 1, "لمع": 1, "ألفوقه": 1,
 "ألفوقي": 1, "أوكبعضهما": 1, "لحسبهن": 1, "لحسبهم": 1, "وخلاي": 1,
 "أوإنهن": 1, "أوإنهم": 1, "ألبعضكما": 1, "أفلحسبها": 1, "أوبنفسهما": 1,
 "وخلاه": 1, "وخلال": 1, "أونحوكما": 1, "لشبه": 1, "أولمثلهما": 1,
 "فحسبنا": 1, "ألتلك": 1, "بتينك": 1, "أذلكم": 1, "أفبعينكم": 1,
 "أفبعينكن": 1, "فحولها": 1, "آ": 1, "أكتلكما": 1, "ولأقلكما": 1,
 "فلمثلي": 1, "كمثلي": 1, "وبتلكما": 1, "ولإلى": 1, "كمثله": 1,
 "فلمثلك": 1, "ألشبهكن": 1, "كمثلك": 1, "فلمثله": 1, "ألشبهكم": 1,
 "فحولهم": 1, "أيمين": 1, "الفبأخ": 1, "الفبأب": 1, "أفنفس": 1,
 "أوكمثل": 1, "أوفوقكما": 1, "فلكأنها": 1, "أبهاتين": 1, "كذين": 1,
 "أوبكلك": 1, "أفكبعضكم": 1, "ألفوقكم": 1, "أوبكله": 1, "أوبكلي": 1,
 "أفشمالكما": 1, "ولذين": 1, "وعندنا": 1, "وعامة": 1, "أوككلهن": 1,
 "أوككلهم": 1, "أكمثلهما": 1, "فنحوهما": 1, "طاق": 1, "بكلهم": 1,
 "بكلهن": 1, "لعنهما": 1, "أله": 1, "ولأكثرهما": 1, "فلتلقاءكما": 1,
 "ذينك": 1, "أهنالك": 1, "فكإيانا": 1, "لدنكما": 1, "بمن": 1,
 "أفلأمامهم": 1, "أولشبه": 1, "أفلسويهما": 1, "أقل": 1, "وبشبه": 1,
 "بما": 1, "ولفوقهما": 1, "فبأقلنا": 1, "فكاد": 1, "أوككلها": 1,
 "أخلفك": 1, "فلرجع": 1, "بكلها": 1, "فكسويهما": 1, "أبضعهما": 1,
 "فبتجاهكم": 1, "ويميني": 1, "أفكنفسكما": 1, "ويمينك": 1, "فبأكثر": 1,
 "ويمينه": 1, "وسبحانهما": 1, "فلعمركن": 1, "خلالها": 1, "ولنفسه": 1,
 "أبحسبي": 1, "أبحسبه": 1, "بفوهن": 1, "بفوهم": 1, "أبحسبك": 1,
 "لأقبل": 1, "ولشمالك": 1, "بعينها": 1, "ولشماله": 1, "فللألاء": 1,
 "ولشمالي": 1, "ولفوقكما": 1, "فإليها": 1, "أفلجميعنا": 1, "فلكما": 1,
 "عينكما": 1, "ونفس": 1, "وضمنها": 1, "ولغير": 1, "أبعينكم": 1,
 "أبعينكن": 1, "فلابتدأ": 1, "أوتحتنا": 1, "غيركم": 1, "فلأولاء": 1,
 "غيركن": 1, "أبجميعكن": 1, "أبجميعكم": 1, "وبنحوكما": 1, "فلعمرهما": 1,
 "وضمنهم": 1, "أفكشبهك": 1, "أفكشبهه": 1, "أفكشبهي": 1, "فكلاهما": 1,
 "ولعليهما": 1, "ولقلما": 1, "بفوها": 1, "الوكفو": 1, "الكأخ": 1,
 "فأنهما": 1, "بعينهن": 1, "بعينهم": 1, "فاللاتي": 1, "أشمالي": 1,
 "فكأخهما": 1, "أفلان": 1, "فإليهن": 1, "فإليهم": 1, "فلعلكما": 1,
 "وبات": 1, "أويمينهم": 1, "فلكله": 1, "ومثله": 1, "فلكلك": 1,
 "ومثلك": 1, "لعلق": 1, "لعلى": 1, "فلكلي": 1, "ومثلي": 1,
 "ولأجمعها": 1, "بكما": 1, "أبكل": 1, "أبكم": 1, "أبكن": 1,
 "ولأجمعهن": 1, "ولأجمعهم": 1, "أذلكما": 1, "كتلقاءهما": 1, "وبعضهما": 1,
 "ورجع": 1, "حبذا": 1, "لحار": 1, "عداي": 1, "أفشبه": 1,
 "فكبعضنا": 1, "أفهاتين": 1, "أوعليكم": 1, "وبحسبهن": 1, "وبحسبهم": 1,
 "كتجاهنا": 1, "أولعلنا": 1, "بسويك": 1, "وبأينا": 1, "فدونك": 1,
 "فسوينا": 1, "أفليمينها": 1, "أولديك": 1, "لأمامنا": 1, "ولأنها": 1,
 "ألشبهي": 1, "لخلفك": 1, "فكتلقاءنا": 1, "لأمامهما": 1, "ألشبهك": 1,
 "لخلفي": 1, "أفبجميعك": 1, "أبمثلها": 1, "بنحونا": 1, "أفليمينهن": 1,
 "أفليمينهم": 1, "لغيركن": 1, "أولجميعنا": 1, "ولأنهن": 1, "لغيركم": 1,
 "لفيكم": 1, "أوببعضنا": 1, "وكعينهما": 1, "أفلإني": 1, "فلفيك": 1,
 "أفلإنك": 1, "وكعامتنا": 1, "أبمثلهم": 1, "أفلإنه": 1, "أبمثلهن": 1,
 "وبحسبها": 1, "ولحسب": 1, "لأقل": 1, "أخلفهم": 1, "أخلفهن": 1,
 "فلنفسهما": 1, "أفكحسبكما": 1, "فلتحتكما": 1, "فلفيي": 1, "ولهما": 1,
 "تانك": 1, "أوكغيركما": 1, "حول": 1, "ففيكما": 1, "فكأقلها": 1,
 "أفلهذه": 1, "فنحونا": 1, "أوبنحو": 1, "ألبعضنا": 1, "نفس": 1,
 "ولخلفكم": 1, "بأيه": 1, "بأيك": 1, "فكأقلهن": 1, "فكأقلهم": 1,
 "البفو": 1, "بأيي": 1, "أفلهاتين": 1, "وعندهما": 1, "أفلدينا": 1,
 "لكأننا": 1, "أفكذاك": 1, "وبذلك": 1, "فعنكما": 1, "أولبعضك": 1,
 "فبغيرنا": 1, "وعلق": 1, "أولبعضه": 1, "وكأنما": 1, "وعلى": 1,
 "أولبعضي": 1, "فلحمكما": 1, "فكغيركن": 1, "فكغيركم": 1, "لفيك": 1,
 "لفيه": 1, "لفيي": 1, "أولفيهم": 1, "أولفيهن": 1, "أفنحوكما": 1,
 "فلتانك": 1, "وأجمعها": 1, "ألتحتك": 1, "فككليهما": 1, "أمنها": 1,
 "ولأخه": 1, "ولأخك": 1, "حولكم": 1, "حولكن": 1, "ولأخي": 1,
 "أبما": 1, "أوأجمعكم": 1, "أمنهن": 1, "خلانا": 1, "عسى": 1,
 "أمنهم": 1, "ألمثلي": 1, "فبأجمعهما": 1, "ألمثله": 1, "ولعاد": 1,
 "ألمثلك": 1, "أبمن": 1, "ولأخذ": 1, "كعامتكم": 1, "وللألاء": 1,
 "أفبنحوهما": 1, "فتحتنا": 1, "فلأقلي": 1, "ولحسبه": 1, "ولحسبك": 1,
 "فضمنكن": 1, "فلأقلك": 1, "ولحسبي": 1, "فلأقله": 1, "أولفيها": 1,
 "فمساء": 1, "وبحم": 1, "وأجمعهم": 1, "وأجمعهن": 1, "أولشبههما": 1,
 "فبأيهما": 1, "فككلها": 1, "فلعني": 1, "ألغيرك": 1, "وفيهم": 1,
 "وفيهن": 1, "ويكأنك": 1, "لارتد": 1, "ويكأنه": 1, "ويكأني": 1,
 "أفكغيركما": 1, "فحينها": 1, "فلخلفه": 1, "وكحسبكما": 1, "بكليهما": 1,
 "ولابتدأ": 1, "بئس": 1, "أفإنهما": 1, "ولأبكن": 1, "أفلتحتنا": 1,
 "ولأبكم": 1, "أولفيهما": 1, "فلأخكن": 1, "فلأخكم": 1, "فلخلفك": 1,
 "أبهاته": 1, "ولمثلنا": 1, "بأولالك": 1, "أبهاتي": 1, "فكأولاء": 1,
 "أيمينكن": 1, "وأنشأ": 1, "شمالهن": 1, "أيمينكم": 1, "فبإن": 1,
 "أفهو": 1, "وقبل": 1, "أفهي": 1, "أمثلنا": 1, "أفلفوقهما": 1,
 "أوكعينهما": 1, "أفهم": 1, "أفهن": 1, "فأكثرنا": 1, "أوبما": 1,
 "أفلعننا": 1, "ولبعضكما": 1, "فكنحوكن": 1, "فكنحوكم": 1, "فبه": 1,
 "كغيركما": 1, "ت": 1, "وكشبههما": 1, "ولقام": 1, "أوهؤلاء": 1,
 "أمنك": 1, "ولأنتما": 1, "أمنه": 1, "وبأجمعك": 1, "أمني": 1,
 "أفبأولئك": 1, "أتحتهما": 1, "لمنك": 1, "فيمينهما": 1, "ضمن": 1,
 "لمنه": 1, "وبعامتكما": 1, "لمني": 1, "بأخكما": 1, "أمعهما": 1,
 "ألكلنا": 1, "أفلجميعكما": 1, "أوبمن": 1, "وأنكن": 1, "وأنكم": 1,
 "وبذين": 1, "وبعضها": 1, "أفلعلهما": 1, "أفكإنكم": 1, "أفكإنكن": 1,
 "أفبعامتهم": 1, "أفلتلكم": 1, "أفبعامتهن": 1, "مرة": 1, "منهما": 1,
 "كأكثرها": 1, "أولخلفنا": 1, "ألنفسكما": 1, "وكتينك": 1, "وكجميعهما": 1,
 "لتحتهم": 1, "لتحتهن": 1, "بحسبهن": 1, "بحسبهم": 1, "أولإليهما": 1,
 "ولأضحى": 1, "بأيكن": 1, "بأيكم": 1, "وبغيرك": 1, "وهاتي": 1,
 "وبغيره": 1, "فبينكم": 1, "بحسبها": 1, "وبغيري": 1, "أبكلهما": 1,
 "أفلديها": 1, "وهاته": 1, "ألخلفكما": 1, "لكلتا": 1, "أوبأجمعهما": 1,
 "وبعضهن": 1, "وبعضهم": 1, "أفلفيهن": 1, "أفبعامتها": 1, "أفلتحته": 1,
 "بذانك": 1, "بأيكما": 1, "كأكثرهن": 1, "كأكثرهم": 1, "فبفونا": 1,
 "وبنفس": 1, "ليمينه": 1, "ليمينك": 1, "فلحيث": 1, "ليميني": 1,
 "أفبشبه": 1, "أفكبعضها": 1, "وكذانك": 1, "هناك": 1, "أإنهن": 1,
 "أإنهم": 1, "إلا": 1, "ولإليك": 1, "أوحسبها": 1, "ولإليه": 1,
 "فلمن": 1, "أوغيرهم": 1, "أوغيرهن": 1, "أفلمنكما": 1, "أوبجميعها": 1,
 "أإنها": 1, "فمعاذ": 1, "أوحسبهم": 1, "فعداه": 1, "أوحسبهن": 1,
 "فحولكم": 1, "أفلكلنا": 1, "أوغيرها": 1, "أوبجميعهم": 1, "أوبجميعهن": 1,
 "لفوقنا": 1, "أوكذلكما": 1, "وكفوكما": 1, "وكالألاء": 1, "فبالذين": 1,
 "أفكبعضهم": 1, "تلقاءنا": 1, "أفكبعضهن": 1, "أفكذلكم": 1, "ضمنكما": 1,
 "وبذا": 1, "بينهما": 1, "أوكلاهما": 1, "فمهما": 1, "أوككلكن": 1,
 "أوككلكم": 1, "أبغيرهم": 1, "أبغيرهن": 1, "بكلكم": 1, "أفكأجمعهما": 1,
 "بكلكن": 1, "فكهذين": 1, "وكمثلكما": 1, "فبمثلكما": 1, "بضعنا": 1,
 "وبضعه": 1, "أنت": 1, "وبضعك": 1, "أنا": 1, "وبضعي": 1,
 "أوبجميعي": 1, "أوبجميعه": 1, "أوبجميعك": 1, "بأجمعهما": 1, "أفلعيننا": 1,
 "أني": 1, "أوكجميع": 1, "فلكأنكم": 1, "أنى": 1, "كتلقاءنا": 1,
 "أنه": 1, "أنك": 1, "أكنحوك": 1, "أكنحوه": 1, "أكنحوي": 1,
 "كإياهما": 1, "فأبكما": 1, "وعينهما": 1, "أفكذا": 1, "أفكهاتي": 1,
 "وبذه": 1, "ليتي": 1, "ضحوة": 1, "فكسوي": 1, "فلحسبي": 1,
 "وبذي": 1, "أفكهاته": 1, "أوكهما": 1, "فلطفق": 1, "ويكأنها": 1,
 "أفبضعنا": 1, "أكثركم": 1, "أكثركن": 1, "ولمنهم": 1, "وحمكما": 1,
 "لصار": 1, "ألعين": 1, "حينهم": 1, "وكإياها": 1, "فلعليكما": 1,
 "ولشمال": 1, "وكنحوكما": 1, "فكتلقاءي": 1, "أفلعلينا": 1, "أفلنحوي": 1,
 "أفلنحوه": 1, "أفلنحوك": 1, "أوكأجمعهما": 1, "فبعدكما": 1, "أكسويهما": 1,
 "بأخكن": 1, "بأخكم": 1, "فلشبهنا": 1, "وبالألى": 1, "أولعين": 1,
 "ولنحن": 1, "أفتينك": 1, "أوعامة": 1, "ألكن": 1, "إلينا": 1,
 "ولنحو": 1, "أفإليها": 1, "أفلعامته": 1, "عندكما": 1, "أفلعامتك": 1,
 "كحمكما": 1, "فلفوهن": 1, "كذلكن": 1, "كذلكم": 1, "فلفوهم": 1,
 "أولكأنما": 1, "وحواليك": 1, "وبمثلهما": 1, "بمثلهما": 1, "وكإياهن": 1,
 "وكإياهم": 1, "ولعنكن": 1, "حواليها": 1, "ولعنكم": 1, "فلذلكم": 1,
 "فلذلكن": 1, "أفبها": 1, "أفبغيرهم": 1, "وسويكن": 1, "وسويكم": 1,
 "لست": 1, "لأبهما": 1, "أوذينك": 1, "أفلغيركم": 1, "أفلغيركن": 1,
 "لنحوكما": 1, "ليسوا": 1, "لتجاههم": 1, "أوفوقك": 1, "أوبحسبكما": 1,
 "أولفوقهن": 1, "أولفوقهم": 1, "أوثمة": 1, "فلكن": 1, "فلكل": 1,
 "أفجميعي": 1, "أفجميعك": 1, "فلكي": 1, "أفجميعه": 1, "وكأينا": 1,
 "أولفوقها": 1, "ففوقنا": 1, "أوإنك": 1, "حينكن": 1, "حواليهن": 1,
 "حواليهم": 1, "أفكهناك": 1, "أفبهن": 1, "أفبهو": 1, "ألإنكن": 1,
 "ألإنكم": 1, "فإذما": 1, "ألأجمعكن": 1, "ألأجمعكم": 1, "فلنفسكم": 1,
 "وعامتكما": 1, "فلنفسكن": 1, "لسن": 1, "فلعله": 1, "أبأجمعهم": 1,
 "فلعلك": 1, "فلعلق": 1, "فبعضكم": 1, "أذلكن": 1, "أفمع": 1,
 "فبعضكن": 1, "فبأخ": 1, "وبحسبكم": 1, "أفإليهم": 1, "فلكني": 1,
 "وإزاء": 1, "لعني": 1, "أبضعه": 1, "وأنتم": 1, "وأنتن": 1,
 "أبإنها": 1, "أولأنتن": 1, "ولتي": 1, "لغيرها": 1, "ولته": 1,
 "ولنفسكما": 1, "أولهناك": 1, "ألغير": 1, "أبإنهن": 1, "أبإنهم": 1,
 "لغيرهن": 1, "لغيرهم": 1, "ومنكما": 1, "كتي": 1, "فبأن": 1,
 "أونحوكم": 1, "أبمثلكم": 1, "أبمثلكن": 1, "كته": 1, "فمعاذهما": 1,
 "أفمن": 1, "أولعليك": 1, "أخلفكم": 1, "أولعليه": 1, "أخلفكن": 1,
 "لمثل": 1, "الآن": 1, "أوبمثل": 1, "فلتجاهكن": 1, "فلتجاهكم": 1,
 "ولأيهم": 1, "ولأيهن": 1, "لتانك": 1, "ولكلنا": 1, "كفوكما": 1,
 "كنفسهما": 1, "فخلال": 1, "أوكتلكما": 1, "وكعامتها": 1, "ليس": 1,
 "إيانا": 1, "فكغير": 1, "وإياكن": 1, "وإياكم": 1, "فكأولالك": 1,
 "فكأقلكن": 1, "فكأقلكم": 1, "أوبكل": 1, "لأقلكن": 1, "فبإنه": 1,
 "لأقلكم": 1, "فعامتهما": 1, "وعوض": 1, "فهكذا": 1, "أولتلكما": 1,
 "فتحتكما": 1, "ولأيها": 1, "ولتحتنا": 1, "فككلنا": 1, "أوبعامتكما": 1,
 "فإذن": 1, "كحسبهما": 1, "لأخهن": 1, "لأخهم": 1, "كالذين": 1,
 "أفإنكن": 1, "وكحسبهن": 1, "وكحسبهم": 1, "أفإنكم": 1, "وكمثل": 1,
 "فأجمعها": 1, "حينهما": 1, "وذواتي": 1, "فكحسب": 1, "أوعيننا": 1,
 "لمعكن": 1, "عل": 1, "لمعكم": 1, "وليتهما": 1, "وبأجمعنا": 1,
 "وذواتا": 1, "أفتحتكم": 1, "أفتحتكن": 1, "فأمام": 1, "إياكما": 1,
 "ألعليها": 1, "فتجاهه": 1, "فإذا": 1, "فتجاهك": 1, "لأخها": 1,
 "فكأينا": 1, "فتجاهي": 1, "وكحسبها": 1, "فعيني": 1, "فلخلفنا": 1,
 "فعينك": 1, "أونفسكن": 1, "أونفسكم": 1, "فعينه": 1, "أفإلينا": 1,
 "أفأجمعهما": 1, "كإنهن": 1, "كإنهم": 1, "وليمين": 1, "أنفسه": 1,
 "فكعامتكما": 1, "أنفسي": 1, "وسرعان": 1, "أوتلكم": 1, "فيم": 1,
 "كجميعنا": 1, "ولا": 1, "بهاتي": 1, "لفو": 1, "بهاته": 1,
 "مثلكم": 1, "مثلكن": 1, "أوبمثله": 1, "وبجميع": 1, "أوبمثلك": 1,
 "لنحوها": 1, "أوبمثلي": 1, "وبهاتين": 1, "ليمينهم": 1, "أوعنكن": 1,
 "أوعنكم": 1, "أولأمامنا": 1, "فيه": 1, "لنحوهن": 1, "لنحوهم": 1,
 "كإنها": 1, "أوفينا": 1, "أبذلكن": 1, "أوإنكن": 1, "أوإنكم": 1,
 "أبذلكم": 1, "أوبكلنا": 1, "وأنكما": 1, "ولفوهما": 1, "أفكجميعنا": 1,
 "وبعدنا": 1, "وكليكما": 1, "أولمعها": 1, "وتين": 1, "أعيننا": 1,
 "ألا": 1, "فأقبل": 1, "بهي": 1, "بهو": 1, "بهن": 1,
 "وكإنهما": 1, "أككلها": 1, "كنحوها": 1, "كلنا": 1, "ألم": 1,
 "ألن": 1, "فأجمعك": 1, "أكعينكما": 1, "ألك": 1, "ألو": 1,
 "ألي": 1, "فذلك": 1, "أخلفه": 1, "أككلهم": 1, "أككلهن": 1,
 "كنحوهن": 1, "كنحوهم": 1, "أوليمينكم": 1, "أوليمينكن": 1, "فبإياي": 1,
 "أولمعهن": 1, "أولمعهم": 1, "أولكما": 1, "والألاء": 1, "وأخهما": 1,
 "فلعاد": 1, "بهما": 1, "عداهن": 1, "عداهم": 1, "أولكأنهم": 1,
 "فلأولالك": 1, "فكاللتين": 1, "أكلي": 1, "فككلكما": 1, "ولتحول": 1,
 "أكلك": 1, "كسويه": 1, "أكله": 1, "كسويك": 1, "فلفو": 1,
 "أمعنا": 1, "فلفي": 1, "ويكأنكم": 1, "ويكأنكن": 1, "لعلكن": 1,
 "لعلكم": 1, "أفلمعنا": 1, "فمنكما": 1, "أكلا": 1, "وتان": 1,
 "أوتحتي": 1, "أوتحته": 1, "وبعضكما": 1, "أبحسبكم": 1, "أوتحتك": 1,
 "أبحسبكن": 1, "أفبغيركم": 1, "أفبغيركن": 1, "وكحسبي": 1, "أفإني": 1,
 "ولتحت": 1, "وكأجمعنا": 1, "فلأكثر": 1, "عداها": 1, "خلفكما": 1,
 "أولكأنها": 1, "فكاللتيا": 1, "أننا": 1, "أفلخلف": 1, "أولأنت": 1,
 "فجميعنا": 1, "أفعامتهما": 1, "فكسوينا": 1, "فلحسبه": 1, "أولأنا": 1,
 "فلحسبك": 1, "وككليكما": 1, "الفلحم": 1, "فكأخهم": 1, "فكأخهن": 1,
 "وبعينكما": 1, "أفبما": 1, "لكان": 1, "عامتهما": 1, "أفذينك": 1,
 "فكأخها": 1, "فلذواتي": 1, "أفبمن": 1, "وكنفس": 1, "فلهنالك": 1,
 "أوبإننا": 1, "أبضعنا": 1, "فكمثلكن": 1, "فبإني": 1, "فكمثلكم": 1,
 "فلحم": 1, "فبإنك": 1, "أوبشبههما": 1, "بعينكم": 1, "أوبنحوكم": 1,
 "أوبنحوكن": 1, "بغيرها": 1, "أوبنحوكما": 1, "أولبعضكما": 1, "طق": 1,
 "فبضعي": 1, "فحتى": 1, "أبها": 1, "أبهو": 1, "أبهي": 1,
 "أبهم": 1, "أبهن": 1, "بعامتكن": 1, "بغيرهن": 1, "بغيرهم": 1,
 "بعامتكم": 1, "وإما": 1, "أفخلفهما": 1, "أفلأجمعكما": 1

};

//==========================================
// INNER VARIABLES
//==========================================

/**
 * An object to be a medium between different functions
 * @type {Object}
 */
let verbInfo = {
  /**
   * The verb
   * @type {String}
   */
  verb: "",
  /**
   * The filtered verb
   * @type {String}
   */
  filter: "",
  /**
   * The length of the verb
   * @type {Number}
   */
  len: 0,
  /**
   * Weak beginning
   * @type {Boolean}
   */
  wb: false,
  /**
   * Weak middle
   * @type {Boolean}
   */
  wm: false,
  /**
   * Weak ending
   * @type {Boolean}
   */
  we: false,
  /**
   * Mudaaf
   * @type {Boolean}
   */
  m: false
};


/**
 * This object is used to save the last weak middle verb and its type.
 * This will optimize the process time when looking for the type of the
 * same used verb.
 * @private
 * @static
 * @type {Object}
 */
let weakMiddleStack = {
  verb: "",
  res: ""
};

//==========================================
// HELPER FUNCTIONS
//==========================================

function notNull(obj) {
  return (obj != null);
}

//==========================================
// ISRI STEMMER FUNCTIONS
//==========================================

function __IsriAraStemmer(word) {
  let stem = word,
  norm = AraMorpho.prototype.norm;
  //normalization
  stem = AraMorpho.norm(stem, "voc");
  //Stop words: ignore

  //remove length three and length two prefixes in this order
  stem = IsriPre32(stem);
  //remove length three and length two suffixes in this order
  stem = IsriSuf32(stem);
  //remove connective ‘و’ if it precedes a word beginning with ‘و’
  stem = IsriWaw(stem);
  //normalize initial hamza to bare alif
  stem = AraMorpho.norm(stem, "ihamza");

  if (stem.length < 4) return stem;

  switch (stem.length) {
    case 4: return IsriProW4(stem);
    case 5:
    stem = IsriProW53(stem);
    return IsriEndW5(stem);
    case 6:
    stem = IsriProW6(stem);
    return IsriEndW6(stem);
    case 7:
    stem = IsriSuf1(stem);
    if (stem.length === 7) stem = IsriPre1(stem);
    if (stem.length === 6) {
      stem = IsriProW6(stem);
      stem = IsriEndW6(stem);
    }
    return stem;

    default: return stem;

  }
}

//remove length three and length two prefixes in this order
function IsriPre32(word) {
  if (word.length >= 6) {
    for (let i in isriP3)
      if (word.startsWith(isriP3[i])) return word.slice(3);
  }

  if (word.length >= 5) {
    for (let i in isriP2) {
      if (word.startsWith(isriP2[i])) return word.slice(2);
    }
  }

  return word;
}

//remove length three and length two suffixes in this order
function IsriSuf32(word) {
  if (word.length >= 6) {
    for (let i in isriS3)
      if (word.endsWith(isriS3[i])) return word.slice(0, -3);
  }

  if (word.length >= 5) {
    for (let i in isriS2) {
      if (word.endsWith(isriS2[i])) return word.slice(0, -2);
    }
  }

  return word;
}

//remove connective ‘و’ if it precedes a word beginning with ‘و’
function IsriWaw(word) {
  if (word.length >= 4 && word.startsWith("وو")) return word.slice(1);
  return word;
}

//process length four patterns and extract length three roots
function IsriProW4(word) {
  //مفعل
  if (word.startsWith("م")) return word.slice(1);
  //فاعل
  if (/^.ا/.test(word)) return word[0] + word.slice(2);
  // فعال - فعول - فعيل
  if (/^..[اوي]/.test(word)) return word.slice(0, -2) + word[3];
  //فعلة
  if (word[3] === "ة") return word.slice(0, -1);
  //normalize short sufix
  word = IsriSuf1(word);
  //normalize short prefix
  if (word.length === 4) word = IsriPre1(word);

  return word;

}

//normalize short sufix
function IsriSuf1(word) {
  for (let i in isriS1)
    if (word.endsWith(isriS1[i]))
      return word.slice(0, -1);
  return word;
}

//normalize short prefix
function IsriPre1(word) {
  for (let i in isriP1)
    if (word.startsWith(isriP1[i]))
      return word.slice(1);
  return word;
}

//process length five patterns and extract length three roots
function IsriProW53(word) {
  let m;
  // افتعل - افاعل
  if (notNull(m = /^ا(.)[ات](.+)$/.exec(word))) return m[1] + m[2];
  // مفعول - مفعال - مفعيل
  if (notNull(m = /^م(..)[اوي](.)$/.exec(word))) return m[1] + m[2];
  // مفعلة - تفعلة - افعلة
  if (notNull(m = /^[متا](.+)ة$/.exec(word))) return m[1];
  // مفتعل - يفتعل - تفتعل
  if (notNull(m = /^[ميت](.)ت(.+)$/.exec(word))) return m[1] + m[2];
  // مفاعل - تفاعل
  if (notNull(m = /^[مت](.)ا(.+)$/.exec(word))) return m[1] + m[2];
  // فعولة - فعالة
  if (notNull(m = /^(..)[وا](.)ة$/.exec(word))) return m[1] + m[2];
  // انفعل - منفعل
  if (notNull(m = /^[ام]ن(.+)$/.exec(word))) return m[1];
  //افعال
  if (notNull(m = /^ا(..)ا(.)$/.exec(word))) return m[1] + m[2];
  //فعلان
  if (notNull(m = /^(...)ان$/.exec(word))) return m[1];
  //تفعيل
  if (notNull(m = /^ت(..)ي(.)$/.exec(word))) return m[1] + m[2];
  //فاعول
  if (notNull(m = /^(.)ا(.)و(.)$/.exec(word))) return m[1] + m[2] + m[3];
  //فواعل
  if (notNull(m = /^(.)وا(..)$/.exec(word))) return m[1] + m[2];
  //فعائل
  if (notNull(m = /^(..)ائ(.)$/.exec(word))) return m[1] + m[2];
  //فاعلة
  if (notNull(m = /^(.)ا(..)ة$/.exec(word))) return m[1] + m[2];
  //فعالي
  if (notNull(m = /^(..)ا(.)ي$/.exec(word))) return m[1] + m[2];

  //normalize short sufix
  word = IsriSuf1(word);
  //normalize short prefix
  if (word.length === 5) word = IsriPre1(word);

  return word;
}

//ending step (word of length five)
function IsriEndW5(word) {
  if (word.length === 4) return IsriProW4(word);
  if (word.length === 5) return IsriProW54(word);
  return word;
}

//process length five patterns and extract length four roots
function IsriProW54(word) {
  let m;
  //تفعلل - افعلل - مفعلل
  if (notNull(m = /^[تام](.+)$/.exec(word))) return m[1];
  //فعللة
  if (notNull(m = /^(.+)ة$/.exec(word))) return m[1];
  //فعالل
  if (notNull(m = /^(..)ا(..)$/.exec(word))) return m[1] + m[2];

  return word;
}

//process length six patterns and extract length three roots
function IsriProW6(word) {
  let m;
  //مستفعل - استفعل
  if (notNull(m = /^[ام]ست(.+)$/.exec(word))) return m[1];
  //مفعالة
  if (notNull(m = /^م(..)ا(.)ة$/.exec(word))) return m[1] + m[2];
  //افتعال
  if (notNull(m = /^ا(.)ت(.)ا(.)$/.exec(word))) return m[1] + m[2] + m[3];
  //افعوعل
  if (notNull(m = /^ا(.)(.)و\2(.)$/.exec(word))) return m[1] + m[2] + m[3];
  //تفاعيل
  if (notNull(m = /^ت(.)ا(.)ي(.)$/.exec(word))) return m[1] + m[2] + m[3];

  //normalize short sufix
  word = IsriSuf1(word);
  //normalize short prefix
  if (word.length === 6) word = IsriPre1(word);

  return word;
}

//ending step (word of length six)
function IsriEndW6(word) {
  if (word.length === 5) {
    word = IsriProW53(word);
    return IsriEndW5(word);
  }

  if (word.length === 6) return IsriProW64(word);

  return word;
}

//process length six patterns and extract length four roots
function IsriProW64(word) {
  let m;
  //افعلال
  if (notNull(m = /^ا(...)ا(.)$/.exec(word))) return m[1] + m[2];
  //متفعلل
  if (notNull(m = /^مت(.+)$/.exec(word))) return m[1];

  return word;
}

//==========================================
// JSLINGUA STEMMER FUNCTIONS
//==========================================

/*let JsLinguaPS = {
  //templates
  "t": [
    /^ل[أنتي](.*)ن$/,

  ],
  //prifixes
  "p": [
    //3 length prefix
    isriP3,

  ]
};

*/

function __jsStem(word, startingList, endingList) {
  let l = "^(" + startingList.join("|") + ")";
  l = l + "(.*)(" + endingList.join("|") + ")$";
  l = new RegExp(l);

  let m;

  if (notNull(m = l.exec(word))) {
    let taa = m[3].startsWith("ت")? "ة": "";
    return m[2] + taa;
  }

  return word;
}


/**
 * A method for Arabic stemming which aims to use regex as much as possible
 *
 * @method __jslinguaAraStemmer
 * @private
 * @static
 * @memberof AraMorpho
 * @param  {String}          word the word to be stemmed
 * @return {String}               The stem
 */
function __jslinguaAraStemmer(word) {
  let stem = word;

  stem = __jsStem(stem, isriP3, isriS3);//6

  stem = __jsStem(stem, isriP3, isriS2);//5

  stem = __jsStem(stem, isriP2, isriS3);//5

  stem = __jsStem(stem, isriP2, isriS2);//4

  stem = __jsStem(stem, isriP3, isriS1);//4

  stem = __jsStem(stem, isriP1, isriS3);//4

  stem = __jsStem(stem, isriP2, isriS1);//3

  stem = __jsStem(stem, isriP1, isriS2);//3

  stem = __jsStem(stem, isriP3, []);//3

  stem = __jsStem(stem, [], isriS3);//3

  stem = __jsStem(stem, isriP1, isriS1);//2

  stem = __jsStem(stem, isriP2, []);//2

  stem = __jsStem(stem, [], isriS2);//2

  stem = __jsStem(stem, isriP1, []);//1

  stem = __jsStem(stem, [], isriS1);//1

  return stem;//0
}

//==========================================
// CONVERTION FUNCTIONS
//==========================================


//https://blogs.transparent.com/arabic/broken-plural-in-arabic/
//https://en.wikipedia.org/wiki/Broken_plural
/**
 * Transforms a singular noun to plural
 *
 * @method __singular2plural
 * @private
 * @static
 * @memberof AraMorpho
 * @param  {String}        noun The noun to be transformed to plural
 * @return {String}             Plural form of the given noun
 */
function __singular2plural(noun){
  let pattern = __find_pattern(noun);
  let nodiac = noun.replace(/[َُِْ]/g, "");
  nodiac = nodiac.replace(/(.)ّ/g, "$1$1");
  //console.log(nodiac, " ", pattern);
  if (pattern == "CiCC" && nodiac[1] == nodiac[2]) pattern = "CiIC";
  switch (pattern) {
    case "CiCaAC":
    case "CaCiICah": // "CaCiICah" two cases, one shared with "CiCaACah"
      return nodiac[0] + "ُ" + nodiac[1] + "ُ" + nodiac[3];
    //case "CaCiIC" //three cases
    case "CuCCah":
    case "CaCCah":
      return nodiac[0] + "ُ" + nodiac[1] + "َ" + nodiac[2];
    case "CiCCah":
      return nodiac[0] + "ِ" + nodiac[1] + "َ" + nodiac[2];
    case "CiIC":
      return nodiac[0] + "ِ" + nodiac[1] + "َ" + nodiac[2] + "َة";
    //case "CiCC" || "CuCC" || "CaCC": //three cases
    case "CaCuC":
      return nodiac[0] + "ِ" + nodiac[1] + "َا" + nodiac[2];
    //case "CaCaC": two  cases af3al fi3al
    case "CaCaCah":
      return "أَ" + nodiac[0] + "ْ" + nodiac[1] + "َا" + nodiac[2];
    case "CaCuUC":
      return "أَ" + nodiac[0] + "ْ" + nodiac[1] + "ِ" + nodiac[3] + "َة";
    case "CaACiC":
      return nodiac[0] + "ُ" + nodiac[2] + "َّا" + nodiac[3];
    case "CaACiCah":
      return nodiac[0] + "َوَا" + nodiac[2] + "ِ" + nodiac[3];
    case "CaACuUC":
      return nodiac[0] + "َوَا" + nodiac[2] + "ِي" + nodiac[4];
    case "CiCaACah": //|| "CaCiICah"
      return nodiac[0] + "َ" + nodiac[1] + "َائِ" + nodiac[3];
    case "CaCCaC":
    case "CuCCuC":
      return nodiac[0] + "َ" + nodiac[1] + "َا" + nodiac[2] + "ِ" + nodiac[3];
    case "maCCaC":
    case "maCCiC":
    case "miCCaCah":
      return nodiac[0] + "َ" + nodiac[1] + "َا" + nodiac[2] + "ِ" + nodiac[3];
    case (pattern.match(/^[Cm][aiu]CC(uU|aA|iI)C$/) || {}).input:
      return nodiac[0] + "َ" + nodiac[1] + "َا" + nodiac[2] + "ِي" + nodiac[4];
    default:
      if (noun.endsWith("ة")) return noun.slice(0, -1) + "ات";
      return noun + "ون" ;
  }
}

function __find_pattern(noun) {
  let meter = noun;
  meter = meter.replace(/(.)ا/, "$1A");
  meter = meter.replace(/(.)ي/, "$1I");
  meter = meter.replace(/(.)و/, "$1U");
  meter = meter.replace(/^م/, "m");
  meter = meter.replace(/َ/g, "a").replace(/ِ/g, "i").replace(/ُ/g, "u");
  meter = meter.replace(/ْ/g, "").replace(/ة/g, "h");
  meter = meter.replace(/[^AIUaiumh]/g, "C");
  meter = meter.replace(/(.)ّ/g, "$1$1");

  return meter;
}

/**
 * Transforms a singular noun to dual
 *
 * @method __singular2dual
 * @private
 * @static
 * @memberof AraMorpho
 * @param  {String}        noun The noun to be transformed to dual
 * @return {String}             Plural form of the given noun
 */
function __singular2dual(noun){
  if (noun.endsWith("ة")) noun = noun.slice(0, -1) + "ت";
  return noun + "ان" ;
}

//==========================================
// CONJUGATION FUNCTIONS
//==========================================

function __conj(verb, opts) {

  if (opts.mood === Morpho.Mood.Imp) return __getImperative(verb, opts);

  __verbTypes(verb);

  if (__noConjugation(opts)) return "";

  //let filteredVerb = verbInfo.filter;

  //save the original tense
  let tense = opts.tense;

  //Future is prefix + present
  if (opts.tense === Morpho.Tense.Fu) opts.tense = Morpho.Tense.Pr;

  let pronounIdx = __getPronounIndex(opts);

  let conjVerb = {
    v: verb,
    t: opts.tense, //original tense
    s: "",
    p: "",
    dV: (opts.tense === Morpho.Tense.Pr)? "ْ": "َ",
    dR: (opts.tense === Morpho.Tense.Pr)? "ِ": "َ" /*,
    dB: ""*/
  };

  __affixHandler(conjVerb, opts, pronounIdx);

  __verbLengthHandler(conjVerb, opts);

  if (verbInfo.wb) __weakBeginHandler(conjVerb, opts);

  if (verbInfo.wm) __weakMiddleHandler(conjVerb, opts, pronounIdx);

  if (verbInfo.we) __weakEndHandler(conjVerb, opts, pronounIdx);

  if (verbInfo.m) __mudaafHandler(conjVerb, opts, pronounIdx);

  __voiceHandler(conjVerb, opts);

  //detect if the verb has a weak middle
  //let weakMiddle = false;

  __diacreticsHandler(conjVerb);

  //naqis normalization
  //if (verbInfo.we) weakEndNormalization(conjVerb, pronounIdx, opts.tense);

  let result = conjVerb.p;
  //The ending of a verb must not have diacritics; they are handled by suffix
  result += (/^[َُِْ]/.test(conjVerb.s))? conjVerb.v.replace(/[َُِْ]$/, ""): conjVerb.v;
  result += conjVerb.s;

  //Normalization of alif
  result = __conjNormalizeAlif(result);

  result = __conjNormalizeWaw(result);

  result = __conjNormalizeYaa(result);

  result = result.replace(/(.)ْ\1([َُِ])/, "$1ّ$2");

  if (! opts.noNegMark) {
    let begin = "";

    if (opts.negated) {
      begin = "لَمْ "; //past
      if (tense === Morpho.Tense.Pr)  begin = "لَنْ ";
    }
    else if (tense === Morpho.Tense.Fu) begin = "سَوْفَ ";

    result = begin  + result;
  }


  return result.trim();

};

function __getImperative(verb, opts) {
  if (__noConjugation(opts)) return "";

  let newOpts = Object.assign({}, opts);
  newOpts.mood = Morpho.Mood.Ind;
  newOpts.tense = Morpho.Tense.Pa;
  newOpts.voice = Morpho.Voice.A;
  newOpts.negated = 1;
  newOpts.noNegMark = 1;
  let imp = __conj(verb, newOpts);
  if (opts.negated) return "لَا " + imp;
  imp = imp.slice(2);

  let begin = "";


  if (verbInfo.wb) {
    if (/^أ.{3}$/.test(verbInfo.filter)) begin = "أَ";
    else if (verbInfo.filter.startsWith("ا")) begin = "ا";
  }
  else if (!/[َُِ]/.test(imp[1]) && !/^ت.(ا.|.).$/.test(verbInfo.filter)) {
    begin = "ا";
  }

  return begin + imp;
}

//==========================================
// CONJUGATION HANDLER FUNCTIONS
//==========================================

function __affixHandler(conjVerb, opts, pronounIdx) {
  let suffix = "";
  if (opts.negated) {
    let end = (opts.tense === Morpho.Tense.Pa)? "ْ": "َ";
    suffix = conjAffix[Morpho.Tense.Pr].suffix[pronounIdx];
    if (/[^ْ]ن[َِ]$/.test(suffix)) {//delete nuun with negation when not preceded by sukuun
      suffix = suffix.slice(0, -2);
      if (suffix.endsWith("و")) suffix += "ا";
    } //Otherwise add fatha for present, sukuun for past
    else if (! /ن[َِ]$/.test(suffix)) suffix = suffix.slice(0, -1) + end;
    opts.tense = Morpho.Tense.Pr;
    conjVerb.dV = "ْ";
    conjVerb.dR = "ِ";
  }
  else {
    suffix = conjAffix[opts.tense].suffix[pronounIdx];
  }
  conjVerb.s = suffix;

  let prefix = conjAffix[opts.tense].prefix[pronounIdx];
  if(! prefix) prefix = "";
  conjVerb.p = prefix;
}


function __weakBeginHandler(conjVerb, opts) {
  let verb = conjVerb.v,
  filteredVerb = verbInfo.filter,
  len = verbInfo.len;

  if (opts.tense === Morpho.Tense.Pr) {
    verb = (opts.voice === Morpho.Voice.P && len ===3 && !filteredVerb.startsWith("أ"))? verb.replace(/^(.)[َُِْ]/, "$1"): verb.slice(1);
    //TODO verify verbs like akala
    /*if (len > 3 || !filteredVerb.startsWith("أ")) verb = verb.slice(1);
    if (opts.voice === Voice.P) {
      if (/^أ.{2}$/.test(filteredVerb)) verb += "أو"; //
    }*/


    if (/^ا.ت..$/.test(filteredVerb)) {
      conjVerb.dV = "َ";
    }

  }

  if (/^ا.{3}$/.test(filteredVerb)) {
    conjVerb.dV = "ْ";
  }

  conjVerb.v = verb;
}

function __weakMiddleHandler(conjVerb, opts, pronounIdx) {

  let verb = conjVerb.v,
  weakType = __weakMiddleOrigin(verb, verbInfo.filter),
  diacV = "َُِ"[weakType],
  diacR = "";


  if (opts.tense === Morpho.Tense.Pa) {
    diacR = (verbInfo.len === 3)? "ُ": "َ";

    if (pronounIdx === 13 || pronounIdx < 8) {
      verb = verb.replace(/^(.+)ا(.َ?)$/, "$1$2");
      if (verb.startsWith("آ")) verb = "أ" + verb.slice(1);
      if (weakType === 0) diacV = "ِ";
    }
    else {
      diacR = "";
      diacV = "َ";
    }
  }
  else {//Present

    let weakChar = "اوي"[weakType];
    if (opts.voice !== Morpho.Voice.P) {//weakType === 2 ||
      //with plural feminine; delete the weakChar
      if ([7, 13].indexOf(pronounIdx) > -1) weakChar = "";

      verb = verb.replace(/^(.+)ا(.َ?)$/, "$1" + weakChar + "$2");
    }
    else {
      diacV = "َ";
      diacR = "X";
    }

  }

  conjVerb.v = verb;
  conjVerb.dV = diacV;
  conjVerb.dR = diacR;

}

function __weakEndHandler(conjVerb, opts, pronounIdx) {
  let verb = conjVerb.v,
  diacR = conjVerb.dR;
  //if (opts.tense === Tense.Pa) conjVerb.dR = "َ";
  diacR = "َ";
  verb = verb.slice(0, -1);

  if (opts.voice === Morpho.Voice.P) { //
    if (opts.tense === Morpho.Tense.Pa || [4, 5, 7, 10, 11, 13].indexOf(pronounIdx) > -1) {
      verb +=  "ي";
      diacR = "ِ";
    }
    else verb += "ى";
    //verb += (opts.tense === Tense.Pa || [4, 5, 7, 10, 11, 13].indexOf(pronounIdx) > -1)? "ي": "ى";
  }
  else {
    if (verbInfo.filter.endsWith("ى")) {
      verb += "ي";//TODO fix
      if (opts.tense !== Morpho.Tense.Pa) diacR = "ِ";
    }
    else {
      verb += "و";//TODO fix
      if (opts.tense !== Morpho.Tense.Pa) diacR = "ُ";
    }

    //Sometimes it is not a
  }
  conjVerb.v = verb;
  conjVerb.dR = diacR;

  __conjNormalizeWeakEnd(conjVerb, pronounIdx, opts);
}

function __mudaafHandler(conjVerb, opts, pronounIdx) {
  let verb = conjVerb.v;
  if (opts.tense === Morpho.Tense.Pr) {
    if ([7, 13].indexOf(pronounIdx) > -1) {
      verb = verb.replace(/^(.*)(.)َّ?$/, "$1$2َ$2ْ");
      conjVerb.dR = (verbInfo.len < 4)? "ُ": "ِ";
    }
    else {
      verb = verb.replace(/َ$/, "");
      if (verbInfo.len > 4) {
        conjVerb.dV = "ْ";
        conjVerb.dR = "َ";
      }
      else {
        conjVerb.dV = "ُ";
        conjVerb.dR = "";
      }
    }

  }
  else { //past
    if (pronounIdx === 13 || pronounIdx < 8) {
      conjVerb.dR = "َ";
      verb = verb.replace(/^(.*)(.)َّ?$/, "$1$2َ$2ْ");
    }
    else conjVerb.dR = "";

  }

  conjVerb.v = verb;

}

function __voiceHandler(conjVerb, opts) {

  if (opts.voice !== Morpho.Voice.P) return;

  let suffix = conjVerb.s,
  verb = conjVerb.v;

  if (opts.tense === Morpho.Tense.Pa) {
    conjVerb.dV = (verbInfo.wm)? "ِ": "ُ";
    conjVerb.dR = (verbInfo.wm)? "X": "ِ";

    if (/^أ.{3}$/.test(verbInfo.filter)) {
      conjVerb.dV = "ْ";//sukuun
      verb = verb.replace(/^أ[َُِْ]?/, "أُ");
    }
  }
  else { //present
    conjVerb.p = conjVerb.p.slice(0, -1) + "ُ";
    conjVerb.dR = (verbInfo.wm)? "X": "َ";
    if(verbInfo.we  && suffix.startsWith("ْ")) suffix = suffix.slice(1);
  }

  conjVerb.s = suffix;
  conjVerb.v = verb;

}

function __verbLengthHandler(conjVerb, opts) {
  let verb = conjVerb.v,
  filteredVerb = verbInfo.filter,
  diacV = conjVerb.dV,
  diacR = conjVerb.dR,
  prefix = conjVerb.p;

  if (verbInfo.len === 3) {
    diacR = "X"; //delete the vocal due to dictionary dependency
    if (! /[^أعحه][^أعحه]$/g.test(filteredVerb)) {
      if (/.ُ.[َُِ]?$/g.test(verb)) diacR = ""; //no change
      //explanation: verbs with three letters and have a dhamma
      //don't change the dhamma in present
    }

  }
  else if (filteredVerb.startsWith("ت")) diacR = "َ"; //no change

  if (opts.tense === Morpho.Tense.Pr) {

    /*if (verbInfo.len < 4 || ! filteredVerb.startsWith("ت")) {
      //sukuun
    }*/

    if (verbInfo.len === 4) {
      //verb = verb.replace(/^(.)[َُِْ]?/, "$1ْ");
      //verb = verb.replace(/^.َ?/, "");
      prefix = prefix.slice(0, -1) + "ُ";
      diacV = (/^.َ?(ا|.ّ)/.test(verb))? "َ": "ْ";
      //console.log(verb, diacV);
    }
  }
  else { //past
    //verb = verb.replace(/^(.)[َُِْ]?/, "$1َ");//This, for indicative active
    //TODO passive

    if (verbInfo.len === 4) {
      diacR = "َ";
      if (filteredVerb.startsWith("أ")) diacV = "ْ";
    }
  }

  //past or present
  if (/^ان.{3}$/.test(filteredVerb)) {
    diacV = "َ"; //fatha for V vocalization
    //console.log(verb);
  }

  conjVerb.v = verb;
  verbInfo.filter = filteredVerb;
  conjVerb.dV = diacV;
  conjVerb.dR = diacR;
  conjVerb.p = prefix;
}

function __diacreticsHandler(conjVerb) {
  let diacV = conjVerb.dV,
  diacR = conjVerb.dR,
  verb = conjVerb.v,
  filteredVerb = verbInfo.filter,
  fverb = verb.replace(/[َُِّْ]/g, ""),
  len = verbInfo.len;

  let  noR = (verbInfo.wm && (fverb.length === 2));


  if (diacV) {
    if (diacV === "X") diacV = "";//delete current one

    if (fverb.length < 4 || /^.ا../.test(fverb)) verb = verb.replace(/^(.)[َُِْ]?/, "$1" + diacV);
    else if (fverb.startsWith("است")) verb = verb.replace(/(ا[َُِْ]?س[َُِْ]?ت)[َُِْ]?/, "$1" + diacV);
    else if (len === 5 && /^ا.{3}$/.test(filteredVerb)) verb = verb.replace(/^(ا?[َُِْ]?.)[َُِْ]?/, "$1" + diacV);
    else if (/ت.{3}/.test(fverb)) verb = verb.replace(/(.ّ?)[َُِْ]?(.[َُِْ]?)$/, "$1" + diacV + "$2");
    else verb = verb.replace(/(.*[^َُِْ])[َُِْ]?([^َُِْ][َُِْ]?[^َُِْ][َُِْ]?)$/, "$1" + diacV + "$2");
  }

  if (diacR && !noR) {
    if (diacR === "X") diacR = "";//delete current one
    //if (/^(تَ?.َ?.َ)َ?(.َ?)$/.test(verb)) verb = verb.replace(/^(تَ?.َ?.َ)َ?(.َ?)$/, "$1" + diacR + "$2");
    //if it is not muda33af with two chars
    if (verbInfo.we && fverb.length === 2) verb = verb.replace(/^(.[َُِْ]?.)[َُِْ]?/, "$1" + diacR);
    else if (! (verbInfo.m && fverb.length === 2)) verb = verb.replace(/(.ّ?)[َُِْ]?(.ّ?)[َُِْ]?$/, "$1" + diacR + "$2");

  }

  /*if (diacB) {
    if (diacV === "X") diacV = "";//delete current one
    verb = verb.replace(/^(.)[َُِْ]?/, "$1" + diacV);
  }*/

  conjVerb.v = verb;
}

//==========================================
// CONJUGATION PREPROCESSOR FUNCTIONS
//==========================================

function __verbTypes(verb) {
  //delete spaces
  verb = verb.trim();

  verb = verb.replace(/^(.َ?.)َ?$/, "$1َّ");//if the verb has two chars add shadda in the end

  //verb = verb.replace(/^([^ا])[َُِ]?/, "$1َ"); //add fatha to the first char if not alif

  if (verb === verbInfo.verb) return;

  verbInfo.verb = verb;

  //replace Alif madda
  let filteredVerb = verb.replace("آ", "أا");
  //Muda33af
  filteredVerb = (/َ?ّ$/.test(verb))? filteredVerb + filteredVerb.slice(-1): filteredVerb;
  //delete diacretics
  filteredVerb = filteredVerb.replace(/[َُِّْ]/gi, "");//fat,dam,kas,shad,sukun

  verbInfo.filter = filteredVerb;


  verbInfo.len = filteredVerb.length + verb.replace(/[^ّ]/g, "").length;

  //detect if the verb with weak begining
  verbInfo.wb = /^[أاو]/.test(filteredVerb);//alif does not belong to mithal, but it has the same
  //yaa is ommited since it will not be deleted

  //detect if the verb has a weak middle
  verbInfo.wm = /[اآ].$/.test(filteredVerb);

  //detect if the verb has a weak ending
  verbInfo.we = /[اى]$/.test(filteredVerb);

  //detect if muda33af
  verbInfo.m = /َّ?$/.test(verb);

  //console.log(verbInfo);

}

/**
 * Giving the type of weak middle verb
 *
 * @method __weakMiddleOrigin
 * @private
 * @static
 * @memberof AraMorpho
 * @param  {String}         verb   the verb as introduced by user
 * @param  {String}         noDiac the verb filtered from vocalization, split shadda and split alif madda
 * @return {Number}                an integer representing the origin of the middle alif:
 * <ul>
 * <li>0: alif itself</li>
 * <li>1: waw</li>
 * <li>2: Yaa</li>
 * </ul>
 */
function __weakMiddleOrigin(verb, noDiac) {

  //This is used for optimization
  if (weakMiddleStack.verb === verb) return weakMiddleStack.res;

  weakMiddleStack.verb = verb;

  if (noDiac.length > 3) {//Always yaa
    weakMiddleStack.res = 2;
    return 2;
  }

  let noWeek = noDiac[0] + noDiac[2];
  let res = 0;

  if (midWaw[noWeek]) res = 1;
  else if (midYaa[noWeek]) res = 2;

  weakMiddleStack.res = res;
  return res;
}

function __noConjugation(opts) {

  //Some verbs don't have a passive voice since they are not transitive
  //In Arabic, you can detect some of them using patterns
  if (opts.voice === Morpho.Voice.P) {

    if (opts.mood === Morpho.Mood.Imp) return true;

    if (verbInfo.len > 4) {
      let filteredVerb = verbInfo.filter;
      if (filteredVerb.startsWith("ت")) return true;
      if (/^ان.{3}$/.test(filteredVerb)) return true;
      if (/^ا.{3}$/.test(filteredVerb)) return true;
    }
  }

  //Imperative
  if (opts.mood === Morpho.Mood.Imp) {
    if (opts.person !== Morpho.Person.S) return true;
  }

  return false;
}

/**
 * A function that gives the pronoun index in conjugation table
 *
 * @method __getPronounIndex
 * @private
 * @memberof AraMorpho
 * @param  {Object}        opts contains person, number and gender
 * @return {Number}             a number from 0 to 13
 */
function __getPronounIndex(opts) {

  if (opts.person === Morpho.Person.F) {
    if (opts.number === Morpho.GNumber.S) return 0;
    else return 1;
  }

  let personIdx = (Object.values(Morpho.Person).indexOf(opts.person)-1) * 6;
  let numberIdx = Object.values(Morpho.GNumber).indexOf(opts.number) * 2;
  let genderIdx = Object.values(Morpho.Gender).indexOf(opts.gender);

  return personIdx + numberIdx + genderIdx + 2;
}

//==========================================
// CONJUGATION NORMALIZATION FUNCTIONS
//==========================================

function __conjNormalizeYaa(verb) {
  //delete waw followed by sukun
  verb = verb.replace(/ِي(.ْ)/, "ِ$1");
  //delete sukuun on top of Yaa if preceeded by a kasra
  verb = verb.replace("ِيْ", "ِي");

  return verb;
}


function __conjNormalizeWaw(verb) {
  //delete waw followed by sukun
  verb = verb.replace(/ُو(.ْ)/, "ُ$1");
  //delete sukuun on top of waw if preceeded by a dhamma
  verb = verb.replace("ُوْ", "ُو");

  return verb;
}

/**
 * Normalizing alif after conjugation
 *
 * @method __conjNormalizeAlif
 * @private
 * @static
 * @memberof AraMorpho
 * @param  {String}          verb conjugated verb
 * @return {String}               verb with alif normalization
 */
function __conjNormalizeAlif(verb) {
  //order is important, don't change
  verb = verb.replace(/أْوِ/, "ؤُو");
  verb = verb.replace(/أَأْ/, "آ");
  verb = verb.replace(/أَا/, "آ");
  verb = verb.replace("أِي", "ئِي");
  verb = verb.replace(/ِأ(.?)/, "ئ$1");
  verb = verb.replace(/(.)أُو/, "$1ؤُو"); //alif followed by waw, but not first
  verb = verb.replace(/([ِي])ء([َُِْ].)/, "$1ئ$2");
  verb = verb.replace(/اءُ?و/, "اؤُو");
  verb = verb.replace("ِا", "ِي");
  verb = verb.replace(/َا(.ْ)/, "َ$1");
  verb = verb.replace("ُا", "ُو");

  return verb;
}

function __conjNormalizeWeakEnd(conjVerb, pronounIdx, opts) {

  let verb = conjVerb.v,
  prefix = conjVerb.p,
  suffix = conjVerb.s,
  tense = opts.tense;

  if (tense === Morpho.Tense.Pa) {
    if (opts.voice !== Morpho.Voice.P)
    if (pronounIdx === 8) {
      prefix = suffix = "";
      let ending = verb.slice(-1);
      verb = verb.slice(0, -1);
      if (ending === "ي") verb += "ى";
      else verb += "ا";
    }
    else if ([9, 11, 12].indexOf(pronounIdx) > -1 ) {
      verb = verb.slice(0, -1);
      if (/[وي]$/.test(verb)) verb = verb.slice(0, -1);
    }
  }
  else {//present

    if ([0, 1, 2, 8, 9].indexOf(pronounIdx) > -1) {
      if (opts.negated && conjVerb.t === Morpho.Tense.Pa) verb = verb.slice(0, -1);
      if (opts.voice === Morpho.Voice.P || !opts.negated || conjVerb.t === Morpho.Tense.Pa) suffix = "";
    }
    else if ([3, 6, 12].indexOf(pronounIdx) > -1) {
      verb = verb.slice(0, -1);
      if (/[وي]$/.test(verb)) verb = verb.slice(0, -1);
    }
  }

  conjVerb.v = verb;
  conjVerb.p = prefix;
  conjVerb.s = suffix;

}

AraMorpho._nStem("isri", "ISRI Arabic stemmer", __IsriAraStemmer);
//Morpho._nStem.call(this, "jslingua", "JsLingua Arabic stemmer", __jslinguaAraStemmer);

AraMorpho._nConv("sing2pl", "Singular noun to Plural", __singular2plural);
//Morpho._nConv.call(this, "sing2dual", "Singular noun to Dual", __singular2dual);

AraMorpho.stop_words = STOP_WORDS;

export default AraMorpho;
